{
  "study_programs": [
    {
      "id": "Tingenes internett og stordata - 10",
      "title": "Tingenes internett og stordata",
      "description": "Vil du forstå hvordan sensorer, nettverk og digitale systemer henger sammen – og hvordan store datamengder brukes for å forbedre moderne industri? Dette emnet gir deg en praktisk, hands‑on inngang til IoT, datanettverk og stordata i produksjonsmiljøer",
      "study_category": "Elektro",
      "study_location": {
        "0": "Kongsberg"
      },
      "study_type": {},
      "credits": 10,
      "language": "Norsk",
      "level": "Enkeltemne",
      "why_choose": "Dette emnet passer for deg som ønsker en oppdatert og praktisk forståelse av digitale teknologier som nå preger industrien. IoT og datafangst er avgjørende i moderne automatisering, og gjennom konkrete oppgaver med nettverk, databaser, skyteknologi og programmering får du ferdigheter som kan tas rett inn i arbeidslivet. Du lærer teknologiene bak smarte løsninger, sporing, datalogging og analyse – kompetanse som gjør deg mer attraktiv i en industri som stadig blir mer digitalisert.\nDette enkeltemnet er en del av utdanningsprogrammet | Industriell digitalisert automatisering | . Utdanningen består av tre korte og fleksible emner som hver gir 10 studiepoeng, og du kan velge å ta ett, to eller alle tre. Emnene kombinerer faglig innsikt, praktiske verktøy og casearbeid utviklet i samarbeid med næringslivet. I søknadsskjemaet velger du hvilke emner du vil ta. Du kan velge mellom enkeltemnene:\nOm du ønsker å ta dette enkeltemnet våren 2026 (oppstart uke 15) kan du | søke i vårt lokale søknadsskjema | . | Dersom du ønsker å ta alle tre emner skoleåret 2026/2027, kan du søke på hele utdanningsprogrammet i | Samordna opptak | fra og med | 1.februar 2026 | .\nDette utdanningsprogrammet er en del av | Industrifagskolen | .",
      "learnings": "I dette emnet lærer du hvordan datanettverk, databaser, skyteknologi og IoT‑enheter fungerer og brukes i industrien. Du får innsikt i maskinvare, operativsystemer og nettverkskommunikasjon (LAN, WAN, TCP/IP, trådløste nettverk), og lærer å jobbe med databaser og grunnleggende SQL.\nDu får jobbe praktisk med alt fra SQL‑spørringer og nettverksoppsett til programmering av Arduino‑enheter og cloud‑tjenester, samtidig som du får grunnleggende opplæring i datasikkerhet og dokumentasjon.\nUndervisningen kombinerer:",
      "teaching_format": null,
      "mandatory_attendance": "Gjennomføring av undervisning Skoleåret 2025/2026 - Våren 2026 Dette enkeltemnet er åpent for opptak for vårens gjennomføring med oppstart i uke 15. Du kan søke på dette enkeltemnet med vårt lokale søknadsskjema . Oppstart: Uke 15, tirsdag 07.april kl 18:25 - 20:05 (digitalt) Nettundervisning: Tirsdager kl 18:25 - 20:05 Fysisk samlingsuke i Kongsberg: Uke 18 (mandag 27.april - torsdag 30.april, kl 08:15 - 15:45) Skoleåret 2026/2027 Under planlegging. Informasjon kommer.",
      "police_certificate": null,
      "career_opportunities": "Etter dette emnet kan du bidra i arbeid knyttet til digitalisering, datafangst og drift av nettverks- og IoT‑løsninger i industrien. Du får kompetanse som er relevant for roller innen teknisk drift, produksjonsdata, sporingsteknologi, IT‑nære driftsfunksjoner og forbedringsarbeid i industrielle miljøer. Ferdighetene er etterspurt i virksomheter som ønsker å utnytte data bedre, ta i bruk IoT‑teknologi eller modernisere sine digitale systemer.",
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Studiekoordinator: | Helene Eikefjord – e-post: | heleneeik@afk.no | Du kan også melde din interesse i dette skjemaet, så vil vi ta kontakt med deg.",
      "study_url": "https://fagskolen-viken.no/studier/elektro/industriell-digitalisert-automatisering/tingenes-internett-og-stordata"
    }
  ],
  "courses": []
}