{
  "study_programs": [
    {
      "id": "Administrativ koordinator - 60",
      "title": "Administrativ koordinator",
      "description": "Administrativ koordinator er utdanningen for deg som vil ta neste steg i rollen som nøkkelperson i virksomheten. Du lærer å støtte ledere og avdelinger med trygg administrasjon, økonomi og prosjektarbeid og å skape god flyt i kommunikasjon, samhandling og rutiner på tvers.",
      "study_location": "Fredrikstad (Samlingsbasert 2 år)",
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Når oppgaver, systemer og mennesker skal spille sammen, trengs fagfolk som får hverdagen til å flyte. Med denne utdanningen bygger du en solid verktøykasse i administrasjon, økonomiforståelse, kommunikasjon og prosjektarbeid. Du trener på reelle situasjoner fra arbeidslivet og lærer å prioritere, strukturere og kvalitetssikre. Resultatet er økt trygghet i rollen, bedre støtte til ledere og team, og større påvirkningskraft i utviklingsarbeid som løfter hele organisasjonen.",
      "what_learn": "I studiet utvikler du kjernekompetanse i moderne kontordrift: strukturert saks- og dokumentarbeid, tydelig skriftlig og muntlig kommunikasjon, bruk av digitale verktøy, grunnleggende økonomi og effektiv lederstøtte. Du lærer å planlegge og gjennomføre endring, håndtere konflikter og drive små og mellomstore prosjekter med god kvalitet og fremdrift.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger | Studiet gjennomføres som nettbasert deltid med fysiske samlinger ved studiested Fredrikstad. Hvert emne har normalt én samling på tre dager, og det er ukentlig nettundervisning mellom samlingene. Tidspunkter kan justeres ved behov. | Oppdatert informasjon om samlingsuker, undervisningstider og eventuelle endringer publiseres på | studentsiden for Fredrikstad | . | Obligatorisk oppmøte | Du må delta på minst | 75 % av de fysiske samlingene | for å få vurdert eksamen. Praksis har egne regler for oppmøte – se studieplanen for detaljer. Manglende oppmøte kan føre til at du ikke får fullført emnet.",
      "police_certificate": null,
      "career_opportunities": "Med en fagskolegrad i | Administrativ koordinator | åpner det seg mange muligheter i både offentlig og privat sektor. Du blir en nøkkelperson som får hjulene til å gå rundt – en som skaper struktur, støtter ledelsen og bidrar til effektiv drift. | Kompetansen gjør deg kvalifisert for roller som | administrativ koordinator, kontorleder, teamleder, HR- eller personalmedarbeider, prosjektassistent eller prosjektkoordinator | . Du kan også jobbe som lederstøtte i små og store virksomheter der samhandling, planlegging og kvalitet er avgjørende for resultatet.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/ledelse/administrativ-koordinator"
    }
  ],
  "courses": [
    {
      "id": "02AL66A EILADK",
      "title": "Organisasjonsforståelse",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/02AL66A-EILADK/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | har kunnskap om hvordan lovverk og eksterne rammebetingelser påvirker organisasjoner | har kunnskap om grunnleggende organisasjonsteori og ulike organisasjonsmodeller | har kunnskap om og forståelse for organisasjonskulturer og organisasjonsledelser rolle og betydning | har kunnskap om sentrale ledelsesmodeller og deres bidrag til ledelsesteori | har kunnskap om ulike lederstiler og deres effekt på organisasjonene | har kunnskap om betydningen av rolle forståelser i organisasjoner",
        "skills": "Ferdigheter | Studenten | kan anvende faglig kunnskap om organisasjonsteorier og modeller | kan identifisere eksterne rammebetingelsers innvirkning på organisasjonenes drift | kan kartlegge organisasjonskulturens og organisasjonsledelses innvirkning på atferd og holdninger | kan anvende og sammenlikne grunnleggende prinsipper i ledelsesutfordringer | kan identifisere og tilpasse lederstiler til ulike situasjoner",
        "competence": "Generell kompetanse | Studenten | kan tilpasse ulike organisasjonsmodeller til ulike organisatoriske sammenhenger | har utviklet forståelse for bruk av aktuelt lovverk i strategisk planlegging og beslutningstaking | kan reflektere over de ulike teoretiske perspektiver og deres bidrag til ledelsesteori. | har forståelse for hvordan ulike lederstiler kan påvirke arbeidsmiljøet | kan reflektere over egen adferd og bidra til organisasjonens effektivitet gjennom god rolleforståelse"
      }
    },
    {
      "id": "02AL66B EILADK",
      "title": "Kommunikasjon, inkludert digitale verktøy",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/02AL66B-EILADK/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | har innsikt i aktuelle lovverk og forskrifter som regulerer kommunikasjon og samhandling | har kunnskap om aktuell kommunikasjonsteori, -teknikker og -former for muntlig og skriftlig kommunikasjon | har kunnskap om relevante teorier og metoder for konfliktforebygging og konflikthåndtering | har kunnskap om relevante forhandlingsteknikker og- strategier | har kunnskap om kulturelle forskjeller og deres betydning for kommunikasjon | har kunnskap om organisasjonsmangfold | har kunnskap om relasjonsbygging og vedlikehold | har kunnskap om relevante digitale verktøy og nettvett ved bruk av dette",
        "skills": "Ferdigheter | Studenten | kan anvende kunnskap om kommunikasjonsteori, -teknikker og -former for muntlig og skriftlig kommunikasjon for samhandling | kan identifisere mulige konfliktsituasjoner og iverksette forebyggende tiltak | kan anvende relevante konflikthåndtering strategier i praksis | kan anvende kunnskap om forhandlinger slik at det blir effektivt og profesjonelt | kan anvende lovverk i praktiske relevante situasjoner ved kommunikasjon og samhandling | kan utvikle og vedlikeholde profesjonelle relasjoner | kan anvende digitale verktøy i ulike oppgaver | kan anvende sikkerhetsprinsipper for å beskytte informasjon og personvern",
        "competence": "Generell kompetanse | Studenten | kan bygge relasjoner basert på likeverdighet og respekt. | kan tilpasse kommunikasjonen til ulike målgrupper og situasjoner. | kan bidra til å håndtere konflikter på en konstruktiv måte, bidra til løsninger og fremme et positivt arbeidsmiljø. | kan tilpasse forhandlingsstrategier til ulike situasjoner og parter. | kan fremme forståelse og samarbeid på tvers av kulturer. | kan anvende relasjonskompetanser for å fremme samarbeid og trivsel. | kan fremme god praksis for nettvett i organisasjonen. | kan integrere digitale verktøy i arbeidsprosesser for å øke produktiviteten, kommunikasjon og samarbeid | kan anvende KI på en etisk måte."
      }
    },
    {
      "id": "02AL66C EILADK",
      "title": "Administrativ lederstøtte, inkludert økonomi og personalarbeid",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/02AL66C-EILADK/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | har kunnskap om overordnede juridiske og etiske prinsipper for saksbehandling i både offentlige og private virksomheter | har kunnskap om grunnleggende prinsipper for logistikk | har innsikt i økonomiforvaltning, grunnleggende økonomiforståelse om budsjettering og regnskapsprinsipper | har kunnskap om prinsipper for tilgjengelighet og sikkerhet i dokumentforvaltning | har innsikt i arkivstandarder og metoder for klassifisering og gjenfinning av dokumenter | har kunnskap om HMS",
        "skills": "Ferdigheter | Studenten | kan anvende riktig terminologi i rollen som administrativ koordinator i skriftlig og muntlig kommunikasjon | kan identifisere, planlegge og gjennomføre relevante logistikkprosesser effektivt | kan kartlegge tiltak for å sikre tilgjengelighet og beskytte sensitiv informasjon og ivareta personvern i tråd med gjeldene lovverk og juridiske standarder | kan finne informasjon om lovverk som berører arbeidsoppgaver innen saksbehandling, arkivering, personalarbeid, HMS og økonomistyring",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre relevante logistikkprosesser for å støtte organisasjonens mål | har forståelse for hvordan vurdere og forbedre saksbehandlingsprosesser for å sikre effektivitet og kvalitet | har utviklet forståelse i sin yrkesutøvelse for hvordan ivareta og forbedre sikkerhetsrutiner i dokumentforvaltning | forstår viktigheten av HMS"
      }
    },
    {
      "id": "02AL66D EILADK",
      "title": "Endring og utvikling",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/02AL66D-EILADK/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | har kunnskap om relevante teorier og modeller for endringsledelse | har kunnskap om omstillingsprosesser og deres betydning for organisasjonens utvikling | har kunnskap om relevante innovasjonsteorier og – modeller, samt deres anvendelse i organisasjoner | har kunnskap om motivasjonsteori | har kunnskap om hva LEAN er og de viktigste prinsippene",
        "skills": "Ferdigheter | Studenten | kan anvende endringsledelse modeller i praktiske situasjoner for å lede og støtte endringsprosesser | kan identifisere, planlegge og gjennomføre omstillingsprosesser på en strukturert og effektiv måte. | kan anvende innovative løsninger på organisatoriske utfordringer. | kan anvende kunnskap til å motivere seg selv og andre. | kan anvende kunnskap om LEAN for å forbedre arbeidsprosesser",
        "competence": "Generell kompetanse | Studenten | kan kartlegge og tilpasse endringsstrategier for å møte organisasjonens behov og utfordringer | har utviklet forståelse for hvordan håndtere motstand og fremme aksept for omstilling i organisasjonen | kan bidra til å fremme en kultur for innovasjon og kontinuerlig forbedring i organisasjonen"
      }
    },
    {
      "id": "02AL66E EILADK",
      "title": "Kontordrift/ praktisk lederstøtte",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/02AL66E-EILADK/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | har kunnskap til prosjektgjennomføring",
        "skills": "Ferdigheter | Studenten | kan kartlegge problemstillinger i en organisasjon og planlegge tiltak med tanke på f.eks. HMS, kommunikasjon og /eller samarbeid internt og eksternt. | kan kartlegge behov for kollegaveiledning og iverksette undervisning",
        "competence": "Generell kompetanse | Studenten | kan planlegge, gjennomføre og evaluere prosjekter | har utviklet etisk grunnholdning ovenfor kollegaer, kunder og samarbeidspartnere preget av konfidensielt, personvern og i anvendelse av gjeldende lovverk"
      }
    },
    {
      "id": "02AL66F EILADK",
      "title": "Hovedprosjekt (faglig fordypning)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/02AL66F-EILADK/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | Har kunnskaper om hvordan skrive en prosjektrapport | Har kunnskap om sammenheng mellom teori og praksis | Har kunnskaper innenfor selvvalgt fordypningstema som dekkes i studieplanen | Kan vurdere eget prosjekt i forhold til gjeldene normer og krav",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for valg av tema for hovedprosjekt | kan identifisere, kartlegge og vurdere en faglig problemstilling med tilpasset metode | kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat | kan skrive en prosjektrapport | kan drøfte sammenhengen mellom teori og praksis | kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk | kan reflektere over eget prosjekt og justere dette under veiledning",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer | har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende | kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    }
  ]
}