{
  "study_programs": [
    {
      "id": "Akuttgeriatri - 30",
      "title": "Akuttgeriatri",
      "description": "Akuttgeriatri er videreutdanningen for deg som jobber med eldre pasienter og ønsker faglig trygghet når helsetilstanden endrer seg raskt. Du får verktøyene til å oppdage forverring tidlig, vurdere situasjonen strukturert og bidra til trygg, verdig og pasientsikker oppfølging – i både kommune- og spesialisthelsetjenesten.",
      "study_location": "Fredrikstad (Samlingsbasert 1 år)",
      "credits": 30,
      "language": "Norsk",
      "level": "Vitnemålsgivende studie",
      "why_choose": "Helse- og omsorgstjenesten møter stadig flere eldre med sammensatte behov. Når skrøpelighet, multimorbiditet og funksjonssvikt øker, blir akutte situasjoner mer komplekse – og små endringer kan få store konsekvenser. I møte med geriatriske pasienter handler god helsehjelp ofte om å oppdage tidlige tegn, forstå hva som kan ligge bak, og handle riktig i tide.\nVidereutdanning i akuttgeriatri er utviklet for å styrke rollen din i dette arbeidet. Kompetansen gjør det lettere å bidra aktivt i oppfølging og behandling, samarbeide godt med annet helsepersonell og ivareta pasientsikkerhet i pressede situasjoner. Du får også et tydeligere språk og bedre struktur i observasjon, dokumentasjon og rapportering – som gir trygghet for pasient, pårørende og teamet rundt.",
      "what_learn": "Du bygger spisskompetanse i akuttgeriatri, slik at du kan oppdage tidlige tegn på forverring hos eldre og bidra til rask, trygg og faglig forsvarlig oppfølging.\nDu jobber med temaer som aldring og sykdom, atypiske symptomer, akuttmedisinske tilstander, risikovurdering (fall, ernæring, trykksår og delirium), smittevern og relevant lovverk.\nLæringen er praksisnær og tar utgangspunkt i situasjoner du møter i tjenesten, med faglige verktøy for observasjon, kartlegging, dokumentasjon og strukturert kommunikasjon – og refleksjon rundt etikk og samarbeid med pasient og pårørende.\nStudiet er 30 studiepoeng og består av 3 emner. Du søker opptak til hele videreutdanningen.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger | Studiet gjennomføres som nettbasert deltidsutdanning med fysiske samlinger ved studiested Fredrikstad. Undervisningen kombinerer digitale læringsaktiviteter og samlinger på campus, med vekt på faglig forståelse, praktisk anvendelse og erfaringsdeling. | Samlingene holdes vanligvis flere ganger per semester og varer to til tre dager. Endelig plan for samlinger og undervisning publiseres på | studentsiden for Fredrikstad | før oppstart. | Obligatorisk oppmøte | Det er krav til oppmøte på fysiske samlinger. For å få sluttvurdering i emnene må du ha minimum 75 % oppmøte. Nærmere informasjon om oppmøtekrav og konsekvenser ved fravær finner du i studieplanen.",
      "police_certificate": null,
      "career_opportunities": "Videreutdanningen i akuttgeriatri styrker rollen din i oppfølging av akutt syke eldre, særlig i situasjoner der tidlig observasjon, faglige vurderinger og riktige tiltak er avgjørende for pasientsikkerhet og videre behandling. | Kompetansen brukes i samarbeid med annet helsepersonell, der du bidrar med strukturert dokumentasjon, tydelig kommunikasjon og helhetlig forståelse av pasientens behov. Dette gir et tryggere grunnlag for beslutninger i komplekse pasientsituasjoner og styrker kvaliteten i tjenestene. | Akuttgeriatrisk kompetanse er særlig etterspurt i spesialisthelsetjenesten, men også i helsehus, sykehjem og hjemmebaserte tjenester, og gir et solid faglig fundament for videre faglig utvikling og økt ansvar i yrkesrollen.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/helse/akuttgeriatri"
    }
  ],
  "courses": []
}