{
  "study_programs": [
    {
      "id": "Anlegg - 120",
      "title": "Anlegg",
      "description": "Anlegg er utdanningen for deg som vil ta neste steg i anleggsbransjen og lære å planlegge, lede og kvalitetssikre prosjekter fra start til ferdig anlegg. Du får solid faglig grunnlag i anleggsteknikk, prosjektstyring og bærekraft – og blir trygg i rollen som leder i et fagfelt som stadig utvikles.",
      "study_location": "Kongsberg (Samlingsbasert 3 år) | Kongsberg (Heltid 2 år)",
      "credits": 120,
      "language": "Norsk",
      "level": "Høyere fagskolegrad",
      "why_choose": "Anleggsbransjen står midt i en grønn omstilling med økende behov for fagfolk som kan kombinere praktisk erfaring med teknologisk og bærekraftig kompetanse. Dette studiet gir deg innsikten du trenger for å forstå hele verdikjeden – fra planlegging og prosjektering til ferdig anlegg.\nDu lærer å ta faglige og økonomiske beslutninger, følge opp HMS og kvalitet, og lede mennesker i komplekse prosjekter. Utdanningen passer for deg som vil bygge videre på fagbrevet, utvikle deg som leder og bidra til framtidens infrastruktur.\nGjennom studiet får du et sterkt fagmiljø, tett bransjekontakt og konkrete ferdigheter du kan bruke fra første dag i jobben.",
      "what_learn": "I den nettbaserte deltidsutdanningen i anlegg lærer du å planlegge, koordinere og lede anleggsprosjekter parallelt med jobb. Du får praktisk anvendbar kunnskap i anleggsteknikk, konstruksjon og materialer, og bruker verktøy som BIM, geomatikk og kalkyle for å sikre kvalitet, økonomi og fremdrift.\nDu styrker rollen som mellomleder eller prosjektleder gjennom arbeid med kontrakter, HMS, risikovurdering og myndighetskrav – med tydelig fokus på bærekraft og dokumentasjon.\nStudiet består av 10 emner og avsluttes med et hovedprosjekt fra egen eller bransjenær problemstilling.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger | Studiet kombinerer nettundervisning med fysiske samlinger ved studiested Kongsberg. Samlingene holdes vanligvis fire ganger per studieår og varer inntil en arbeidsuke. Mellom samlingene deltar du i nettundervisning på kveldstid, med forelesninger, veiledning og gruppearbeid. | Undervisningen foregår i læringsplattformen Teams, og du får tett faglig oppfølging fra lærere og medstudenter gjennom hele studiet. Oppdatert plan med detaljerte undervisningstider og samlingsuker for alle emner finner du på | studentsiden for Kongsberg | . | Obligatorisk oppmøte | Noen samlinger kan ha obligatoriske arbeidskrav eller oppmøteplikt. Se emnebeskrivelsene i studieplanen for detaljer. Ved fravær er du selv ansvarlig for å ta igjen tapt læring gjennom selvstudium.",
      "police_certificate": null,
      "career_opportunities": "Med en høyere fagskolegrad i anlegg får du kompetansen til å lede prosjekter som former morgendagens infrastruktur. Du kan ta ansvar for planlegging, produksjon og drift av anlegg, og sørge for at prosjekter gjennomføres sikkert, effektivt og i tråd med gjeldende krav og miljøstandarder. | Mange tidligere studenter går inn i roller som anleggsleder, byggeleder, prosjektleder eller arbeidsleder i entreprenørfirmaer, kommuner og konsulentselskaper. Andre arbeider med prosjektering, drift, kvalitetssikring eller kontraktsoppfølging i både offentlig og privat sektor. | Utdanningen gir deg også grunnlag for å undervise i anleggsfag eller bidra i utviklingsprosjekter der ny teknologi og bærekraftige løsninger står i sentrum. Du blir en fagperson som kombinerer praktisk erfaring med ledelse, kvalitet og innovasjon i en bransje med stort behov for kompetanse.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/bygg-og-anlegg/anlegg"
    }
  ],
  "courses": [
    {
      "id": "01TX00A",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om realfag som redskap innen sitt fagområde. | har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes | kan utføre beregninger, overslag og problemløsning relevant for dimensjoneringer og andre problemstillinger innen studieretningen | kan vurdere eget arbeid i henhold til matematiske og fysiske lover | kan utvide sine kunnskaper og har innsikt i egne utviklingsmuligheter innen realfag. | kjenner til matematikkens og fysikkens egenart og plass i samfunnet",
        "skills": "Ferdigheter | Studenten: | kan gjøre rede for valg av regnemetode som anvendes for å løse faglige problemer | kan gjøre rede for valg av digitale verktøy som anvendes til problemløsning innen realfaglige tema | kan anvende digitale hjelpemidler til å løse matematiske problemer | kan vurdere resultater av beregninger, samt reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til relevant informasjon og fagstoff i formelsamlinger, tabeller og fagbøker | kan kartlegge en situasjon og identifisere realfaglige problemstillinger | har kjennskap til og kan anvende grunnleggende fysiske lover og fysikkens metodikk | kan tolke og anvende modeller som benyttes innen matematikk og fysikk",
        "competence": "Generell kompetanse | Studenten: | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov | har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger | har innsikt i rekkevidde og begrensninger for de metoder som anvendes | kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om grunnleggende kommunikasjonsteori | kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen | har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde | har kunnskap om sentrale retoriske begreper og virkemidler | har kunnskap om kildebruk og referanseteknikk etter standard for høyere utdanning | kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter | har kjennskap til hvordan man organiserer og produserer tekst | har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne | har kunnskap om språket som verktøy for god kommunikasjon og kjenner til norsk og engelsk fagterminologi innen sitt fagområde | har kunnskap om grammatikk, sjangerforståelse samt språklige, stilistiske og grafiske virkemidler i tekst.",
        "skills": "Ferdigheter | Kandidaten: | kan reflektere over møter mellom forskjellige arbeidslivskulturer | kan bruke relevante begreper for å analysere egen og andres tekst | kan reflektere over og revidere tekster | kan reflektere over hvordan retorikk benyttes | kan bygge opp saklig argumentasjon og bruke retoriske virkemiddel | kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig | kan reflektere over egen kommunikasjon i profesjonell sammenheng | kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker | kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng | kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og tekstbinding | kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse | Kandidaten: | kan kommunisere hensiktsmessig for å bidra til en inkluderende og bærekraftig organisasjonskultur | kan tilpasse språk og argumentasjon etter mål og mottaker | kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting | behersker relevante kommunikasjonsverktøy | kan kommunisere gjennom relevante tekster og kanaler | kan samarbeide om tekstproduksjon | kan utvise etikk og gode holdninger i arbeidslivet | kan reflektere over ulike verdier og tenkemåter i samfunnet"
      }
    },
    {
      "id": "01TX00C",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak | har kunnskap om lønnskostnader | har kunnskaper om mål, tiltak og handlingsplaner | kjenner til emnets aktuelle lover og avtaler | har erfaringsbasert kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer.",
        "skills": "Ferdigheter | Kandidaten: | kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser | kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler | kan vurdere bedriftens betalingsevne og kapitalbehov | kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik | kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering | kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler | kan foreta en helhetlig prisvurdering og utarbeide kalkyler | kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten | kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel | kan identifisere, analysere og utvikle medarbeidernes kompetanse | kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon | kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse | kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier | kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes | kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse | Kandidaten | kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter | kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar | har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid | kan kommunisere internt og eksternt og benytte digitale verktøy til dette. | kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner | kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TB00A EITKBYK",
      "title": "Grunnleggende bygg og anlegg",
      "credits": 13,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB00A-EITKBYK/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om byggeprosesser for utendørs anlegg og konstruksjoner | har innsikt i tekniske standarder og krav. | har kunnskap om grøntanlegg, uteområder og landskap, inkludert bruk av dekketyper. | kan vurdere energitekniske løsninger i byggkonstruksjoner. | har kunnskap om krefter som virker på enkle konstruksjonselementer | har kunnskap om bygningsmaterialer og deres konstruksjonsmessige, bygningsfysiske og branntekniske egenskaper. | har kunnskap om byggematerialenes oppbygning, karakteristiske egenskaper og bruksområder. | kjenner til ordninger for merking, sertifisering og godkjenning av bygningsmaterialer. | har kunnskap om grunnleggende laboratorieøvelser og deres anvendelse i praktiske bygge- og anleggsprosjekter. | kan vurdere egnede byggematerialer for aktuell brukssituasjon og i samsvar med offentlige krav. | kjenner til materialbehandling og produksjonsprosesser for berg- og grusmasser. | har kunnskap om hvordan øke levetiden og sikre bærekraftige løsninger i bygg og anlegg. | kan vurdere og planlegge tiltak for å redusere avfall og miljøpåvirkning. | har kunnskap om ulike miljødeklarasjoner. | har kunnskap om bygg- og anleggsbransjens klimaavtrykk. | har kunnskap om gjenbruk, ombruk og resirkulering. | kjenner til ulike byggemetoder og materialvalg som bidrar til å redusere miljøpåvirkningen gjennom hele livssyklusen til bygninger og anlegg. | har innsikt i globale miljøutfordringer som klimaendringer og tap av biologisk mangfold. | har kunnskap om metoder for tilstandsanalyser, beregning av livssykluskostnader (LCC) og prinsipper for utarbeidelse av tilstandsrapporter, vedlikeholdsplaner og avfallsplaner | kan vurdere eget arbeid opp mot gjeldende regelverk, som bygningslovgivning, forskrifter, tekniske standarder, avtaler og kvalitetskrav | kjenner til hvordan man utarbeider tilstandsrapporter, vedlikeholdsplaner og avfallsplaner",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for faglige valg, utstyr og metoder i en byggeprosess | kan gjøre rede for krefter i konstruksjonselementer | kan anvende faglig kunnskap for å utføre beregninger | kan reflektere over aktuelle krav og metoder i forbindelse med grunnarbeider knyttet til ulike bygg- og anleggskonstruksjoner | kan gjøre rede for krav i standarder og sertifiseringer | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling | kan anvende prinsipper for miljøvennlig materialbruk og gjenbruk av ressurser i bygg- og anleggsprosjekter | kan gjøre rede for sine faglige valg knyttet til identifisering og håndtering av miljøutfordringer i prosjekter. | kan reflektere over løsninger som reduserer karbonavtrykket og fremmer sirkulær økonomi. | kan reflektere kritisk over egen faglig praksis og bidra til forbedring i tråd med miljø- og bærekrafts mål i sektoren | kan reflektere over de økonomiske fordelene ved sirkulære løsninger sammenlignet med tradisjonelle byggeprosesser | kan finne og henvise til informasjon og fagstoff om drift og produksjon av bygg og anlegg | kan gjøre rede for myndighetskrav og kan bruke FDV-dokumentasjon og LCC-analyser for å fremme bærekraftig drift og ressursutnyttelse | kan anvende lover, forskrifter, FDV-dokumentasjon og LCC-prinsipper i praksis",
        "competence": "Generell kompetanse | Kandidaten: | kan utveksle synspunkter med andre med bakgrunn fra bygg- og anleggsbransjen, og delta i diskusjoner om optimale løsninger på utfordrende bygg- og anleggsprosjekter | kan bidra til organisasjonsutvikling ved å følge med på ny teknologi innen bygg- og anleggsfaget | kan planlegge og gjennomføre et prosjekt, som deltaker eller leder av en gruppe, der hensynet til miljø ivaretas og arbeidet gjennomføres i tråd med gjeldende krav og regelverk | kan planlegge og gjennomføre tester av stein, pukk og grus | kan utveksle synspunkter for bruk av materialer som er miljøvennlige | kan utveksle synspunkter om miljøutfordringer og bærekraftige løsninger med kolleger og oppdragsgivere | kan bidra til utvikling av innovative og bærekraftige løsninger som fremmer redusert miljøbelastning i bygg- og anleggsnæringen | kan planlegge og gjennomføre tiltak som sikrer at drift og vedlikehold av bygg følger gjeldende myndighetskrav og bransjestandarder | kan utveksle synspunkter med andre ved å vurdere og kommunisere betydningen av god FDV-praksis og bærekraftige økonomiske valg gjennom livssykluskostnadsanalyser, og ved å samarbeide med ulike aktører for å sikre kvalitet og kostnadseffektivitet i byggforvaltning | kan bidra til organisasjonsutvikling ved å holde seg oppdatert på ny teknologi innen bygg- og anleggsfaget og anvende denne kunnskapen for å forbedre praksis og effektivitet i organisasjonen"
      }
    },
    {
      "id": "01TB00B EITKBYK",
      "title": "Digital byggeprosess",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB00B-EITKBYK/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om tegninger innen bygg-, anlegg- og tekniske fag | har kunnskap om bruk av IT-verktøy i en byggeprosess og utarbeide bransjerelaterte tegninger ved hjelp av et digitalt program | har kunnskap om håndtering av dokumenter og tegninger | har kunnskap om grunnleggende tegning og 3D-modellering | kjenner til den digitale rolle og betydning i bygg-/ anleggsbransjen, samt hvordan digitale arbeidsmetoder og samhandling endrer tradisjonelle praksiser og påvirker yrkets utvikling | har kunnskap om begreper, prosesser og verktøy som benyttes i alle faser av byggesaken | har kunnskap om aktuelle lover, forskrifter, vedtekter og standarder innen byggesaker | har kunnskap om bygg-/ anleggsbransjen og kjennskap til søknadsprosesser, og om hvordan bransjen forholder seg til kvalitetsstyring og HMS | kjenner til søknadsprosedyren en må følge i ei bygge- eller anleggssak | har kunnskap om kommuneplaner og reguleringsplaner, og hvordan disse legger føringer for byggeprosjekter, inkludert forståelse for hvordan reguleringsplaner påvirker arealbruk og utforming av bygg | kan vurdere eget arbeid i forhold til gjeldende lover, forskrifter og retningslinjer for byggeprosjekter | har kunnskap om krav til tegninger i byggesøknader | har kunnskap til produksjon av dokumentasjon til søknadsprosesser for aktuell tiltaksklasse | kan vurdere eget arbeid i forhold til etablerte standarder og prosedyrer for kvalitetsstyring, og har forståelse for hvordan kvalitetsstyring bidrar til økt sikkerhet og produktkvalitet i prosjekter | har kunnskap om kvalitet og HMS som en viktig del av all prosjektering, planlegging og utførelse innen byggesaker | kjenner til nye krav og retningslinjer, og hvordan disse legger føringer for byggeprosjekter | har kunnskap om bygg-/ anleggsbransjen og kjennskap til hvordan bransjen forholder seg til kvalitetsstyring og HMS",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for sine faglige valg innen grunnleggende tegning og tegningsproduksjon | kan reflektere over egen faglig utøvelse i modellering og justere denne i henhold til tilbakemeldinger og veiledning for å oppnå høyere presisjon og kvalitet i arbeidet | kan gjøre rede for søknadsprosessen i en byggesak | kan gjøre rede for krav i lover og forskrifter som angår kvalitet og HMS i byggesaker | kan reflektere over egen faglig utøvelse i byggesaker og justere denne under veiledning | kan finne og henvise til informasjon og fagstoff angående byggesaker og aktuelle arbeidsoppgaver | kan finne og henvise til lover, forskrifter og normer for å kunne planlegge og utarbeide søknad om byggetillatelse for tiltaksklasser | kan gjøre rede for sine faglige valg i forbindelse med søknadsprosessen | kan reflektere over egen faglig utøvelse i utarbeidelsen av søknader og justere disse etter tilbakemeldinger og gjeldende krav for å sikre godkjennelse fra myndighetene | kan finne og henvise til informasjon og fagstoff om lovverk og forskrifter som gjelder for byggesøknader | har gjøre rede for krav angående kvalitet og HMS i byggesaker | kan finne og henvise til lover, forskrifter, standarder og fagstoff angående byggesaker og aktuelle arbeidsoppgaver | kan reflektere over egen faglig utøvelse innen HMS- og KS-arbeid, og justere utøvelsen etter tilbakemeldinger",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre grunnleggende tegningsoppgaver og prosjekter i tråd med bransjens etiske krav og retningslinjer, både individuelt og som deltaker i en gruppe | kan planlegge og gjennomføre grunnleggende operasjoner i prosjekthotell, inkludert å administrere filer, dele modeller og samarbeide med andre aktører, samt navigere mellom tegninger og modeller fra andre fagfelt | kan bidra til relasjonsbygging med fagfeller innen bygg- og anleggsbransjen og på tvers av fag, samt med byggherrer og myndigheter | kan utveksle synspunkter med andre med bakgrunn innenfor bygg- og anleggsbransjen og delta i diskusjoner om utfordringer i byggesaker | kan bidra til organisasjonsutvikling ved å følge med på nye krav og retningslinjer i byggesaken | kan planlegge og gjennomføre søknadsprosesser i tråd med gjeldende lover, forskrifter og etiske retningslinjer, både individuelt og som del av et prosjektteam | kan planlegge og gjennomføre HMS-, SHA- og KS-oppgaver i tråd med lover, forskrifter og etiske krav | kan bidra til en sikkerhets- og kvalitetskultur på anlegg-/byggeplassen"
      }
    },
    {
      "id": "01TB02A EITKANK",
      "title": "Anleggsproduksjon",
      "credits": 17,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB02A-EITKANK/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om utregning av tid og kostnader av ulike typer anleggsarbeid | har kunnskap om bærekraftige tiltak som gjøres i planlegging og drift av anleggsplasser, transport og tjenester | har kunnskap om kalkulasjon og utarbeiding av enhetspriser og masseberegning | har kunnskap om digitale verktøy i forbindelse med kalkulasjon | har kunnskap og begreper om tildelingskriterier | Har kunnskap om utregning av maskinkapasitet og kostnader med utgraving og utskifting av masser | Har kunnskap om beskrivelsesstandardene NS3420 og prosesskodene | har kunnskap om den digitale flyten i anbuds- /tilbudsdokumenter | har kunnskap om relevante digitale verktøy og programvare for prosjektplanlegging | har kunnskap om prosjektgjennomføring, med fokus på optimal planlegging | har kunnskap om bruk av planer som styringsverktøy i prosjekter | har kunnskap om hvordan fremdrift og ressursbruk påvirker prosjektøkonomi | har kunnskap i bruken av Gantt- og nettverksdiagrammer | har kunnskap om entrepriseformene og kan fylle ut anbuds- /tilbudsdokumenter | har kunnskap i bruken av Norsk Standard som anvendes i anleggsbransjen | kjenner til relevante lover | kjenner organiseringen av arbeidet på egen arbeidsplass med tanke på planlegging, fordeling av arbeid, kontroll av kvalitet samt kontroll av framdrift og effektivitet | har kunnskap om de etiske, juridiske og økonomiske forutsetningene som gjelder for arbeidet | har kunnskap om begreper, prosesser og verktøy som benyttes for drift og produksjon av anlegg | har kunnskap om anleggsdrift | kjenner til relevant lovverk, standarder og forskrifter i bygg- og anleggsprosjekter | kan vurdere eget arbeid opp mot gjeldende lover, forskrifter, kontraktsdokumenter, håndbøker, kommunaltekniske normer og bransjenormer, og reflektere over hvordan disse påvirker utførelsen av bygg- og anleggsprosjekter | har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for sine faglige valg ved planlegging, tilrigging og massetransport for anleggsarbeid, herunder utslippsfri anleggsplass | kan gjøre rede for utføringsmetoder som sikrer bærekraftige anlegg | kan gjøre rede for sine faglige valg ved beregning av kapasiteter og timeverk på mannskap og maskiner | Kan reflektere over egen faglig utøvelse i produksjonsplanlegging | kan gjøre beregninger av ressurskostnader og timepriser | kan kalkulere med bruk av ressurser og kapasiteter | kan anvende digitale verktøy til mengdeberegning for nøyaktig materialbehov, redusert svinn og kostnadseffektiv prosjektplanlegging. | kan gjøre rede for sine faglige valg knyttet til anbud/tilbud og kontraktsformer | kan gjøre rede for sine faglige valg innen prosjektplanlegging | kan reflektere over egen faglig utøvelse i utvikling av prosjektplaner og justere disse i henhold til tilbakemeldinger | kan gjøre rede for valg av verktøy og metoder for planlegging av et prosjekts. | kan gjøre rede for sine faglige valg knyttet til anbud/tilbud og kontraktsformer | Kan gjøre rede for sine faglige valg i arbeidet med å utarbeide anbuds-, tilbuds- og kontraktsdokumenter i samsvar med gjeldende standarder og krav. | kan gjøre rede for valg av verktøy og metoder for planlegging av et prosjekts | kan reflektere over egen faglig utøvelse i samordningen av leverandører og spesialister på arbeidsplassen, og justere denne under veiledning for å sikre effektivt samarbeid og måloppnåelse. | kan reflektere over hvilke løsninger som er tatt for drift og produksjon av anlegget og justere disse under veiledning | kan finne og henvise til informasjon og fagstoff om drift og produksjon av anlegget og vurdere relevansen for et prosjekt | Kan gjøre rede for sine faglige valg i kontroll av materialer og utført arbeid, og forklare hvordan dette bidrar til kostnadseffektiv drift.",
        "competence": "Generell kompetanse | Kandidaten: | kan gjennomføre beregninger av kostnad og tidsforbruk ved ulike anleggsarbeider | kan utveksle synspunkter med andre om bærekraftige løsninger som gjenbruk av masser, fossilfritt drivstoff og eventuell reduksjon av transportbehov | kan planlegge og gjennomføre utforming av anbuds- og tilbudsgrunnlag, alene og i samarbeid med andre, i tråd med etiske krav og gjeldende retningslinjer. | kan bygge relasjoner og utveksle synspunkter innad i anleggsprosjektet, på tvers av fag, med leverandører og kunder | Kan utveksle synspunkter med andre om prosjektstyring og prosjektplanlegging | Kan bidra til en helhetlig og strukturert tilnærming til prosjektplanlegging | Kan gjennomføre prosjekter med fokus på optimal planlegging og effektiv fordeling av arbeidsoppgaver. | kan planlegge og gjennomføre komplette anbuds/tilbuds- og kontrakts prosesser | kan bidra til en profesjonell og strukturert anbuds/tilbudsprosess gjennom overholdelse av standarder og lovverk | kan planlegge og følge opp anbud, tilbud og kontrakter for å ivareta kontraktsmessige forpliktelser og rettigheter | kan planlegge og gjennomføre produksjon eller drift av anlegg, alene og i samarbeid med andre, i tråd med byggherrens krav, gjeldende regelverk og etiske retningslinjer. | kan bygge relasjoner med fagfeller innen produksjon og drift av anlegg | kan planlegge og gjennomføre et prosjekt med tanke på drift og produksjon, med økonomiske og miljømessige krav | kan planlegge og gjennomføre en produksjon i tråd med gjeldende forskrifter og kvalitetskrav"
      }
    },
    {
      "id": "01TB02B EITKANK",
      "title": "Geomatikk og BIM anlegg",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB02B-EITKANK/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om begreper, prosesser og instrumenter som benyttes innen geomatikk | har kunnskap om programvare for behandling av innmålte data og produksjon av data til utstikking og maskinstyring | har kunnskap om masseberegning med digitale verktøy | har innsikt i gjeldene lovverk og standarder i forbindelse med geomatikk | har kunnskap om bruk av BIM-manual i prosjekter og hvordan disse brukes som et styringsverktøy | har kunnskap om hvordan BIM brukes til å koordinere tekniske fag i prosjekter for å redusere konflikter og sikre effektiv installasjon | kjenner til metoder for mengdeberegning fra BIM-modeller | har kunnskap om prinsippene for 3D-modellering | har kunnskap om måleinstrumenter i geomatikk. GNSS-systemer, totalstasjoner, skannere og droner, og kjenne teorien bak hvordan de fungerer | har kunnskap om dataprogram til behandling av innmålte data, produksjon av data til utstikking i terreng og overføring av data til og fra andre dataprogram | har kunnskap om planlegging, utføring og etterarbeid i forbindelse med oppmåling og utstikking av veier, VA-Anlegg, byggegrop og tuneller | har kunnskap om dataflyt, SOSI(GML), dokumentasjon og målebrev | har kunnskap om masseberegning med egnet programvare | har kunnskap om matrikkel og eiendomsutmåling | har kunnskap om hva en bim-modell er | har kunnskap om 3D-modellering av terreng, vei og konstruksjoner | har kunnskap om produksjon av 3d-modeller med data fra drone. | kan vurdere eget arbeid i forhold til gjeldende normer og krav | har innsikt i egen fagkompetanse og utviklingsmuligheter",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for innhenting av kartdata og bruke GIS | kan gjøre rede for utarbeiding av dokumentasjon etter utførte oppgaver i felt | kan gjøre rede for bruk av relevante faglige verktøy for beregning av høyder og koordinater på punkt i kart og terreng | kan gjøre rede for bruk av faglig kunnskap til masseberegninger med data innhentet fra analoge og digitale kart | kan gjøre rede for grunnleggende prinsipper for 3D-modellering | kan gjøre rede for hvordan visualisering bidrar til kommunikasjon, planlegging og kvalitetssikring i byggeprosjekter | kan gjøre rede for hvordan BIM brukes til å koordinere tekniske installasjoner og løse konflikter mellom fagområder | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan gjøre rede for bruk av grunnlagsdata for maskinstyrt geomatikk | kan finne og bruke data fra en bim-modell | kan reflektere over valg av rett måleinstrument ved landmålingsoppdrag | kan gjøre rede for sine faglige valg ved gjennomføring av oppmålingsoppdrag med hjelp av instrument og dataprogram som er i bruk i dag | kan gjøre rede for bruk av digitale geomatikkverktøy | kan gjøre rede for innsamling og leveranse av “som bygget\"-dokumentasjon",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver | kan planlegge og gjennomføre oppgaver i BIM-prosjekter i tråd med BIM-manualer og standarder | Kan utveksle synspunkter og samarbeide med ulike fagområder for å sikre god samhandling i BIM-prosjekter | kan planlegge og innhente data til, og utføre masseberegninger med moderne digitale verktøy | kan planlegge og gjennomføre oppmålingsoppdrag og kontrollere landmålingsdata for anlegg | kan bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TB02C EITKANK",
      "title": "Konstruksjonslære anlegg",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB02C-EITKANK/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om materialers egenskaper | har kunnskap om konstruksjonsløsninger på bygg i ulike materialer, som tre, stål og betong | har kunnskap om hvordan en beregner laster på bygningskonstruksjoner | har kunnskap om dimensjonering av enkle betongdekker, bjelker og søyler | har kunnskap om gjeldende eurokoder | kan vurdere eget arbeid i forhold til gjeldende normer og krav | kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet | har innsikt i egne utviklingsmuligheter | har kunnskap om løsmassen sin sammensetning og klassifisering | har kunnskap om geotekniske forhold. | kan vurdere fare for ras og setninger | kjenner til grunnvann i løsmasser og berg | kjenner til utstyr og metoder for utføring av grunnundersøkelser og laboratoriearbeid | har kunnskap om begreper og regelverk i forhold til konstruksjonsfag og geotekniske | kjenner til og har innsikt i fundamentering, spunting og komprimering | kjenner til konsekvensene av å fundamentere på grunn med varierende bæreevne | har kunnskap om skråningsstabilitet, jordtrykk og de ulike fundamenteringsmetodene | har kunnskap om sikkerhet i byggegroper, grøfter og sjakter | kjenner til geosynteter, geotekstiler, armering av jord, fyllinger, skråninger, støttemurer og fundament | har kunnskap om ingeniørgeologi | har kunnskap om grunnundersøkelser og beregninger av grunnens kvalitet med resultat fra geoteknisk laboratorium | har kunnskap om konsekvenser ved å tilføre last på grunnen med tanke på setningsproblematikk, skråningsstabilitet og jordtrykk | har kunnskap om sikringstiltak ved ulike byggesituasjoner | kan vurdere fare for utrasing og setninger | kan vurdere faremoment ved gravearbeid",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for valg av konstruksjonsløsning | kan gjøre rede for valg av materialkvalitet til ulike konstruksjoner | kan gjøre rede for hvordan en dimensjonerer konstruksjoner i betong, tre og stål | kan gjøre rede for hvordan man leser og tegner enkle betong- og armerings tegninger | kan reflektere over hvilke løsninger som er tatt for konstruksjoner på bygg og justere disse under veiledning | kan gjøre rede for krefter som virker på enkle konstruksjonselementer | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre konstruksjonsarbeid for byggverk som deltaker eller leder av gruppe | kan planlegge og gjennomføre et konstruksjonsarbeid etter kundens ønsker og myndigheters krav | kan bygge relasjoner med fagfeller innen konstruksjon av bygg og på tvers av fag | kan utveksle synspunkter med andre med bakgrunn innenfor konstruksjon av bygg og delta i diskusjoner | kan gjennomføre jordartsberegninger basert på resultat fra rutineundersøkinger fra geoteknisk laboratorium | kan gjennomføre enkle bæreevneberegninger av en direktefundamentert konstruksjon | kan gjennomføre overslagsberegninger for skråningsstabilitet (lamelle- og direktemetoden) | kan gjennomføre beregninger på spenningsforhold i jorda med totale og effektive spenninger, drenerte og udrenerte spenningsendringer i grunn med variert lagdeling, og i tillegg gjøre greie for resultantkraft og hvor den angriper"
      }
    },
    {
      "id": "01TB02D EITKANK",
      "title": "Anleggsteknikk",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB02D-EITKANK/2028-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om kapasitet for ulike typer bore- og transportutstyr, og kan velge egnet utstyr til arbeidsoppdrag | kjenner til viktigheten av boring for å oppnå best mulig resultat | har kunnskap om driving av tunnel | har kunnskap om planlegging av bakstuffarbeid og kan beskrive regler for ventilasjon av tunnel | har kunnskap om vanlige sivile sprengstoff og tennere, og bruksområde for disse | har kunnskap om risikoanalyse og dekking av salve | har kunnskap om tunnel, pall- og grøftesprenging og teknisksprengning | har kunnskap om egnet boremønster, utrekning av ladningsmengder og planlegging av tennerekkefølge og rystelser | har kunnskap om å lage rutiner for alle typer sprengningsarbeid i henhold til gjeldende lovverk | har kunnskap om bolting og sikring | kjenner til beregninger av rystelser og bølger som følge av sprengning | kan vurdere boremønster og forhold som påvirker | har kunnskap om verktøy og utstyr som anvendes innenfor fjellarbeid | har kunnskap om dimensjonering og beregning av ledninger for vann og avløp | har kunnskap om rensing av drikke- og avløpsvann | kjenner til aktuelle lover og forskrifter som gjelder drikkevann og avløpsanlegg | kjenner overordnede mål i avfallspolitikken for husholdningsavfall, næringsavfall og bygge- og anleggsavfall | har kunnskap om rørmateriell og teknologi. | kjenner til hvordan rør monteres i grunnen | har kunnskap om styrt boring og rehabilitering av rør uten graving (no-dig) i forbindelse med VA-arbeid | kan vurdere og utlede sikkerheten og sikkerhetstiltak ved grøftearbeider | har kunnskap om faktorer knyttet til grunnvann, overvann og drenering som påvirker VA anlegg | kjenner til drift, vedlikehold og rehabilitering av vann og avløpsanlegg | har kunnskap på å lede korrekt utførelse av ledningsanlegg i grunnen | kjenner til anleggskonstruksjonen sin historie, tradisjon, egenart og plass i samfunnet | har kunnskap om løsmasser i forbindelse med anleggsarbeider og risiko og tiltak forbundet med det | har kunnskap om byggemetoder for enkle bro- og kaikonstruksjoner, dammer og kraftverk | har kunnskap om generelle metoder for oppbygging av vei- og baneanlegg | har kjennskap til ventilasjon i tunellarbeid | kjenner til ulike metoder for lensing | har kunnskap om driving av tunnel | kan vurdere eget arbeid med konstruksjon av anlegg i forhold til gjeldende regelverk og standarder innen anleggskonstruksjoner | kjenne til produksjon og legging av vegdekker | kjenne til vedlikehold av veg- og baneanlegg | kan kunnskap til tabeller for å beregne nødvendig pumpekapasitet i forhold til løftehøyder og friksjonstap i rør og slanger | har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter | Kandidaten: | gjøre rede for sine faglige valg av utstyr | kan gjøre rede for grunnleggende hydrauliske prinsipper anvendt på VA-sektoren | kan reflektere over egen faglig utøvelse og dimensjonere ledningssystem og pumpesystem for VA | kan reflektere over egen faglig utøvelse og avløpsledninger, vannledninger og overvannsbehandling | kan anvende relevante lover med tilhørende forskrifter og normer | kan gjøre rede for prosjektering, planlegging og utføring av anleggsarbeid | kan reflektere over egen faglig utøvelse og lede utføring av bro- og kaikonstruksjoner, dammer og kraftverk | kan finne og henvise til informasjon og fagstoff om konstruksjoner av anlegg og vurdere relevansen for et anleggsprosjekt | kan gjøre rede for sine faglige valg i arbeidet med montering og vedlikehold av ventilasjon | kan finne og henvise til informasjon og fagstoff og forklare prinsippene for ventilasjon under jord",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre tilrigging og massetransport for fjellarbeid | kan planlegge og gjennomføre sprengningsarbeid over og under bakkenivå, og tilfredsstiller teorikravene til sertifikat for bergsprengningsleder | kan utføre beregninger forventa vannmengde i brønn | kan planlegge og gjennomføre arbeid med å etablere vann og avløp i mindre anlegg | kan planlegge og gjennomføre bygging av vann- og avløpsanlegg | kan planlegge og gjennomføre drift, vedlikehold og rehabilitering av ledningsnett for VA | kan gjennomføre grunnvannsberegninger | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer | kan planlegge og gjennomføre anleggskonstruksjon med tanke på funksjon, bruk, miljø og offentlige krav | kan planlegge og gjennomføre drift, vedlikehold og rehabilitering av anleggskonstruksjoner | kan planlegge og gjennomføre vannlensing, ventilasjon og annet bakstuffarbeid | kan utveksle synspunkter med andre med bakgrunn innenfor konstruksjon av anlegg og delta i diskusjoner om sikker, økonomisk og miljøvennlig praksis"
      }
    },
    {
      "id": "01TX00H",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om hvordan man skriver en prosjektrapport | har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen | har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt | har kunnskap om sammenhengen mellom teori og praksis | kan vurdere eget prosjekt i forhold til gjeldende normer og krav | kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for valg av tema for hovedprosjekt | kan identifisere, kartlegge og vurdere en faglig problemstilling | kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat | kan skrive en prosjektrapport | kan drøfte sammenhengen mellom teori og praksis | kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk | kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer | har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende | kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov | kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    },
    {
      "id": "01TX00A",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om realfag som redskap innen sitt fagområde. | har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes | kan utføre beregninger, overslag og problemløsning relevant for dimensjoneringer og andre problemstillinger innen studieretningen | kan vurdere eget arbeid i henhold til matematiske og fysiske lover | kan utvide sine kunnskaper og har innsikt i egne utviklingsmuligheter innen realfag. | kjenner til matematikkens og fysikkens egenart og plass i samfunnet",
        "skills": "Ferdigheter | Studenten: | kan gjøre rede for valg av regnemetode som anvendes for å løse faglige problemer | kan gjøre rede for valg av digitale verktøy som anvendes til problemløsning innen realfaglige tema | kan anvende digitale hjelpemidler til å løse matematiske problemer | kan vurdere resultater av beregninger, samt reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til relevant informasjon og fagstoff i formelsamlinger, tabeller og fagbøker | kan kartlegge en situasjon og identifisere realfaglige problemstillinger | har kjennskap til og kan anvende grunnleggende fysiske lover og fysikkens metodikk | kan tolke og anvende modeller som benyttes innen matematikk og fysikk",
        "competence": "Generell kompetanse | Studenten: | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov | har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger | har innsikt i rekkevidde og begrensninger for de metoder som anvendes | kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B",
      "title": "Yrkesrettet kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om grunnleggende kommunikasjonsteori | kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen | har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde | har kunnskap om sentrale retoriske begreper og virkemidler | har kunnskap om kildebruk og referanseteknikk etter standard for høyere utdanning | kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter | har kjennskap til hvordan man organiserer og produserer tekst | har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne | har kunnskap om språket som verktøy for god kommunikasjon og kjenner til norsk og engelsk fagterminologi innen sitt fagområde | har kunnskap om grammatikk, sjangerforståelse samt språklige, stilistiske og grafiske virkemidler i tekst.",
        "skills": "Ferdigheter | Kandidaten: | kan reflektere over møter mellom forskjellige arbeidslivskulturer | kan bruke relevante begreper for å analysere egen og andres tekst | kan reflektere over og revidere tekster | kan reflektere over hvordan retorikk benyttes | kan bygge opp saklig argumentasjon og bruke retoriske virkemiddel | kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig | kan reflektere over egen kommunikasjon i profesjonell sammenheng | kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker | kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng | kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og tekstbinding | kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse | Kandidaten: | kan kommunisere hensiktsmessig for å bidra til en inkluderende og bærekraftig organisasjonskultur | kan tilpasse språk og argumentasjon etter mål og mottaker | kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting | behersker relevante kommunikasjonsverktøy | kan kommunisere gjennom relevante tekster og kanaler | kan samarbeide om tekstproduksjon | kan utvise etikk og gode holdninger i arbeidslivet | kan reflektere over ulike verdier og tenkemåter i samfunnet"
      }
    },
    {
      "id": "01TX00C",
      "title": "LØM (Ledelse, økonomistyring og markedsføringsledelse)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak | har kunnskap om lønnskostnader | har kunnskaper om mål, tiltak og handlingsplaner | kjenner til emnets aktuelle lover og avtaler | har erfaringsbasert kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer.",
        "skills": "Ferdigheter | Kandidaten: | kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser | kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler | kan vurdere bedriftens betalingsevne og kapitalbehov | kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik | kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering | kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler | kan foreta en helhetlig prisvurdering og utarbeide kalkyler | kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten | kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel | kan identifisere, analysere og utvikle medarbeidernes kompetanse | kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon | kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse | kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier | kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes | kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse | Kandidaten | kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter | kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar | har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid | kan kommunisere internt og eksternt og benytte digitale verktøy til dette. | kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner | kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TB00A EITKBYK",
      "title": "Grunnleggende bygg og anlegg",
      "credits": 13,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB00A-EITKBYK/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om byggeprosesser for utendørs anlegg og konstruksjoner | har innsikt i tekniske standarder og krav. | har kunnskap om grøntanlegg, uteområder og landskap, inkludert bruk av dekketyper. | kan vurdere energitekniske løsninger i byggkonstruksjoner. | har kunnskap om krefter som virker på enkle konstruksjonselementer | har kunnskap om bygningsmaterialer og deres konstruksjonsmessige, bygningsfysiske og branntekniske egenskaper. | har kunnskap om byggematerialenes oppbygning, karakteristiske egenskaper og bruksområder. | kjenner til ordninger for merking, sertifisering og godkjenning av bygningsmaterialer. | har kunnskap om grunnleggende laboratorieøvelser og deres anvendelse i praktiske bygge- og anleggsprosjekter. | kan vurdere egnede byggematerialer for aktuell brukssituasjon og i samsvar med offentlige krav. | kjenner til materialbehandling og produksjonsprosesser for berg- og grusmasser. | har kunnskap om hvordan øke levetiden og sikre bærekraftige løsninger i bygg og anlegg. | kan vurdere og planlegge tiltak for å redusere avfall og miljøpåvirkning. | har kunnskap om ulike miljødeklarasjoner. | har kunnskap om bygg- og anleggsbransjens klimaavtrykk. | har kunnskap om gjenbruk, ombruk og resirkulering. | kjenner til ulike byggemetoder og materialvalg som bidrar til å redusere miljøpåvirkningen gjennom hele livssyklusen til bygninger og anlegg. | har innsikt i globale miljøutfordringer som klimaendringer og tap av biologisk mangfold. | har kunnskap om metoder for tilstandsanalyser, beregning av livssykluskostnader (LCC) og prinsipper for utarbeidelse av tilstandsrapporter, vedlikeholdsplaner og avfallsplaner | kan vurdere eget arbeid opp mot gjeldende regelverk, som bygningslovgivning, forskrifter, tekniske standarder, avtaler og kvalitetskrav | kjenner til hvordan man utarbeider tilstandsrapporter, vedlikeholdsplaner og avfallsplaner",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for faglige valg, utstyr og metoder i en byggeprosess | kan gjøre rede for krefter i konstruksjonselementer | kan anvende faglig kunnskap for å utføre beregninger | kan reflektere over aktuelle krav og metoder i forbindelse med grunnarbeider knyttet til ulike bygg- og anleggskonstruksjoner | kan gjøre rede for krav i standarder og sertifiseringer | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling | kan anvende prinsipper for miljøvennlig materialbruk og gjenbruk av ressurser i bygg- og anleggsprosjekter | kan gjøre rede for sine faglige valg knyttet til identifisering og håndtering av miljøutfordringer i prosjekter. | kan reflektere over løsninger som reduserer karbonavtrykket og fremmer sirkulær økonomi. | kan reflektere kritisk over egen faglig praksis og bidra til forbedring i tråd med miljø- og bærekrafts mål i sektoren | kan reflektere over de økonomiske fordelene ved sirkulære løsninger sammenlignet med tradisjonelle byggeprosesser | kan finne og henvise til informasjon og fagstoff om drift og produksjon av bygg og anlegg | kan gjøre rede for myndighetskrav og kan bruke FDV-dokumentasjon og LCC-analyser for å fremme bærekraftig drift og ressursutnyttelse | kan anvende lover, forskrifter, FDV-dokumentasjon og LCC-prinsipper i praksis",
        "competence": "Generell kompetanse | Kandidaten: | kan utveksle synspunkter med andre med bakgrunn fra bygg- og anleggsbransjen, og delta i diskusjoner om optimale løsninger på utfordrende bygg- og anleggsprosjekter | kan bidra til organisasjonsutvikling ved å følge med på ny teknologi innen bygg- og anleggsfaget | kan planlegge og gjennomføre et prosjekt, som deltaker eller leder av en gruppe, der hensynet til miljø ivaretas og arbeidet gjennomføres i tråd med gjeldende krav og regelverk | kan planlegge og gjennomføre tester av stein, pukk og grus | kan utveksle synspunkter for bruk av materialer som er miljøvennlige | kan utveksle synspunkter om miljøutfordringer og bærekraftige løsninger med kolleger og oppdragsgivere | kan bidra til utvikling av innovative og bærekraftige løsninger som fremmer redusert miljøbelastning i bygg- og anleggsnæringen | kan planlegge og gjennomføre tiltak som sikrer at drift og vedlikehold av bygg følger gjeldende myndighetskrav og bransjestandarder | kan utveksle synspunkter med andre ved å vurdere og kommunisere betydningen av god FDV-praksis og bærekraftige økonomiske valg gjennom livssykluskostnadsanalyser, og ved å samarbeide med ulike aktører for å sikre kvalitet og kostnadseffektivitet i byggforvaltning | kan bidra til organisasjonsutvikling ved å holde seg oppdatert på ny teknologi innen bygg- og anleggsfaget og anvende denne kunnskapen for å forbedre praksis og effektivitet i organisasjonen"
      }
    },
    {
      "id": "01TB00B EITKBYK",
      "title": "Digital byggeprosess",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB00B-EITKBYK/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om tegninger innen bygg-, anlegg- og tekniske fag | har kunnskap om bruk av IT-verktøy i en byggeprosess og utarbeide bransjerelaterte tegninger ved hjelp av et digitalt program | har kunnskap om håndtering av dokumenter og tegninger | har kunnskap om grunnleggende tegning og 3D-modellering | kjenner til den digitale rolle og betydning i bygg-/ anleggsbransjen, samt hvordan digitale arbeidsmetoder og samhandling endrer tradisjonelle praksiser og påvirker yrkets utvikling | har kunnskap om begreper, prosesser og verktøy som benyttes i alle faser av byggesaken | har kunnskap om aktuelle lover, forskrifter, vedtekter og standarder innen byggesaker | har kunnskap om bygg-/ anleggsbransjen og kjennskap til søknadsprosesser, og om hvordan bransjen forholder seg til kvalitetsstyring og HMS | kjenner til søknadsprosedyren en må følge i ei bygge- eller anleggssak | har kunnskap om kommuneplaner og reguleringsplaner, og hvordan disse legger føringer for byggeprosjekter, inkludert forståelse for hvordan reguleringsplaner påvirker arealbruk og utforming av bygg | kan vurdere eget arbeid i forhold til gjeldende lover, forskrifter og retningslinjer for byggeprosjekter | har kunnskap om krav til tegninger i byggesøknader | har kunnskap til produksjon av dokumentasjon til søknadsprosesser for aktuell tiltaksklasse | kan vurdere eget arbeid i forhold til etablerte standarder og prosedyrer for kvalitetsstyring, og har forståelse for hvordan kvalitetsstyring bidrar til økt sikkerhet og produktkvalitet i prosjekter | har kunnskap om kvalitet og HMS som en viktig del av all prosjektering, planlegging og utførelse innen byggesaker | kjenner til nye krav og retningslinjer, og hvordan disse legger føringer for byggeprosjekter | har kunnskap om bygg-/ anleggsbransjen og kjennskap til hvordan bransjen forholder seg til kvalitetsstyring og HMS",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for sine faglige valg innen grunnleggende tegning og tegningsproduksjon | kan reflektere over egen faglig utøvelse i modellering og justere denne i henhold til tilbakemeldinger og veiledning for å oppnå høyere presisjon og kvalitet i arbeidet | kan gjøre rede for søknadsprosessen i en byggesak | kan gjøre rede for krav i lover og forskrifter som angår kvalitet og HMS i byggesaker | kan reflektere over egen faglig utøvelse i byggesaker og justere denne under veiledning | kan finne og henvise til informasjon og fagstoff angående byggesaker og aktuelle arbeidsoppgaver | kan finne og henvise til lover, forskrifter og normer for å kunne planlegge og utarbeide søknad om byggetillatelse for tiltaksklasser | kan gjøre rede for sine faglige valg i forbindelse med søknadsprosessen | kan reflektere over egen faglig utøvelse i utarbeidelsen av søknader og justere disse etter tilbakemeldinger og gjeldende krav for å sikre godkjennelse fra myndighetene | kan finne og henvise til informasjon og fagstoff om lovverk og forskrifter som gjelder for byggesøknader | har gjøre rede for krav angående kvalitet og HMS i byggesaker | kan finne og henvise til lover, forskrifter, standarder og fagstoff angående byggesaker og aktuelle arbeidsoppgaver | kan reflektere over egen faglig utøvelse innen HMS- og KS-arbeid, og justere utøvelsen etter tilbakemeldinger",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre grunnleggende tegningsoppgaver og prosjekter i tråd med bransjens etiske krav og retningslinjer, både individuelt og som deltaker i en gruppe | kan planlegge og gjennomføre grunnleggende operasjoner i prosjekthotell, inkludert å administrere filer, dele modeller og samarbeide med andre aktører, samt navigere mellom tegninger og modeller fra andre fagfelt | kan bidra til relasjonsbygging med fagfeller innen bygg- og anleggsbransjen og på tvers av fag, samt med byggherrer og myndigheter | kan utveksle synspunkter med andre med bakgrunn innenfor bygg- og anleggsbransjen og delta i diskusjoner om utfordringer i byggesaker | kan bidra til organisasjonsutvikling ved å følge med på nye krav og retningslinjer i byggesaken | kan planlegge og gjennomføre søknadsprosesser i tråd med gjeldende lover, forskrifter og etiske retningslinjer, både individuelt og som del av et prosjektteam | kan planlegge og gjennomføre HMS-, SHA- og KS-oppgaver i tråd med lover, forskrifter og etiske krav | kan bidra til en sikkerhets- og kvalitetskultur på anlegg-/byggeplassen"
      }
    },
    {
      "id": "01TB02A EITKANK",
      "title": "Anleggsproduksjon",
      "credits": 17,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB02A-EITKANK/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om utregning av tid og kostnader av ulike typer anleggsarbeid | har kunnskap om bærekraftige tiltak som gjøres i planlegging og drift av anleggsplasser, transport og tjenester | har kunnskap om kalkulasjon og utarbeiding av enhetspriser og masseberegning | har kunnskap om digitale verktøy i forbindelse med kalkulasjon | har kunnskap og begreper om tildelingskriterier | Har kunnskap om utregning av maskinkapasitet og kostnader med utgraving og utskifting av masser | Har kunnskap om beskrivelsesstandardene NS3420 og prosesskodene | har kunnskap om den digitale flyten i anbuds- /tilbudsdokumenter | har kunnskap om relevante digitale verktøy og programvare for prosjektplanlegging | har kunnskap om prosjektgjennomføring, med fokus på optimal planlegging | har kunnskap om bruk av planer som styringsverktøy i prosjekter | har kunnskap om hvordan fremdrift og ressursbruk påvirker prosjektøkonomi | har kunnskap i bruken av Gantt- og nettverksdiagrammer | har kunnskap om entrepriseformene og kan fylle ut anbuds- /tilbudsdokumenter | har kunnskap i bruken av Norsk Standard som anvendes i anleggsbransjen | kjenner til relevante lover | kjenner organiseringen av arbeidet på egen arbeidsplass med tanke på planlegging, fordeling av arbeid, kontroll av kvalitet samt kontroll av framdrift og effektivitet | har kunnskap om de etiske, juridiske og økonomiske forutsetningene som gjelder for arbeidet | har kunnskap om begreper, prosesser og verktøy som benyttes for drift og produksjon av anlegg | har kunnskap om anleggsdrift | kjenner til relevant lovverk, standarder og forskrifter i bygg- og anleggsprosjekter | kan vurdere eget arbeid opp mot gjeldende lover, forskrifter, kontraktsdokumenter, håndbøker, kommunaltekniske normer og bransjenormer, og reflektere over hvordan disse påvirker utførelsen av bygg- og anleggsprosjekter | har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for sine faglige valg ved planlegging, tilrigging og massetransport for anleggsarbeid, herunder utslippsfri anleggsplass | kan gjøre rede for utføringsmetoder som sikrer bærekraftige anlegg | kan gjøre rede for sine faglige valg ved beregning av kapasiteter og timeverk på mannskap og maskiner | Kan reflektere over egen faglig utøvelse i produksjonsplanlegging | kan gjøre beregninger av ressurskostnader og timepriser | kan kalkulere med bruk av ressurser og kapasiteter | kan anvende digitale verktøy til mengdeberegning for nøyaktig materialbehov, redusert svinn og kostnadseffektiv prosjektplanlegging. | kan gjøre rede for sine faglige valg knyttet til anbud/tilbud og kontraktsformer | kan gjøre rede for sine faglige valg innen prosjektplanlegging | kan reflektere over egen faglig utøvelse i utvikling av prosjektplaner og justere disse i henhold til tilbakemeldinger | kan gjøre rede for valg av verktøy og metoder for planlegging av et prosjekts. | kan gjøre rede for sine faglige valg knyttet til anbud/tilbud og kontraktsformer | Kan gjøre rede for sine faglige valg i arbeidet med å utarbeide anbuds-, tilbuds- og kontraktsdokumenter i samsvar med gjeldende standarder og krav. | kan gjøre rede for valg av verktøy og metoder for planlegging av et prosjekts | kan reflektere over egen faglig utøvelse i samordningen av leverandører og spesialister på arbeidsplassen, og justere denne under veiledning for å sikre effektivt samarbeid og måloppnåelse. | kan reflektere over hvilke løsninger som er tatt for drift og produksjon av anlegget og justere disse under veiledning | kan finne og henvise til informasjon og fagstoff om drift og produksjon av anlegget og vurdere relevansen for et prosjekt | Kan gjøre rede for sine faglige valg i kontroll av materialer og utført arbeid, og forklare hvordan dette bidrar til kostnadseffektiv drift.",
        "competence": "Generell kompetanse | Kandidaten: | kan gjennomføre beregninger av kostnad og tidsforbruk ved ulike anleggsarbeider | kan utveksle synspunkter med andre om bærekraftige løsninger som gjenbruk av masser, fossilfritt drivstoff og eventuell reduksjon av transportbehov | kan planlegge og gjennomføre utforming av anbuds- og tilbudsgrunnlag, alene og i samarbeid med andre, i tråd med etiske krav og gjeldende retningslinjer. | kan bygge relasjoner og utveksle synspunkter innad i anleggsprosjektet, på tvers av fag, med leverandører og kunder | Kan utveksle synspunkter med andre om prosjektstyring og prosjektplanlegging | Kan bidra til en helhetlig og strukturert tilnærming til prosjektplanlegging | Kan gjennomføre prosjekter med fokus på optimal planlegging og effektiv fordeling av arbeidsoppgaver. | kan planlegge og gjennomføre komplette anbuds/tilbuds- og kontrakts prosesser | kan bidra til en profesjonell og strukturert anbuds/tilbudsprosess gjennom overholdelse av standarder og lovverk | kan planlegge og følge opp anbud, tilbud og kontrakter for å ivareta kontraktsmessige forpliktelser og rettigheter | kan planlegge og gjennomføre produksjon eller drift av anlegg, alene og i samarbeid med andre, i tråd med byggherrens krav, gjeldende regelverk og etiske retningslinjer. | kan bygge relasjoner med fagfeller innen produksjon og drift av anlegg | kan planlegge og gjennomføre et prosjekt med tanke på drift og produksjon, med økonomiske og miljømessige krav | kan planlegge og gjennomføre en produksjon i tråd med gjeldende forskrifter og kvalitetskrav"
      }
    },
    {
      "id": "01TB02B EITKANK",
      "title": "Geomatikk og BIM anlegg",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB02B-EITKANK/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om begreper, prosesser og instrumenter som benyttes innen geomatikk | har kunnskap om programvare for behandling av innmålte data og produksjon av data til utstikking og maskinstyring | har kunnskap om masseberegning med digitale verktøy | har innsikt i gjeldene lovverk og standarder i forbindelse med geomatikk | har kunnskap om bruk av BIM-manual i prosjekter og hvordan disse brukes som et styringsverktøy | har kunnskap om hvordan BIM brukes til å koordinere tekniske fag i prosjekter for å redusere konflikter og sikre effektiv installasjon | kjenner til metoder for mengdeberegning fra BIM-modeller | har kunnskap om prinsippene for 3D-modellering | har kunnskap om måleinstrumenter i geomatikk. GNSS-systemer, totalstasjoner, skannere og droner, og kjenne teorien bak hvordan de fungerer | har kunnskap om dataprogram til behandling av innmålte data, produksjon av data til utstikking i terreng og overføring av data til og fra andre dataprogram | har kunnskap om planlegging, utføring og etterarbeid i forbindelse med oppmåling og utstikking av veier, VA-Anlegg, byggegrop og tuneller | har kunnskap om dataflyt, SOSI(GML), dokumentasjon og målebrev | har kunnskap om masseberegning med egnet programvare | har kunnskap om matrikkel og eiendomsutmåling | har kunnskap om hva en bim-modell er | har kunnskap om 3D-modellering av terreng, vei og konstruksjoner | har kunnskap om produksjon av 3d-modeller med data fra drone. | kan vurdere eget arbeid i forhold til gjeldende normer og krav | har innsikt i egen fagkompetanse og utviklingsmuligheter",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for innhenting av kartdata og bruke GIS | kan gjøre rede for utarbeiding av dokumentasjon etter utførte oppgaver i felt | kan gjøre rede for bruk av relevante faglige verktøy for beregning av høyder og koordinater på punkt i kart og terreng | kan gjøre rede for bruk av faglig kunnskap til masseberegninger med data innhentet fra analoge og digitale kart | kan gjøre rede for grunnleggende prinsipper for 3D-modellering | kan gjøre rede for hvordan visualisering bidrar til kommunikasjon, planlegging og kvalitetssikring i byggeprosjekter | kan gjøre rede for hvordan BIM brukes til å koordinere tekniske installasjoner og løse konflikter mellom fagområder | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan gjøre rede for bruk av grunnlagsdata for maskinstyrt geomatikk | kan finne og bruke data fra en bim-modell | kan reflektere over valg av rett måleinstrument ved landmålingsoppdrag | kan gjøre rede for sine faglige valg ved gjennomføring av oppmålingsoppdrag med hjelp av instrument og dataprogram som er i bruk i dag | kan gjøre rede for bruk av digitale geomatikkverktøy | kan gjøre rede for innsamling og leveranse av “som bygget\"-dokumentasjon",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver | kan planlegge og gjennomføre oppgaver i BIM-prosjekter i tråd med BIM-manualer og standarder | Kan utveksle synspunkter og samarbeide med ulike fagområder for å sikre god samhandling i BIM-prosjekter | kan planlegge og innhente data til, og utføre masseberegninger med moderne digitale verktøy | kan planlegge og gjennomføre oppmålingsoppdrag og kontrollere landmålingsdata for anlegg | kan bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TB02C EITKANK",
      "title": "Konstruksjonslære anlegg",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB02C-EITKANK/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om materialers egenskaper | har kunnskap om konstruksjonsløsninger på bygg i ulike materialer, som tre, stål og betong | har kunnskap om hvordan en beregner laster på bygningskonstruksjoner | har kunnskap om dimensjonering av enkle betongdekker, bjelker og søyler | har kunnskap om gjeldende eurokoder | kan vurdere eget arbeid i forhold til gjeldende normer og krav | kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet | har innsikt i egne utviklingsmuligheter | har kunnskap om løsmassen sin sammensetning og klassifisering | har kunnskap om geotekniske forhold. | kan vurdere fare for ras og setninger | kjenner til grunnvann i løsmasser og berg | kjenner til utstyr og metoder for utføring av grunnundersøkelser og laboratoriearbeid | har kunnskap om begreper og regelverk i forhold til konstruksjonsfag og geotekniske | kjenner til og har innsikt i fundamentering, spunting og komprimering | kjenner til konsekvensene av å fundamentere på grunn med varierende bæreevne | har kunnskap om skråningsstabilitet, jordtrykk og de ulike fundamenteringsmetodene | har kunnskap om sikkerhet i byggegroper, grøfter og sjakter | kjenner til geosynteter, geotekstiler, armering av jord, fyllinger, skråninger, støttemurer og fundament | har kunnskap om ingeniørgeologi | har kunnskap om grunnundersøkelser og beregninger av grunnens kvalitet med resultat fra geoteknisk laboratorium | har kunnskap om konsekvenser ved å tilføre last på grunnen med tanke på setningsproblematikk, skråningsstabilitet og jordtrykk | har kunnskap om sikringstiltak ved ulike byggesituasjoner | kan vurdere fare for utrasing og setninger | kan vurdere faremoment ved gravearbeid",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for valg av konstruksjonsløsning | kan gjøre rede for valg av materialkvalitet til ulike konstruksjoner | kan gjøre rede for hvordan en dimensjonerer konstruksjoner i betong, tre og stål | kan gjøre rede for hvordan man leser og tegner enkle betong- og armerings tegninger | kan reflektere over hvilke løsninger som er tatt for konstruksjoner på bygg og justere disse under veiledning | kan gjøre rede for krefter som virker på enkle konstruksjonselementer | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre konstruksjonsarbeid for byggverk som deltaker eller leder av gruppe | kan planlegge og gjennomføre et konstruksjonsarbeid etter kundens ønsker og myndigheters krav | kan bygge relasjoner med fagfeller innen konstruksjon av bygg og på tvers av fag | kan utveksle synspunkter med andre med bakgrunn innenfor konstruksjon av bygg og delta i diskusjoner | kan gjennomføre jordartsberegninger basert på resultat fra rutineundersøkinger fra geoteknisk laboratorium | kan gjennomføre enkle bæreevneberegninger av en direktefundamentert konstruksjon | kan gjennomføre overslagsberegninger for skråningsstabilitet (lamelle- og direktemetoden) | kan gjennomføre beregninger på spenningsforhold i jorda med totale og effektive spenninger, drenerte og udrenerte spenningsendringer i grunn med variert lagdeling, og i tillegg gjøre greie for resultantkraft og hvor den angriper"
      }
    },
    {
      "id": "01TB02D EITKANK",
      "title": "Anleggsteknikk",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB02D-EITKANK/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om kapasitet for ulike typer bore- og transportutstyr, og kan velge egnet utstyr til arbeidsoppdrag | kjenner til viktigheten av boring for å oppnå best mulig resultat | har kunnskap om driving av tunnel | har kunnskap om planlegging av bakstuffarbeid og kan beskrive regler for ventilasjon av tunnel | har kunnskap om vanlige sivile sprengstoff og tennere, og bruksområde for disse | har kunnskap om risikoanalyse og dekking av salve | har kunnskap om tunnel, pall- og grøftesprenging og teknisksprengning | har kunnskap om egnet boremønster, utrekning av ladningsmengder og planlegging av tennerekkefølge og rystelser | har kunnskap om å lage rutiner for alle typer sprengningsarbeid i henhold til gjeldende lovverk | har kunnskap om bolting og sikring | kjenner til beregninger av rystelser og bølger som følge av sprengning | kan vurdere boremønster og forhold som påvirker | har kunnskap om verktøy og utstyr som anvendes innenfor fjellarbeid | har kunnskap om dimensjonering og beregning av ledninger for vann og avløp | har kunnskap om rensing av drikke- og avløpsvann | kjenner til aktuelle lover og forskrifter som gjelder drikkevann og avløpsanlegg | kjenner overordnede mål i avfallspolitikken for husholdningsavfall, næringsavfall og bygge- og anleggsavfall | har kunnskap om rørmateriell og teknologi. | kjenner til hvordan rør monteres i grunnen | har kunnskap om styrt boring og rehabilitering av rør uten graving (no-dig) i forbindelse med VA-arbeid | kan vurdere og utlede sikkerheten og sikkerhetstiltak ved grøftearbeider | har kunnskap om faktorer knyttet til grunnvann, overvann og drenering som påvirker VA anlegg | kjenner til drift, vedlikehold og rehabilitering av vann og avløpsanlegg | har kunnskap på å lede korrekt utførelse av ledningsanlegg i grunnen | kjenner til anleggskonstruksjonen sin historie, tradisjon, egenart og plass i samfunnet | har kunnskap om løsmasser i forbindelse med anleggsarbeider og risiko og tiltak forbundet med det | har kunnskap om byggemetoder for enkle bro- og kaikonstruksjoner, dammer og kraftverk | har kunnskap om generelle metoder for oppbygging av vei- og baneanlegg | har kjennskap til ventilasjon i tunellarbeid | kjenner til ulike metoder for lensing | har kunnskap om driving av tunnel | kan vurdere eget arbeid med konstruksjon av anlegg i forhold til gjeldende regelverk og standarder innen anleggskonstruksjoner | kjenne til produksjon og legging av vegdekker | kjenne til vedlikehold av veg- og baneanlegg | kan kunnskap til tabeller for å beregne nødvendig pumpekapasitet i forhold til løftehøyder og friksjonstap i rør og slanger | har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter | Kandidaten: | gjøre rede for sine faglige valg av utstyr | kan gjøre rede for grunnleggende hydrauliske prinsipper anvendt på VA-sektoren | kan reflektere over egen faglig utøvelse og dimensjonere ledningssystem og pumpesystem for VA | kan reflektere over egen faglig utøvelse og avløpsledninger, vannledninger og overvannsbehandling | kan anvende relevante lover med tilhørende forskrifter og normer | kan gjøre rede for prosjektering, planlegging og utføring av anleggsarbeid | kan reflektere over egen faglig utøvelse og lede utføring av bro- og kaikonstruksjoner, dammer og kraftverk | kan finne og henvise til informasjon og fagstoff om konstruksjoner av anlegg og vurdere relevansen for et anleggsprosjekt | kan gjøre rede for sine faglige valg i arbeidet med montering og vedlikehold av ventilasjon | kan finne og henvise til informasjon og fagstoff og forklare prinsippene for ventilasjon under jord",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre tilrigging og massetransport for fjellarbeid | kan planlegge og gjennomføre sprengningsarbeid over og under bakkenivå, og tilfredsstiller teorikravene til sertifikat for bergsprengningsleder | kan utføre beregninger forventa vannmengde i brønn | kan planlegge og gjennomføre arbeid med å etablere vann og avløp i mindre anlegg | kan planlegge og gjennomføre bygging av vann- og avløpsanlegg | kan planlegge og gjennomføre drift, vedlikehold og rehabilitering av ledningsnett for VA | kan gjennomføre grunnvannsberegninger | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer | kan planlegge og gjennomføre anleggskonstruksjon med tanke på funksjon, bruk, miljø og offentlige krav | kan planlegge og gjennomføre drift, vedlikehold og rehabilitering av anleggskonstruksjoner | kan planlegge og gjennomføre vannlensing, ventilasjon og annet bakstuffarbeid | kan utveksle synspunkter med andre med bakgrunn innenfor konstruksjon av anlegg og delta i diskusjoner om sikker, økonomisk og miljøvennlig praksis"
      }
    },
    {
      "id": "01TX00H",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om hvordan man skriver en prosjektrapport | har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen | har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt | har kunnskap om sammenhengen mellom teori og praksis | kan vurdere eget prosjekt i forhold til gjeldende normer og krav | kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for valg av tema for hovedprosjekt | kan identifisere, kartlegge og vurdere en faglig problemstilling | kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat | kan skrive en prosjektrapport | kan drøfte sammenhengen mellom teori og praksis | kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk | kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer | har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende | kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov | kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    }
  ]
}