{
  "study_programs": [
    {
      "id": "Automatisering - 120",
      "title": "Automatisering",
      "description": "Alt som kan automatiseres, kommer til å bli det. Prosesser i industrien og automasjon i bygninger er selvsagte i en slik utvikling, men også mange andre fagområder kommer til å bli berørt. Automasjonssystemer blir mer og mer aktuelt i moderne industri, og behovet for fagpersoner er økende.",
      "study_category": "Elektro",
      "study_location": {
        "0": "Kongsberg",
        "2": "Kjeller"
      },
      "study_type": {
        "10": "Samlingsbasert 4 år",
        "11": "Heltid 2 år"
      },
      "credits": 120,
      "language": "Norsk",
      "level": "Høyere fagskolegrad",
      "why_choose": "Faget automatisering er høyteknologi i praksis og et fagområde i rivende utvikling. Faget krever innsikt i mange fagområder, og utdanningen legger vekt på en helhetlig tilnærming til faget, med både teori, kreativitet og praktiske ferdigheter. En fagskoleingeniør innen automatisering må ha både solid praksis og en oppdatert teoretisk utdanning. Fordypningen kan omfatte følgende områder: reguleringsteknikk, teknisk kybernetikk, styring, reguleringsteknikk, instrumentering, PLS- programmering, feltbus-systemer, prosesskontroll og overvåkning.",
      "what_learn": "Du lærer å planlegge, bygge og kvalitetssikre automatiserte systemer i industri og bygg. Studiet dekker elektriske og elektroniske systemer, måleteknikk, PLS-programmering etter IEC 61131-3, reguleringsteknikk og instrumentering, ekom-regelverk og dokumentasjon. Du arbeider også med industriell digitalisering, fra ERP-integrasjon og skyteknologi til IoT og autonome logistikk-løsninger, og lærer å teste, igangkjøre og optimalisere produksjonssystemer. Undervisningen kombinerer teori, simuleringsarbeid og praksisnære oppgaver med veiledning. Utdanningen består av ti emner inkludert hovedprosjekt. Du søker opptak til hele studiet og oppnår en høyere fagskolegrad, når du har gjennomført studiet. | Klikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger Deltidsløpet kombinerer nettundervisning med fysiske samlinger på Kongsberg. Samlingene holdes vanligvis flere ganger per semester og varer to til tre dager. Mellom samlingene har du nettmøter etter fast plan, og veiledning individuelt eller i gruppe. Tidspunkter og samlingsuker publiseres i læringsplattformen før oppstart. Endelig plan publiseres på studentsiden for Kongsberg .",
      "police_certificate": null,
      "career_opportunities": "Etter studiet kan du ta ansvar for planlegging og gjennomføring av arbeidet i automatiserte anlegg i prosessindustri på land og offshore. Du kan også jobbe i produksjons- og installasjonsbedrifter, innen teknisk rådgivning, med salg eller i undervisning.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/elektro/automatisering"
    }
  ],
  "courses": [
    {
      "id": "01TX00A",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om realfag som redskap innen sitt fagområde. har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes kan utføre beregninger, overslag og problemløsning relevant for dimensjoneringer og andre problemstillinger innen studieretningen kan vurdere eget arbeid i henhold til matematiske og fysiske lover kan utvide sine kunnskaper og har innsikt i egne utviklingsmuligheter innen realfag. kjenner til matematikkens og fysikkens egenart og plass i samfunnet",
        "skills": "Ferdigheter Studenten: kan gjøre rede for valg av regnemetode som anvendes for å løse faglige problemer kan gjøre rede for valg av digitale verktøy som anvendes til problemløsning innen realfaglige tema kan anvende digitale hjelpemidler til å løse matematiske problemer kan vurdere resultater av beregninger, samt reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til relevant informasjon og fagstoff i formelsamlinger, tabeller og fagbøker kan kartlegge en situasjon og identifisere realfaglige problemstillinger har kjennskap til og kan anvende grunnleggende fysiske lover og fysikkens metodikk kan tolke og anvende modeller som benyttes innen matematikk og fysikk",
        "competence": "Generell kompetanse Studenten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger har innsikt i rekkevidde og begrensninger for de metoder som anvendes kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om grunnleggende kommunikasjonsteori kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde har kunnskap om sentrale retoriske begreper og virkemidler har kunnskap om kildebruk og referanseteknikk etter standard for høyere utdanning kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter har kjennskap til hvordan man organiserer og produserer tekst har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne har kunnskap om språket som verktøy for god kommunikasjon og kjenner til norsk og engelsk fagterminologi innen sitt fagområde har kunnskap om grammatikk, sjangerforståelse samt språklige, stilistiske og grafiske virkemidler i tekst.",
        "skills": "Ferdigheter Kandidaten: kan reflektere over møter mellom forskjellige arbeidslivskulturer kan bruke relevante begreper for å analysere egen og andres tekst kan reflektere over og revidere tekster kan reflektere over hvordan retorikk benyttes kan bygge opp saklig argumentasjon og bruke retoriske virkemiddel kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig kan reflektere over egen kommunikasjon i profesjonell sammenheng kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og tekstbinding kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse Kandidaten: kan kommunisere hensiktsmessig for å bidra til en inkluderende og bærekraftig organisasjonskultur kan tilpasse språk og argumentasjon etter mål og mottaker kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting behersker relevante kommunikasjonsverktøy kan kommunisere gjennom relevante tekster og kanaler kan samarbeide om tekstproduksjon kan utvise etikk og gode holdninger i arbeidslivet kan reflektere over ulike verdier og tenkemåter i samfunnet"
      }
    },
    {
      "id": "01TX00C",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak har kunnskap om lønnskostnader har kunnskaper om mål, tiltak og handlingsplaner kjenner til emnets aktuelle lover og avtaler har erfaringsbasert kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer.",
        "skills": "Ferdigheter Kandidaten: kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler kan vurdere bedriftens betalingsevne og kapitalbehov kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler kan foreta en helhetlig prisvurdering og utarbeide kalkyler kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel kan identifisere, analysere og utvikle medarbeidernes kompetanse kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse Kandidaten kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid kan kommunisere internt og eksternt og benytte digitale verktøy til dette. kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TE00G",
      "title": "Elektriske systemer",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE00G/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om grunnleggende elektriske lover og formler og forstår virkemåte og oppbygging av elektriske kretselementer og systemer har kunnskap om DC-kretser og AC-kretser som inneholder resistanser, kapasitanser og induktanser, strømkilder og spenningskilder har kunnskap om aktuelle matematiske modeller, beregningsmetoder og nettverksteoremer for ulike elektriske kretselementer har kunnskap om måleteknikk for elektriske systemer og bruk av relevant måleverktøy har kunnskap om krav til framstilling og oppdatering av dokumentasjon innen fagområdet elektro, samt kan forstå dokumentasjon fra andre tekniske fagområder kan vurdere om dokumentasjon er i henhold til gjeldende normer, bransjestandarder og krav til kvalitet for arbeid med elektriske systemer",
        "skills": "Ferdigheter Studenten kan gjøre rede for strømmer, spenninger og effekter i sammensatte parallelle og seriekoblede elektriske DC-kretser og AC-kretser som inneholder resistanser, kapasitanser og induktanser, strømkilder og spenningskilder kan gjøre rede for valg av simuleringsverktøy for beregning av strømmer og spenninger i elektriske kretser kan gjennom laboratoriearbeid/simulering anvende relevant måleutstyr for måling og feilsøking på elektriske kretselementer og systemer, og vurdere måleresultatene kan reflektere over resultater fra målinger med relevant måleutstyr på elektriske systemer og justere disse under veiledning kan gjøre rede for valg av dokumentasjon innen fagområdet elektro, samt forstå dokumentasjon fra andre tekniske fagområder kan reflektere over egen faglig utøvelse innen elektriske systemer og justere denne under veiledning",
        "competence": "Generell kompetanse Studenten kan planlegge, dokumentere og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter i forbindelse med elektriske systemer alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan utveksle synspunkter med andre med bakgrunn innen elektrofaget og delta i diskusjoner for å vurdere fagspesifikke problemstillinger"
      }
    },
    {
      "id": "01TE00F EITKELFH24",
      "title": "Elektroniske systemer",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE00F-EITKELFH24/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om oppbygging og virkemåte til digitale og analoge systemer har kunnskap om ulike metoder for elektronisk kommunikasjon og overføring av signaler mellom enheter har kunnskap om kvalitetsvurdering av kommunikasjonsløsninger og dimensjonering av analoge og digitale systemer har kunnskap om begreper og definisjoner innen datanettverk og nettverksstrukturer har kunnskap om mikrokontrollerkretser og bruken av disse har kunnskap om ESD og måleteknikk for elektroniske systemer og bruk av relevant måleverktøy",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av komponenter og utstyr til digitale og analoge systemer fra datablader og teknisk dokumentasjon og ta hensyn til EMC i forbindelse med støypåvirkning og temperaturendringer kan gjøre rede for valg av simuleringsverktøy til elektroniske systemer for test og verifisering av virkemåte kan gjennom laboratoriearbeid/simulering anvende relevant måleutstyr for måling og feilsøking på elektroniske systemer, og vurdere måleresultatene kan reflektere over resultater fra målinger med relevant måleutstyr på elektroniske systemer og justere disse under veiledning kan gjøre rede for valg av elektroniske tegneverktøy til framstilling- og systematisering av dokumentasjon kan reflektere over egen faglig utøvelse innen elektroniske systemer og justere denne under veiledning",
        "competence": "Generell kompetanse Studenten kan planlegge, dokumentere og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter i forbindelse med elektriske systemer alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan utveksle synspunkter med andre med bakgrunn innen elektrofaget og delta i diskusjoner for å vurdere fagspesifikke problemstillinger"
      }
    },
    {
      "id": "01TE01A",
      "title": "Styringssystemer",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE01A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om relevante komponenter som brukes i moderne industrielle prosesser. har kunnskap om industrielle styresystemer. har kunnskap om design av brukergrensesnitt for operasjon av industrielle prosesser har kunnskap om programmering av PLS og dokumentasjon av PLS programmer i en industriell sammenheng",
        "skills": "Ferdigheter Studenten kan gjøre rede for relevante komponenter som brukes i moderne industrielle sammenhenger kan gjøre rede for prosjektering av aktuelle styresystemer. kan gjøre rede for kalibrering og justering av instrumenter innen styringssystemer kan gjøre rede for brukergrensesnitt for operasjon av industrielle prosesser. kan reflektere over egen og andres faglige utførelse innen moderne industrielle sammenhenger og implementere endringer basert på erfaring kan finne og henvise til teknisk informasjon og fagstoff for produkter og systemer, samt vurdere relevansen mot en yrkesfaglig problemstilling kan gjøre rede for programmering av PLS og dokumentasjon av PLS programmer i en industriell sammenheng",
        "competence": "Generell kompetanse Studenten kan i samarbeid med andre yrkesgrupper planlegge, prosjektere, dokumentere, implementere og drifte produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som gjelder innenfor moderne industrielle sammenhenger kan bygge relasjoner over egen og andres faglige utførelse innen moderne industrielle sammenhenger kan utveksle synspunkter og henvise til teknisk og innovativ informasjon og fagstoff om moderne industrielle sammenhenger og produksjon for produkt og systemer"
      }
    },
    {
      "id": "01TE01B",
      "title": "Industriell Digitalisering",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE01B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om virkemåte og anvendelse av aktuelle sporingsteknologier som strekkoder, QR koder og RFID (Radio-frequency identification, radiofrekvensidentifikasjon) kan vurdere nytteverdien av innsamlede data, definere KPI-er (nøkkelindikatorer), spesifisere databehov og kilder, vurdere datakvalitet samt utstyr for innsamling av data har kunnskap om prinsippene for aktuell teknologi for datalagring, lokalt og over nettverk har kunnskap om prinsippene for aktuell programvare som støtter opp om flere av en bedrifts virksomhetsområder, som produksjon, lager, salg, innkjøp og økonomi (ERP system - Enterprise Resource Planning) har kunnskap om prinsippene for tjenester i nettskyen som dataprosessering, datalagring og programvaretjenester på tjenere i eksterne tjenerparker tilknyttet internett. har kunnskap om vern mot dataangrep mot et industrielt datanettverk Har kunnskap om automatisk styrte kjøretøy (Automated guided vehicles – AGV) har kunnskap om samhandling mellom maskiner, logistikksystemer, sentraliserte og distribuerte styresystemer og deres grensesnitt mot andre systemer har kunnskap om dynamiske systemer og materialhåndtering i automatiserte anlegg med tanke på fleksibilitet og rask omstilling har kunnskap om visionsystemer, gripere, kringutstyr og andre komponenter som brukes i moderne industrielle sammenhenger har kunnskap om digitale tvillinger som verktøy for monitorering, feilsøking, prediktering og simulering av omstillinger i produksjonen",
        "skills": "Ferdigheter Studenten kan reflektere over virkemåten til og anvendelse av aktuelle sporingsteknologier som RFID (Radio-frequency identification, radiofrekvensidentifikasjon) kan kartlegge aktuelle teknologiprinsipper for datalagring, lokalt og over nettverk kan kartlegge prinsippene for aktuell programvare som støtter opp om flere av en bedrifts virksomhetsområder, som produksjon, lager, salg, innkjøp og økonomi (ERP system - Enterprise Resource Planning) kan finne og henvise til prinsippene for tjenester i nettskyen slik som dataprosessering, datalagring og programvaretjenester. kan gjøre rede for vern mot dataangrep mot et industrielt datanettverk kan reflektere over fleksible maskinsystemer i fysisk interaksjon med mennesker i felles arbeidsområder kan gjøre rede for systemer for automatisk styrte kjøretøy (Automated guided vehicles – AGV) kan gjøre rede for menneske og maskin (robot) i fysisk interaksjon i felles arbeidsområder kan gjøre rede for planlegging av Agil produksjon med henblikk på resursoptimalisering og lønnsomhet kan gjøre rede for digitale tvillinger som verktøy for monitorering, feilsøking, prediktering og simulering av omstillinger i produksjonen kan gjøre rede for ulike aktuelle prosesser for automatiserte produksjonssystemer og additiv produksjon",
        "competence": "Generell kompetanse Studenten kan planlegge, prosjektere, dokumentere, implementere og drifte produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som gjelder innenfor moderne industrielle sammenhenger kan drifte et agilt produksjonsteknisk system for å optimalisere ressursbruk og lønnsomhet basert på helhetsperspektiv og etiske vurderinger kan utveksle synspunkter og problemstillinger om industriell digitalisering med andre som har bakgrunn innenfor fagfeltet og delta i diskusjoner om utvikling av god praksis"
      }
    },
    {
      "id": "01TE01C",
      "title": "Reguleringstekniske systemer",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE01C/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om reguleringssystemer benyttet i automatiserte anlegg har kunnskap om målemetoder, analyseverktøy og teknisk utstyr som anvendes på automatiserte anlegg har kunnskap om kalibrering og justering av instrumenter innen reguleringstekniske styringssystemer har kunnskap om matematiske modeller ut fra sprangresponser og fysiske målinger har kunnskap om at reguleringssystemer integreres i bedriftens totale SCADA (databehandlingssystemer) har kunnskap om videreutvikling og design av reguleringssystemer innen automasjonsfaget har kunnskap om EUs regelverk for CE merking gjennom Norges EØS avtale kan vurdere eget arbeid i forhold til gjeldende myndighetskrav på automatiserte anlegg som forskrifter, normer og internasjonale krav har kunnskap om bransjen innen reguleringstekniske systemer kan oppdatere sin kunnskap om reguleringstekniske systemer har innsikt i egne utviklingsmuligheter innen fagfeltet reguleringstekniske systemer",
        "skills": "Ferdigheter Studenten kan gjøre rede for sine valg med hensyn til teknisk kvalitet og integrering i et større system i et automasjonsanlegg kan gjøre rede for valg av digitale verktøy og metoder for planlegging og gjennomføring av prosjekt aktiviteter i et automatisert anlegg kan gjøre rede for sine faglige valg ved automasjonsanleggets vedlikeholdssystem kan reflektere over simulering og analyse av prosesser og vurdere resultatene for kontroll og optimalisering av reguleringstekniske egenskaper kan reflektere over implementering og analyse av funksjonaliteten av ny teori og vurdere resultatene for kontroll og optimalisering av reguleringstekniske funksjoner kan finne og henvise til informasjon og fagstoff innen fagområdet og vurdere relevansen for et arbeidsprosjekt kan kartlegge en situasjon i et automatisert anlegg relatert til reguleringstekniske systemer og identifisere behov for teoretiske og praktiske problemstillinger kan kartlegge funksjonsfeil i reguleringstekniske systemer ved feilsøking og behov for iverksetting av tiltak",
        "competence": "Generell kompetanse Studenten kan planlegge, gjennomføre og drifte reguleringstekniske systemer på automatiserte anlegg som deltaker eller leder i gruppe og i tråd med etiske krav og retningslinjer og myndighetskrav for sikkerhet, kvalitet, økonomi og teknikk kan planlegge og gjennomføre arbeidsoppgaver i henhold til digital kommunikasjon som er i tråd med de etiske forutsetningene, juridiske retningslinjer for personvern og økonomiske krav innenfor gjeldende faglige normer kan planlegge og gjennomføre arbeid på automatiserte anlegg ved å utøve tverrfaglig lederskap og ta ansvar under idriftsettelse på automatiserte anlegg innenfor rammene av gjeldende myndighetskrav, sikkerhet, kvalitet, økonomi og teknikk kan utføre arbeidet etter leverandørers og spesialisters behov og krav kan bygge relasjoner med fagfeller og på tvers av fag, samt med eksterne målgrupper som leverandører og spesialister for erfaringsutveksling og kompetansebygging og for å inngå formelle arbeidsavtaler kan utveksle synspunkter med andre med bakgrunn innenfor automatiseringsbransjen ved å integrere reguleringssystemer i bedriftens totale SCADA (databehandlingssystemer) og kan drøfte løsninger for effektivt vedlikehold og optimalisering av produksjonsprosesser og miljøhensyn kan bidra til organisasjonsutvikling ved bruk av avviksmeldinger ved eventuelle hendelser og bruke rapporteringen i kontinuerlig forbedring"
      }
    },
    {
      "id": "01TE00H EITKELFH24",
      "title": "Elektroniske kommunikasjonssystemer (EKOM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE00H-EITKELFH24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om oppbygging og virkemåte for analoge og digitale elektroniske kommunikasjonsnett (ekomnett, brannalarm, innbrudd, overfall, fellesantenne, lyd- og bildedistribusjon, styringssystemer, etc.) kan vurdere eget arbeid i henhold til ekomloven, relevante forskrifter og normer kan vurdere alle aspekter ved installasjon i forhold til gjeldende normer og krav for sikkerhet og kvalitet har kunnskap om EMC og EMI i ekomnett har kunnskap om transmisjonslinjer, infrastruktur og teknologi i ekomnett har kunnskap om risikovurdering, planlegging og prosjektering av ekomnett kjenner til ekoms utvikling og plass i samfunnet ha kunnskap om behov for og krav til reservekraft",
        "skills": "Ferdigheter Studenten kan gjøre rede for sine valg av materiell og utstyr som installeres eller vedlikeholdes ut ifra teknisk dokumentasjon og ta hensyn til støypåvirkning og EMC i grensesnitt mot andre nett og brukerutstyr kan bruke og gjøre rede for valg av programvare og verktøy for beregning, planlegging, kvalitetskontroll og dokumentasjon av ekomnett kan gjøre rede for sine valg i prosjektering av ekomnett kan bruke og gjøre rede for bruk av test- og måleinstrumenter og kan vurdere resultatet av målinger, tester og analyser kan reflektere over egen faglig utøvelse ved å måle, teste og analysere elektroniske kommunikasjonssystemer, tolke resultater og justere under veiledning",
        "competence": "Generell kompetanse Studenten kan planlegge, prosjektere og velge riktig materiell for å installere, drifte og vedlikeholde ekomnett alene og som deltaker i gruppe, i tråd med etiske krav og gjeldende regelverk kan planlegge og dokumentere etter kundens spesifikasjoner, leverandørers og spesialisters behov og krav kan bygge relasjoner med fagfeller innen ekom og på tvers av fag, samt eksterne målgrupper, for erfaringsutveksling og drøfting av løsninger kan utveksle kunnskap og erfaring med andre med bakgrunn innen ekom og delta i diskusjoner om utvikling av nye løsninger, effektivt vedlikehold og god praksis kan bidra til å utvikle en sunn bedriftskultur basert på de verdier som samfunnet ønsker og som vil gi bedriften et godt omdømme kan utøve faglig ledelse"
      }
    },
    {
      "id": "01TX00A",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om realfag som redskap innen sitt fagområde. har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes kan utføre beregninger, overslag og problemløsning relevant for dimensjoneringer og andre problemstillinger innen studieretningen kan vurdere eget arbeid i henhold til matematiske og fysiske lover kan utvide sine kunnskaper og har innsikt i egne utviklingsmuligheter innen realfag. kjenner til matematikkens og fysikkens egenart og plass i samfunnet",
        "skills": "Ferdigheter Studenten: kan gjøre rede for valg av regnemetode som anvendes for å løse faglige problemer kan gjøre rede for valg av digitale verktøy som anvendes til problemløsning innen realfaglige tema kan anvende digitale hjelpemidler til å løse matematiske problemer kan vurdere resultater av beregninger, samt reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til relevant informasjon og fagstoff i formelsamlinger, tabeller og fagbøker kan kartlegge en situasjon og identifisere realfaglige problemstillinger har kjennskap til og kan anvende grunnleggende fysiske lover og fysikkens metodikk kan tolke og anvende modeller som benyttes innen matematikk og fysikk",
        "competence": "Generell kompetanse Studenten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger har innsikt i rekkevidde og begrensninger for de metoder som anvendes kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om grunnleggende kommunikasjonsteori kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde har kunnskap om sentrale retoriske begreper og virkemidler har kunnskap om kildebruk og referanseteknikk etter standard for høyere utdanning kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter har kjennskap til hvordan man organiserer og produserer tekst har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne har kunnskap om språket som verktøy for god kommunikasjon og kjenner til norsk og engelsk fagterminologi innen sitt fagområde har kunnskap om grammatikk, sjangerforståelse samt språklige, stilistiske og grafiske virkemidler i tekst.",
        "skills": "Ferdigheter Kandidaten: kan reflektere over møter mellom forskjellige arbeidslivskulturer kan bruke relevante begreper for å analysere egen og andres tekst kan reflektere over og revidere tekster kan reflektere over hvordan retorikk benyttes kan bygge opp saklig argumentasjon og bruke retoriske virkemiddel kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig kan reflektere over egen kommunikasjon i profesjonell sammenheng kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og tekstbinding kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse Kandidaten: kan kommunisere hensiktsmessig for å bidra til en inkluderende og bærekraftig organisasjonskultur kan tilpasse språk og argumentasjon etter mål og mottaker kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting behersker relevante kommunikasjonsverktøy kan kommunisere gjennom relevante tekster og kanaler kan samarbeide om tekstproduksjon kan utvise etikk og gode holdninger i arbeidslivet kan reflektere over ulike verdier og tenkemåter i samfunnet"
      }
    },
    {
      "id": "01TX00C",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak har kunnskap om lønnskostnader har kunnskaper om mål, tiltak og handlingsplaner kjenner til emnets aktuelle lover og avtaler har erfaringsbasert kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer.",
        "skills": "Ferdigheter Kandidaten: kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler kan vurdere bedriftens betalingsevne og kapitalbehov kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler kan foreta en helhetlig prisvurdering og utarbeide kalkyler kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel kan identifisere, analysere og utvikle medarbeidernes kompetanse kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse Kandidaten kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid kan kommunisere internt og eksternt og benytte digitale verktøy til dette. kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TE00G EITKELFH24",
      "title": "Elektriske systemer",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE00G-EITKELFH24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om grunnleggende elektriske lover og formler og forstår virkemåte og oppbygging av elektriske kretselementer og systemer har kunnskap om DC-kretser og AC-kretser som inneholder resistanser, kapasitanser og induktanser, strømkilder og spenningskilder har kunnskap om aktuelle matematiske modeller, beregningsmetoder og nettverksteoremer for ulike elektriske kretselementer har kunnskap om måleteknikk for elektriske systemer og bruk av relevant måleverktøy har kunnskap om krav til framstilling og oppdatering av dokumentasjon innen fagområdet elektro, samt kan forstå dokumentasjon fra andre tekniske fagområder kan vurdere om dokumentasjon er i henhold til gjeldende normer, bransjestandarder og krav til kvalitet for arbeid med elektriske systemer",
        "skills": "Ferdigheter Studenten kan gjøre rede for strømmer, spenninger og effekter i sammensatte parallelle og seriekoblede elektriske DC-kretser og AC-kretser som inneholder resistanser, kapasitanser og induktanser, strømkilder og spenningskilder kan gjøre rede for valg av simuleringsverktøy for beregning av strømmer og spenninger i elektriske kretser kan gjennom laboratoriearbeid/simulering anvende relevant måleutstyr for måling og feilsøking på elektriske kretselementer og systemer, og vurdere måleresultatene kan reflektere over resultater fra målinger med relevant måleutstyr på elektriske systemer og justere disse under veiledning kan gjøre rede for valg av dokumentasjon innen fagområdet elektro, samt forstå dokumentasjon fra andre tekniske fagområder kan reflektere over egen faglig utøvelse innen elektriske systemer og justere denne under veiledning",
        "competence": "Generell kompetanse Studenten kan planlegge, dokumentere og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter i forbindelse med elektriske systemer alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan utveksle synspunkter med andre med bakgrunn innen elektrofaget og delta i diskusjoner for å vurdere fagspesifikke problemstillinger"
      }
    },
    {
      "id": "01TE00F EITKELFH24",
      "title": "Elektroniske systemer",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE00F-EITKELFH24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om oppbygging og virkemåte til digitale og analoge systemer har kunnskap om ulike metoder for elektronisk kommunikasjon og overføring av signaler mellom enheter har kunnskap om kvalitetsvurdering av kommunikasjonsløsninger og dimensjonering av analoge og digitale systemer har kunnskap om begreper og definisjoner innen datanettverk og nettverksstrukturer har kunnskap om mikrokontrollerkretser og bruken av disse har kunnskap om ESD og måleteknikk for elektroniske systemer og bruk av relevant måleverktøy",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av komponenter og utstyr til digitale og analoge systemer fra datablader og teknisk dokumentasjon og ta hensyn til EMC i forbindelse med støypåvirkning og temperaturendringer kan gjøre rede for valg av simuleringsverktøy til elektroniske systemer for test og verifisering av virkemåte kan gjennom laboratoriearbeid/simulering anvende relevant måleutstyr for måling og feilsøking på elektroniske systemer, og vurdere måleresultatene kan reflektere over resultater fra målinger med relevant måleutstyr på elektroniske systemer og justere disse under veiledning kan gjøre rede for valg av elektroniske tegneverktøy til framstilling- og systematisering av dokumentasjon kan reflektere over egen faglig utøvelse innen elektroniske systemer og justere denne under veiledning",
        "competence": "Generell kompetanse Studenten kan planlegge, dokumentere og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter i forbindelse med elektriske systemer alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan utveksle synspunkter med andre med bakgrunn innen elektrofaget og delta i diskusjoner for å vurdere fagspesifikke problemstillinger"
      }
    },
    {
      "id": "01TE01A",
      "title": "Styringssystemer",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE01A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om relevante komponenter som brukes i moderne industrielle prosesser. har kunnskap om industrielle styresystemer. har kunnskap om design av brukergrensesnitt for operasjon av industrielle prosesser har kunnskap om programmering av PLS og dokumentasjon av PLS programmer i en industriell sammenheng",
        "skills": "Ferdigheter Studenten kan gjøre rede for relevante komponenter som brukes i moderne industrielle sammenhenger kan gjøre rede for prosjektering av aktuelle styresystemer. kan gjøre rede for kalibrering og justering av instrumenter innen styringssystemer kan gjøre rede for brukergrensesnitt for operasjon av industrielle prosesser. kan reflektere over egen og andres faglige utførelse innen moderne industrielle sammenhenger og implementere endringer basert på erfaring kan finne og henvise til teknisk informasjon og fagstoff for produkter og systemer, samt vurdere relevansen mot en yrkesfaglig problemstilling kan gjøre rede for programmering av PLS og dokumentasjon av PLS programmer i en industriell sammenheng",
        "competence": "Generell kompetanse Studenten kan i samarbeid med andre yrkesgrupper planlegge, prosjektere, dokumentere, implementere og drifte produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som gjelder innenfor moderne industrielle sammenhenger kan bygge relasjoner over egen og andres faglige utførelse innen moderne industrielle sammenhenger kan utveksle synspunkter og henvise til teknisk og innovativ informasjon og fagstoff om moderne industrielle sammenhenger og produksjon for produkt og systemer"
      }
    },
    {
      "id": "01TE01B",
      "title": "Industriell Digitalisering",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE01B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om virkemåte og anvendelse av aktuelle sporingsteknologier som strekkoder, QR koder og RFID (Radio-frequency identification, radiofrekvensidentifikasjon) kan vurdere nytteverdien av innsamlede data, definere KPI-er (nøkkelindikatorer), spesifisere databehov og kilder, vurdere datakvalitet samt utstyr for innsamling av data har kunnskap om prinsippene for aktuell teknologi for datalagring, lokalt og over nettverk har kunnskap om prinsippene for aktuell programvare som støtter opp om flere av en bedrifts virksomhetsområder, som produksjon, lager, salg, innkjøp og økonomi (ERP system - Enterprise Resource Planning) har kunnskap om prinsippene for tjenester i nettskyen som dataprosessering, datalagring og programvaretjenester på tjenere i eksterne tjenerparker tilknyttet internett. har kunnskap om vern mot dataangrep mot et industrielt datanettverk Har kunnskap om automatisk styrte kjøretøy (Automated guided vehicles – AGV) har kunnskap om samhandling mellom maskiner, logistikksystemer, sentraliserte og distribuerte styresystemer og deres grensesnitt mot andre systemer har kunnskap om dynamiske systemer og materialhåndtering i automatiserte anlegg med tanke på fleksibilitet og rask omstilling har kunnskap om visionsystemer, gripere, kringutstyr og andre komponenter som brukes i moderne industrielle sammenhenger har kunnskap om digitale tvillinger som verktøy for monitorering, feilsøking, prediktering og simulering av omstillinger i produksjonen",
        "skills": "Ferdigheter Studenten kan reflektere over virkemåten til og anvendelse av aktuelle sporingsteknologier som RFID (Radio-frequency identification, radiofrekvensidentifikasjon) kan kartlegge aktuelle teknologiprinsipper for datalagring, lokalt og over nettverk kan kartlegge prinsippene for aktuell programvare som støtter opp om flere av en bedrifts virksomhetsområder, som produksjon, lager, salg, innkjøp og økonomi (ERP system - Enterprise Resource Planning) kan finne og henvise til prinsippene for tjenester i nettskyen slik som dataprosessering, datalagring og programvaretjenester. kan gjøre rede for vern mot dataangrep mot et industrielt datanettverk kan reflektere over fleksible maskinsystemer i fysisk interaksjon med mennesker i felles arbeidsområder kan gjøre rede for systemer for automatisk styrte kjøretøy (Automated guided vehicles – AGV) kan gjøre rede for menneske og maskin (robot) i fysisk interaksjon i felles arbeidsområder kan gjøre rede for planlegging av Agil produksjon med henblikk på resursoptimalisering og lønnsomhet kan gjøre rede for digitale tvillinger som verktøy for monitorering, feilsøking, prediktering og simulering av omstillinger i produksjonen kan gjøre rede for ulike aktuelle prosesser for automatiserte produksjonssystemer og additiv produksjon",
        "competence": "Generell kompetanse Studenten kan planlegge, prosjektere, dokumentere, implementere og drifte produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som gjelder innenfor moderne industrielle sammenhenger kan drifte et agilt produksjonsteknisk system for å optimalisere ressursbruk og lønnsomhet basert på helhetsperspektiv og etiske vurderinger kan utveksle synspunkter og problemstillinger om industriell digitalisering med andre som har bakgrunn innenfor fagfeltet og delta i diskusjoner om utvikling av god praksis"
      }
    },
    {
      "id": "01TE01C",
      "title": "Reguleringstekniske systemer",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE01C/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om reguleringssystemer benyttet i automatiserte anlegg har kunnskap om målemetoder, analyseverktøy og teknisk utstyr som anvendes på automatiserte anlegg har kunnskap om kalibrering og justering av instrumenter innen reguleringstekniske styringssystemer har kunnskap om matematiske modeller ut fra sprangresponser og fysiske målinger har kunnskap om at reguleringssystemer integreres i bedriftens totale SCADA (databehandlingssystemer) har kunnskap om videreutvikling og design av reguleringssystemer innen automasjonsfaget har kunnskap om EUs regelverk for CE merking gjennom Norges EØS avtale kan vurdere eget arbeid i forhold til gjeldende myndighetskrav på automatiserte anlegg som forskrifter, normer og internasjonale krav har kunnskap om bransjen innen reguleringstekniske systemer kan oppdatere sin kunnskap om reguleringstekniske systemer har innsikt i egne utviklingsmuligheter innen fagfeltet reguleringstekniske systemer",
        "skills": "Ferdigheter Studenten kan gjøre rede for sine valg med hensyn til teknisk kvalitet og integrering i et større system i et automasjonsanlegg kan gjøre rede for valg av digitale verktøy og metoder for planlegging og gjennomføring av prosjekt aktiviteter i et automatisert anlegg kan gjøre rede for sine faglige valg ved automasjonsanleggets vedlikeholdssystem kan reflektere over simulering og analyse av prosesser og vurdere resultatene for kontroll og optimalisering av reguleringstekniske egenskaper kan reflektere over implementering og analyse av funksjonaliteten av ny teori og vurdere resultatene for kontroll og optimalisering av reguleringstekniske funksjoner kan finne og henvise til informasjon og fagstoff innen fagområdet og vurdere relevansen for et arbeidsprosjekt kan kartlegge en situasjon i et automatisert anlegg relatert til reguleringstekniske systemer og identifisere behov for teoretiske og praktiske problemstillinger kan kartlegge funksjonsfeil i reguleringstekniske systemer ved feilsøking og behov for iverksetting av tiltak",
        "competence": "Generell kompetanse Studenten kan planlegge, gjennomføre og drifte reguleringstekniske systemer på automatiserte anlegg som deltaker eller leder i gruppe og i tråd med etiske krav og retningslinjer og myndighetskrav for sikkerhet, kvalitet, økonomi og teknikk kan planlegge og gjennomføre arbeidsoppgaver i henhold til digital kommunikasjon som er i tråd med de etiske forutsetningene, juridiske retningslinjer for personvern og økonomiske krav innenfor gjeldende faglige normer kan planlegge og gjennomføre arbeid på automatiserte anlegg ved å utøve tverrfaglig lederskap og ta ansvar under idriftsettelse på automatiserte anlegg innenfor rammene av gjeldende myndighetskrav, sikkerhet, kvalitet, økonomi og teknikk kan utføre arbeidet etter leverandørers og spesialisters behov og krav kan bygge relasjoner med fagfeller og på tvers av fag, samt med eksterne målgrupper som leverandører og spesialister for erfaringsutveksling og kompetansebygging og for å inngå formelle arbeidsavtaler kan utveksle synspunkter med andre med bakgrunn innenfor automatiseringsbransjen ved å integrere reguleringssystemer i bedriftens totale SCADA (databehandlingssystemer) og kan drøfte løsninger for effektivt vedlikehold og optimalisering av produksjonsprosesser og miljøhensyn kan bidra til organisasjonsutvikling ved bruk av avviksmeldinger ved eventuelle hendelser og bruke rapporteringen i kontinuerlig forbedring"
      }
    },
    {
      "id": "01TE00H EITKELFH24",
      "title": "Elektroniske kommunikasjonssystemer (EKOM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TE00H-EITKELFH24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om oppbygging og virkemåte for analoge og digitale elektroniske kommunikasjonsnett (ekomnett, brannalarm, innbrudd, overfall, fellesantenne, lyd- og bildedistribusjon, styringssystemer, etc.) kan vurdere eget arbeid i henhold til ekomloven, relevante forskrifter og normer kan vurdere alle aspekter ved installasjon i forhold til gjeldende normer og krav for sikkerhet og kvalitet har kunnskap om EMC og EMI i ekomnett har kunnskap om transmisjonslinjer, infrastruktur og teknologi i ekomnett har kunnskap om risikovurdering, planlegging og prosjektering av ekomnett kjenner til ekoms utvikling og plass i samfunnet ha kunnskap om behov for og krav til reservekraft",
        "skills": "Ferdigheter Studenten kan gjøre rede for sine valg av materiell og utstyr som installeres eller vedlikeholdes ut ifra teknisk dokumentasjon og ta hensyn til støypåvirkning og EMC i grensesnitt mot andre nett og brukerutstyr kan bruke og gjøre rede for valg av programvare og verktøy for beregning, planlegging, kvalitetskontroll og dokumentasjon av ekomnett kan gjøre rede for sine valg i prosjektering av ekomnett kan bruke og gjøre rede for bruk av test- og måleinstrumenter og kan vurdere resultatet av målinger, tester og analyser kan reflektere over egen faglig utøvelse ved å måle, teste og analysere elektroniske kommunikasjonssystemer, tolke resultater og justere under veiledning",
        "competence": "Generell kompetanse Studenten kan planlegge, prosjektere og velge riktig materiell for å installere, drifte og vedlikeholde ekomnett alene og som deltaker i gruppe, i tråd med etiske krav og gjeldende regelverk kan planlegge og dokumentere etter kundens spesifikasjoner, leverandørers og spesialisters behov og krav kan bygge relasjoner med fagfeller innen ekom og på tvers av fag, samt eksterne målgrupper, for erfaringsutveksling og drøfting av løsninger kan utveksle kunnskap og erfaring med andre med bakgrunn innen ekom og delta i diskusjoner om utvikling av nye løsninger, effektivt vedlikehold og god praksis kan bidra til å utvikle en sunn bedriftskultur basert på de verdier som samfunnet ønsker og som vil gi bedriften et godt omdømme kan utøve faglig ledelse"
      }
    },
    {
      "id": "01TX00H",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om hvordan man skriver en prosjektrapport har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt har kunnskap om sammenhengen mellom teori og praksis kan vurdere eget prosjekt i forhold til gjeldende normer og krav kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av tema for hovedprosjekt kan identifisere, kartlegge og vurdere en faglig problemstilling kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat kan skrive en prosjektrapport kan drøfte sammenhengen mellom teori og praksis kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    }
  ]
}