{
  "study_programs": [
    {
      "id": "Barn og unge med behov for særskilt tilrettelegging - 60",
      "title": "Barn og unge med behov for særskilt tilrettelegging",
      "description": "Barn og unge med behov for særskilt tilrettelegging er videreutdanningen for deg som vil gi tidlig og riktig støtte når det trengs. Du bruker relasjonskompetanse, observasjon og målrettede tiltak for å fremme mestring, trygghet og livsmestring i barnehage, skole og SFO.",
      "study_location": "Fredrikstad (Samlingsbasert 2 år) | Kjeller (Samlingsbasert 2 år) | Kongsberg (Samlingsbasert 2 år)",
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Barn og unges behov varierer – fra midlertidige utfordringer til mer varige funksjonsnedsettelser. Tverrfaglig samhandling, god kommunikasjon med foresatte og et oppdatert blikk på lovverk og rettigheter er avgjørende for at tiltakene faktisk virker. Utdanningen gir deg et solid faglig grunnlag for tidlig innsats og inkluderende praksis, og styrker rollen din i teamet rundt barnet – fra kartlegging og planlegging til gjennomføring og evaluering. | For dette studiet er det krav om | politiattest | .\nLars (34) jobber i Ørebekk barnehage og har tatt studiet Barn med særskilte behov (tidligere navn på studiet). Hør hva han han og Faglærer Inger Cecilie forteller om studiet.",
      "what_learn": "Du får en helhetlig forståelse av hvordan etikk, profesjonsrolle, pedagogikk, didaktikk og livsmestring henger sammen i arbeid med barn og unge som trenger særskilt tilrettelegging. Du lærer å identifisere behov gjennom systematiske observasjoner, tolke signaler og bruke relevant dokumentasjon for å underbygge tiltak. Studiet vektlegger forebygging, inkludering, traumebevisst tilnærming og samarbeid med foresatte og fagmiljøer. Du blir trygg på rammer og rettigheter i gjeldende regelverk, og trener på å planlegge, gjennomføre og vurdere tiltak som støtter barnets utvikling og deltakelse i fellesskapet. Praksis og fordypningsoppgave knytter teori og metode tett til arbeidsplassen din.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger Dette oppsettet gjelder første klasse / nye studenter som starter studieåret 2025–2026 ved studiested Fredrikstad. Studiet gjennomføres som nettbasert deltidsstudium med fysiske samlinger i Fredrikstad. Samlingene holdes vanligvis flere ganger per semester, og varer to til tre dager. Mellom samlingene har du fast nettundervisning én kveld i uken, kombinert med fleksibelt læringsmateriell og oppgaver i Teams. Undervisningen veksler mellom forelesninger, ferdighetstrening, refleksjon og gruppearbeid . Samlingene brukes aktivt til praktiske øvelser, diskusjoner og veiledning fra faglærere. Praksis er en obligatorisk del av studiet. Du følger turnus på praksisstedet, får veiledning underveis. Obligatorisk oppmøte Obligatorisk oppmøte på samlinger kan forekomme. Praksis har egne regler for oppmøte minimum 90% tilstedeværelse – se studieplanen for detaljer. Manglende oppmøte kan føre til at du ikke får fullført emnet. Politiattest Dette studiet krever gyldig politiattest før studiestart. Søk om politiattest når du har akseptert studieplassen. Les vår veiledning til hvordan du søker politiattest før du går videre til politiets nettsider for å sende søknaden.",
      "police_certificate": "Sjekk opptakskrav",
      "career_opportunities": "Kompetansen gjør deg til en nøkkelperson i arbeidet med tidlig innsats og tilrettelegging. Du kan ta ansvar for kartlegging i tråd med regelverk, planlegge og gjennomføre målrettede tiltak, koordinere innsats med pedagogisk ansvarlig og bidra i dialogen med foresatte og eksterne fagmiljøer. Utdanningen styrker rollen din i barnehage, skole og SFO – og er relevant i fritidsklubber, habiliteringstilbud og andre tjenester for barn og unge. Med økt faglig tyngde får du bedre grunnlag for å ta mer ansvar i team, veilede kollegaer og bidra til kvalitetsutvikling på egen arbeidsplass.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/barn-og-oppvekst/barn-og-unge-med-behov-saerskilt-tilrettelegging"
    }
  ],
  "courses": [
    {
      "id": "01HO60A EIHOBSF-25",
      "title": "Etikk, kommunikasjon og samhandling",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60A-EIHOBSF-25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: kan gjennom ulike studiemetoder oppdatere sin yrkesfaglige kunnskap har innsikt i regelverk, lover, forskrifter og andre styringsdokumenter, gjeldende for oppvekstsektoren har kunnskap om barns helhetlige utvikling, pedagogikk, didaktiske prosesser, kommunikasjon og samhandling, og andre verktøy som anvendes i arbeidet med barn og unge med behov for særskilt tilrettelegging har etisk bevissthet om egen rolle i relasjon til barn og unge, og forstår egen yrkesrolle i et samfunnsperspektiv",
        "skills": "Ferdigheter Studenten kan finne informasjon og fagstoff som er relevant for yrkesetiske problemstillinger kan bidra med faglig kunnskap inn i dialogen knyttet til ulike problemstillinger på egen arbeidsplass kan ta i bruk ulike pedagogiske og didaktiske verktøy kan kommunisere profesjonelt i samhandling med barn/unge, foresatte og annet fagpersonell",
        "competence": "Generell kompetanse Studenten har forståelse for etiske prinsipper, utfordringer og dilemmaer og kan reflektere over egne, holdninger og verdier Har utviklet relasjonskompetanse, og har forståelse for viktigheten av å skape relasjoner med barn, unge, foresatte, kollegaer og andre faginstanser kan utvikle og tilpasse egen yrkesutøvelse knyttet til pedagogiske metoder og didaktiske verktøy"
      }
    },
    {
      "id": "01HO60B EIHOBSF-25",
      "title": "Livsmestring",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60B-EIHOBSF-25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap og forståelse om viktigheten av at enkeltindividet opplever tilhørighet i et inkluderende leke- og læringsfellesskap har kunnskap om de ulike etiske utfordringer knyttet til identitet har kunnskap om betydningen av livsmestring i et bærekraftsperspektiv",
        "skills": "Ferdigheter Studenten kan vise til observasjoner og igangsette tiltak i samarbeid med kollegaer og fagmiljøer for å sikre et inkluderende leke- og læringsfellesskap kan anerkjenne viktigheten av livsmestring som grunnleggende bidrag inn til barn og unges følelse av egenverd og trivsel kan anvende etiske retningslinjer og verdisyn i arbeidet med barn og unges identitet",
        "competence": "Generell kompetanse Studenten har forståelse for innholdet i begrepene inkludering, livsmestring, identitet, og utenforskap for barn og unge har utviklet en etisk grunnholdning knyttet til livsmestring for barn og unge med fokus på inkludering, identitet og utenforskap har forståelse for hvordan barn og unges medvirkning kan bidra til mestring og inkludering"
      }
    },
    {
      "id": "01HO60C EIHOBSF-25",
      "title": "Tidlig innsats",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60C-EIHOBSF-25/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: har kunnskap om barn og unge med behov for særskilt tilrettelegging har kunnskap om barn og unge i risikosituasjoner har kunnskap om betydningen av tidlig innsats og verdien av dette har kunnskap om lover og rettigheter for barn og unge med behov for særskilt tilrettelegging, og viktigheten av tverretatlig og tverrfaglig samarbeid. har kunnskap om aktuelle observasjonsmetoder, tiltak og tilrettelegginger når det kommer til barn og unge med særskilte behov",
        "skills": "Ferdigheter Studenten kan finne informasjon som er relevant i det daglige arbeidet med barn og unge med behov for særskilt tilrettelegging kan anvende relevant fagkunnskap, lover, forskrifter og styringsdokumenter i arbeidet med barn og unge med behov for særskilt tilrettelegging kan anvende ulike observasjoner og tilrettelegge for barn og unge på en hensiktsmessig måte",
        "competence": "Generell kompetanse Studenten har forståelse for og kan anvende ulike pedagogiske metoder og verktøy i det daglige arbeidet med barn og unge med behov for særskilt tilrettelegging"
      }
    },
    {
      "id": "01HO60D EIHOBSF-25",
      "title": "Praksis",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60D-EIHOBSF-25/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: har kunnskap om betydningen av livsmestring og tidlig innsats, og hvilke betydning dette har i arbeidet med barn og unge med behov for særskilt tilrettelegging har kunnskap om pedagogiske verktøy for observasjon, planlegging og dokumentasjon som kan anvendes i praksis har kunnskap om forskjellige relevante samarbeidspartnere, og hvordan vi kan samarbeide til det beste for barn og unge har innsikt i relevant lovverk og styringsdokumenter knyttet til praksisstedet",
        "skills": "Ferdigheter Studenten kan anvende faglig kunnskap på praktiske problemstillinger som gjelder barn og unge med behov for særskilt tilrettelegging kan anvende relevante pedagogiske verktøy for observasjon, planlegging, og dokumentasjon i praksis kan anvende kunnskap om kommunikasjon og samhandling i møte med ulike individer knyttet til praksisstedet kan finne informasjon og fagstoff som er relevant i arbeidet med barn og unge med behov for særskilt tilrettelegging i praksis",
        "competence": "Generell kompetanse Studenten har forståelse for yrkesetiske prinsipper i arbeidet med barn og unge med behov for særskilt tilrettelegging har utviklet en etisk grunnholdning i arbeid med barn og unge med behov for særskilt tilrettelegging kan skape relasjoner, inkludere og samarbeide med barn og unge, foreldre, kollegaer og andre yrkesgrupper kan bidra inn i ulike arbeidsmetoder for barn og unge gjennom kunnskapsdeling, veiledning og etisk refleksjon i praksis"
      }
    },
    {
      "id": "01HO60E EIHOBSF-25",
      "title": "Fordypningsoppgave",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60E-EIHOBSF-25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: kan oppdatere og anvende sin kunnskap innenfor et selvvalgt fordypningstema har innsikt i lover, forskrifter og planverk som er relevant for fordypningen har kunnskap om betydningen av sitt mandat i egen yrkesutøvelse",
        "skills": "Ferdigheter Studenten kan anvende lover, forskrifter og planverk som er relevant for fordypningsarbeidet kan finne informasjon og fagstoff fra fagfeltet, som er relevant for fordypningsoppgavens problemstilling kan, ut fra valgte problemstilling, bruke fagkunnskaper til det beste for barn og unge med behov for særskilt tilrettelegging kan reflektere rundt og drøfte sammenhengen mellom teori og praksis opp mot selvvalgt problemstilling har forståelse for yrkesetiske prinsipper knyttet til dokumentasjon, personvern og anonymisering i oppgaveskriving",
        "competence": "Generell kompetanse Studenten har utviklet en etisk grunnholdning og har forståelse for yrkesetiske prinsipper i sitt arbeid med barn og unge med behov for særskilt tilrettelegging"
      }
    },
    {
      "id": "01HO60A EIHOBSF-25",
      "title": "Etikk, kommunikasjon og samhandling",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60A-EIHOBSF-25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: kan gjennom ulike studiemetoder oppdatere sin yrkesfaglige kunnskap har innsikt i regelverk, lover, forskrifter og andre styringsdokumenter, gjeldende for oppvekstsektoren har kunnskap om barns helhetlige utvikling, pedagogikk, didaktiske prosesser, kommunikasjon og samhandling, og andre verktøy som anvendes i arbeidet med barn og unge med behov for særskilt tilrettelegging har etisk bevissthet om egen rolle i relasjon til barn og unge, og forstår egen yrkesrolle i et samfunnsperspektiv",
        "skills": "Ferdigheter Studenten kan finne informasjon og fagstoff som er relevant for yrkesetiske problemstillinger kan bidra med faglig kunnskap inn i dialogen knyttet til ulike problemstillinger på egen arbeidsplass kan ta i bruk ulike pedagogiske og didaktiske verktøy kan kommunisere profesjonelt i samhandling med barn/unge, foresatte og annet fagpersonell",
        "competence": "Generell kompetanse Studenten har forståelse for etiske prinsipper, utfordringer og dilemmaer og kan reflektere over egne, holdninger og verdier Har utviklet relasjonskompetanse, og har forståelse for viktigheten av å skape relasjoner med barn, unge, foresatte, kollegaer og andre faginstanser kan utvikle og tilpasse egen yrkesutøvelse knyttet til pedagogiske metoder og didaktiske verktøy"
      }
    },
    {
      "id": "01HO60B EIHOBSF-25",
      "title": "Livsmestring",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60B-EIHOBSF-25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap og forståelse om viktigheten av at enkeltindividet opplever tilhørighet i et inkluderende leke- og læringsfellesskap har kunnskap om de ulike etiske utfordringer knyttet til identitet har kunnskap om betydningen av livsmestring i et bærekraftsperspektiv",
        "skills": "Ferdigheter Studenten kan vise til observasjoner og igangsette tiltak i samarbeid med kollegaer og fagmiljøer for å sikre et inkluderende leke- og læringsfellesskap kan anerkjenne viktigheten av livsmestring som grunnleggende bidrag inn til barn og unges følelse av egenverd og trivsel kan anvende etiske retningslinjer og verdisyn i arbeidet med barn og unges identitet",
        "competence": "Generell kompetanse Studenten har forståelse for innholdet i begrepene inkludering, livsmestring, identitet, og utenforskap for barn og unge har utviklet en etisk grunnholdning knyttet til livsmestring for barn og unge med fokus på inkludering, identitet og utenforskap har forståelse for hvordan barn og unges medvirkning kan bidra til mestring og inkludering"
      }
    },
    {
      "id": "01HO60C EIHOBSF-25",
      "title": "Tidlig innsats",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60C-EIHOBSF-25/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: har kunnskap om barn og unge med behov for særskilt tilrettelegging har kunnskap om barn og unge i risikosituasjoner har kunnskap om betydningen av tidlig innsats og verdien av dette har kunnskap om lover og rettigheter for barn og unge med behov for særskilt tilrettelegging, og viktigheten av tverretatlig og tverrfaglig samarbeid. har kunnskap om aktuelle observasjonsmetoder, tiltak og tilrettelegginger når det kommer til barn og unge med særskilte behov",
        "skills": "Ferdigheter Studenten kan finne informasjon som er relevant i det daglige arbeidet med barn og unge med behov for særskilt tilrettelegging kan anvende relevant fagkunnskap, lover, forskrifter og styringsdokumenter i arbeidet med barn og unge med behov for særskilt tilrettelegging kan anvende ulike observasjoner og tilrettelegge for barn og unge på en hensiktsmessig måte",
        "competence": "Generell kompetanse Studenten har forståelse for og kan anvende ulike pedagogiske metoder og verktøy i det daglige arbeidet med barn og unge med behov for særskilt tilrettelegging"
      }
    },
    {
      "id": "01HO60D EIHOBSF-25",
      "title": "Praksis",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60D-EIHOBSF-25/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: har kunnskap om betydningen av livsmestring og tidlig innsats, og hvilke betydning dette har i arbeidet med barn og unge med behov for særskilt tilrettelegging har kunnskap om pedagogiske verktøy for observasjon, planlegging og dokumentasjon som kan anvendes i praksis har kunnskap om forskjellige relevante samarbeidspartnere, og hvordan vi kan samarbeide til det beste for barn og unge har innsikt i relevant lovverk og styringsdokumenter knyttet til praksisstedet",
        "skills": "Ferdigheter Studenten kan anvende faglig kunnskap på praktiske problemstillinger som gjelder barn og unge med behov for særskilt tilrettelegging kan anvende relevante pedagogiske verktøy for observasjon, planlegging, og dokumentasjon i praksis kan anvende kunnskap om kommunikasjon og samhandling i møte med ulike individer knyttet til praksisstedet kan finne informasjon og fagstoff som er relevant i arbeidet med barn og unge med behov for særskilt tilrettelegging i praksis",
        "competence": "Generell kompetanse Studenten har forståelse for yrkesetiske prinsipper i arbeidet med barn og unge med behov for særskilt tilrettelegging har utviklet en etisk grunnholdning i arbeid med barn og unge med behov for særskilt tilrettelegging kan skape relasjoner, inkludere og samarbeide med barn og unge, foreldre, kollegaer og andre yrkesgrupper kan bidra inn i ulike arbeidsmetoder for barn og unge gjennom kunnskapsdeling, veiledning og etisk refleksjon i praksis"
      }
    },
    {
      "id": "01HO60E EIHOBSF-25",
      "title": "Fordypningsoppgave",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60E-EIHOBSF-25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: kan oppdatere og anvende sin kunnskap innenfor et selvvalgt fordypningstema har innsikt i lover, forskrifter og planverk som er relevant for fordypningen har kunnskap om betydningen av sitt mandat i egen yrkesutøvelse",
        "skills": "Ferdigheter Studenten kan anvende lover, forskrifter og planverk som er relevant for fordypningsarbeidet kan finne informasjon og fagstoff fra fagfeltet, som er relevant for fordypningsoppgavens problemstilling kan, ut fra valgte problemstilling, bruke fagkunnskaper til det beste for barn og unge med behov for særskilt tilrettelegging kan reflektere rundt og drøfte sammenhengen mellom teori og praksis opp mot selvvalgt problemstilling har forståelse for yrkesetiske prinsipper knyttet til dokumentasjon, personvern og anonymisering i oppgaveskriving",
        "competence": "Generell kompetanse Studenten har utviklet en etisk grunnholdning og har forståelse for yrkesetiske prinsipper i sitt arbeid med barn og unge med behov for særskilt tilrettelegging"
      }
    },
    {
      "id": "01HO60A EIHOBSF-25",
      "title": "Etikk, kommunikasjon og samhandling",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60A-EIHOBSF-25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: kan gjennom ulike studiemetoder oppdatere sin yrkesfaglige kunnskap har innsikt i regelverk, lover, forskrifter og andre styringsdokumenter, gjeldende for oppvekstsektoren har kunnskap om barns helhetlige utvikling, pedagogikk, didaktiske prosesser, kommunikasjon og samhandling, og andre verktøy som anvendes i arbeidet med barn og unge med behov for særskilt tilrettelegging har etisk bevissthet om egen rolle i relasjon til barn og unge, og forstår egen yrkesrolle i et samfunnsperspektiv",
        "skills": "Ferdigheter Studenten kan finne informasjon og fagstoff som er relevant for yrkesetiske problemstillinger kan bidra med faglig kunnskap inn i dialogen knyttet til ulike problemstillinger på egen arbeidsplass kan ta i bruk ulike pedagogiske og didaktiske verktøy kan kommunisere profesjonelt i samhandling med barn/unge, foresatte og annet fagpersonell",
        "competence": "Generell kompetanse Studenten har forståelse for etiske prinsipper, utfordringer og dilemmaer og kan reflektere over egne, holdninger og verdier Har utviklet relasjonskompetanse, og har forståelse for viktigheten av å skape relasjoner med barn, unge, foresatte, kollegaer og andre faginstanser kan utvikle og tilpasse egen yrkesutøvelse knyttet til pedagogiske metoder og didaktiske verktøy"
      }
    },
    {
      "id": "01HO60B EIHOBSF-25",
      "title": "Livsmestring",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60B-EIHOBSF-25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap og forståelse om viktigheten av at enkeltindividet opplever tilhørighet i et inkluderende leke- og læringsfellesskap har kunnskap om de ulike etiske utfordringer knyttet til identitet har kunnskap om betydningen av livsmestring i et bærekraftsperspektiv",
        "skills": "Ferdigheter Studenten kan vise til observasjoner og igangsette tiltak i samarbeid med kollegaer og fagmiljøer for å sikre et inkluderende leke- og læringsfellesskap kan anerkjenne viktigheten av livsmestring som grunnleggende bidrag inn til barn og unges følelse av egenverd og trivsel kan anvende etiske retningslinjer og verdisyn i arbeidet med barn og unges identitet",
        "competence": "Generell kompetanse Studenten har forståelse for innholdet i begrepene inkludering, livsmestring, identitet, og utenforskap for barn og unge har utviklet en etisk grunnholdning knyttet til livsmestring for barn og unge med fokus på inkludering, identitet og utenforskap har forståelse for hvordan barn og unges medvirkning kan bidra til mestring og inkludering"
      }
    },
    {
      "id": "01HO60C EIHOBSF-25",
      "title": "Tidlig innsats",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60C-EIHOBSF-25/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: har kunnskap om barn og unge med behov for særskilt tilrettelegging har kunnskap om barn og unge i risikosituasjoner har kunnskap om betydningen av tidlig innsats og verdien av dette har kunnskap om lover og rettigheter for barn og unge med behov for særskilt tilrettelegging, og viktigheten av tverretatlig og tverrfaglig samarbeid. har kunnskap om aktuelle observasjonsmetoder, tiltak og tilrettelegginger når det kommer til barn og unge med særskilte behov",
        "skills": "Ferdigheter Studenten kan finne informasjon som er relevant i det daglige arbeidet med barn og unge med behov for særskilt tilrettelegging kan anvende relevant fagkunnskap, lover, forskrifter og styringsdokumenter i arbeidet med barn og unge med behov for særskilt tilrettelegging kan anvende ulike observasjoner og tilrettelegge for barn og unge på en hensiktsmessig måte",
        "competence": "Generell kompetanse Studenten har forståelse for og kan anvende ulike pedagogiske metoder og verktøy i det daglige arbeidet med barn og unge med behov for særskilt tilrettelegging"
      }
    },
    {
      "id": "01HO60D EIHOBSF-25",
      "title": "Praksis",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60D-EIHOBSF-25/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: har kunnskap om betydningen av livsmestring og tidlig innsats, og hvilke betydning dette har i arbeidet med barn og unge med behov for særskilt tilrettelegging har kunnskap om pedagogiske verktøy for observasjon, planlegging og dokumentasjon som kan anvendes i praksis har kunnskap om forskjellige relevante samarbeidspartnere, og hvordan vi kan samarbeide til det beste for barn og unge har innsikt i relevant lovverk og styringsdokumenter knyttet til praksisstedet",
        "skills": "Ferdigheter Studenten kan anvende faglig kunnskap på praktiske problemstillinger som gjelder barn og unge med behov for særskilt tilrettelegging kan anvende relevante pedagogiske verktøy for observasjon, planlegging, og dokumentasjon i praksis kan anvende kunnskap om kommunikasjon og samhandling i møte med ulike individer knyttet til praksisstedet kan finne informasjon og fagstoff som er relevant i arbeidet med barn og unge med behov for særskilt tilrettelegging i praksis",
        "competence": "Generell kompetanse Studenten har forståelse for yrkesetiske prinsipper i arbeidet med barn og unge med behov for særskilt tilrettelegging har utviklet en etisk grunnholdning i arbeid med barn og unge med behov for særskilt tilrettelegging kan skape relasjoner, inkludere og samarbeide med barn og unge, foreldre, kollegaer og andre yrkesgrupper kan bidra inn i ulike arbeidsmetoder for barn og unge gjennom kunnskapsdeling, veiledning og etisk refleksjon i praksis"
      }
    },
    {
      "id": "01HO60E EIHOBSF-25",
      "title": "Fordypningsoppgave",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO60E-EIHOBSF-25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: kan oppdatere og anvende sin kunnskap innenfor et selvvalgt fordypningstema har innsikt i lover, forskrifter og planverk som er relevant for fordypningen har kunnskap om betydningen av sitt mandat i egen yrkesutøvelse",
        "skills": "Ferdigheter Studenten kan anvende lover, forskrifter og planverk som er relevant for fordypningsarbeidet kan finne informasjon og fagstoff fra fagfeltet, som er relevant for fordypningsoppgavens problemstilling kan, ut fra valgte problemstilling, bruke fagkunnskaper til det beste for barn og unge med behov for særskilt tilrettelegging kan reflektere rundt og drøfte sammenhengen mellom teori og praksis opp mot selvvalgt problemstilling har forståelse for yrkesetiske prinsipper knyttet til dokumentasjon, personvern og anonymisering i oppgaveskriving",
        "competence": "Generell kompetanse Studenten har utviklet en etisk grunnholdning og har forståelse for yrkesetiske prinsipper i sitt arbeid med barn og unge med behov for særskilt tilrettelegging"
      }
    }
  ]
}