{
  "study_programs": [
    {
      "id": "Barsel og barnepleie - 60",
      "title": "Barsel og barnepleie",
      "description": "Videreutdanning for deg som vil styrke trygg oppfølging av fødende, nyfødte og familier – fra svangerskap til barseltid og barn 0–18 år. Du lærer å observere, vurdere og veilede på en faglig og etisk bevisst måte, i tett samarbeid med foreldre og tverrfaglige team.",
      "study_location": "Fredrikstad (Samlingsbasert 2 år)",
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Familier møter helsetjenesten tidligere og oftere – med kortere liggetid, mer oppfølging hjemme og økt behov for foreldreveiledning. Det krever fagarbeidere som kan se hele familien, oppdage endringer tidlig og gi trygg støtte når det trengs. | Med denne utdanningen får du oppdatert kompetanse i barsel- og barnepleie, styrket kommunikasjon og samhandling, og et tydeligere klinisk blikk på normalutvikling og avvik. Du bidrar til kvalitet, pasientsikkerhet og god start på livet – på i sykehus og i kommunehelsetjenesten. | For dette studiet er det krav om | politiattest | .",
      "what_learn": "I dette studiet lærer du å møte foreldre, nyfødte og barn med trygghet og faglig presisjon og omsorg. Du får kunnskap om svangerskap, fødsel og barseltid, neonatal oppfølging og prematuritet, samt barns utvikling, helse og vanlige sykdommer. Du lærer også om kommunikasjon, etikk og samhandling, og hvordan du kan kombinere faglig innsikt med veiledning og støtte i praksis.\nUndervisningen kombinerer teori, ferdighetstrening, simulering, praksis og erfaringsbasert læring. Du bruker din egen yrkeserfaring aktivt i oppgaver, refleksjon og samarbeid med andre studenter.\nStudiet består av seks emner på til sammen 60 studiepoeng, inkludert 12 uker praksis og en fordypningsoppgave.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger Dette oppsettet gjelder første klasse / nye studenter som starter studieåret 2025–2026 ved studiested Fredrikstad . Studiet kombinerer nettundervisning med fysiske samlinger . Samlingene holdes vanligvis tre ganger per semester og varer to til fem dager . Mellom samlingene gjennomføres nettundervisning én gang per uke , som regel på kveldstid. Praksisperioden gjennomføres i samarbeid med relevante praksissteder. Fagskolen Viken har ansvar for å skaffe praksisplass, og veiledning gis både av praksisveileder og faglærer. Endelig plan publiseres før oppstart på studentsiden for studiested Fredrikstad . Obligatorisk oppmøte Du må delta på minst 75 % av de fysiske samlingene for å få vurdert eksamen. Praksis har egne regler for oppmøte – se studieplanen for detaljer. Manglende oppmøte kan føre til at du ikke får fullført emnet. Politiattest Dette studiet krever gyldig politiattest før studiestart. Søk om politiattest når du har akseptert studieplassen. Les vår veiledning til hvordan du søker politiattest før du går videre til politiets nettsider for å sende søknaden.",
      "police_certificate": "Sjekk opptakskrav",
      "career_opportunities": "Denne videreutdanningen gir deg økt handlingskompetanse i å observere, vurdere og følge opp fødende, barselkvinner, nyfødte og barn 0–18 år . Du styrker kommunikasjon, foreldreveiledning og tverrfaglig samhandling , og kan bidra på et høyere faglig nivå i hverdagen – med ansvar for kvalitet, pasientsikkerhet og god oppstart for nye familier. Kompetansen er særlig relevant i føde- og barselavdelinger, barselpoliklinikker, nyfødt- og neonatalenheter , samt barneavdelinger og polikliniske tilbud for barn. I kommunehelsetjenesten er den etterspurt i helsestasjon og skolehelsetjeneste, tidlig hjemmebesøk og hjemmeoppfølging, avlastnings- og habiliteringstjenester for barn og familier , samt familiesentre og andre tverrfaglige kommunale tilbud. Noen bruker kompetansen i barnehager der det trengs helse- og omsorgskompetanse for barn med spesielle behov, eller som personlig assistent (BPA) for barn og unge med funksjonsnedsettelser. Kompetansen er etterspurt både i spesialist- og kommunehelsetjenesten, der du bidrar til trygg oppfølging og god start for foreldre og barn.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/helse/barsel-og-barnepleie"
    }
  ],
  "courses": [
    {
      "id": "01HH00A EIHOHOF-H25",
      "title": "Etikk, samhandling og kommunikasjon",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00A-EIHOHOF-H25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om yrkes- og bransjeetiske prinsipper, dilemmaer, relevante teorier, arbeidsmåter samt etisk refleksjon som verktøy har kunnskap om mangfold, migrasjonshelse og ulike kulturer og kan anvende den i møte med tjenestemottakere og samarbeidspartnere har kunnskap om gruppeprosesser, kriseteori og konflikthåndterin har innsikt i relevant lovverk og offentlige dokumenter som regulerer fagfeltet, brukermedvirkning og organisering av tilbud i sektore har bransjekunnskap og kjennskap til grunnleggende sosialpsykologiske prinsipper og hvordan disse kan påvirke enkeltindividet, familien og deres sosiale nettverk kan oppdatere sin yrkesfaglige kunnskap om teknologiske løsninger og hvordan disse kan påvirke samhandlingen med tjenestemottaker, pårørende og samarbeidspartnere forstår betydningen av kompetanse innenfor relasjonsbygging, kommunikasjon og samhandling i eget yrke, i møte med sårbare mennesker og i et samfunns- og verdiskapingsperspektiv",
        "skills": "Ferdigheter Studenten kan anvende faglig kunnskap om yrkes- og bransjeetiske prinsipper og dilemmaer, som grunnlag for refleksjon over teoretiske og praktiske problemstillinger kan anvende faglig kunnskap om teknologiske løsninger til å løse praktiske og teoretiske problemstillinger forsvarlig og med etisk bevissthet kan anvende teknikker innenfor relasjonsbygging, kommunikasjon og samhandling samt andre faglige verktøy som er relevante for yrkesutøvelsen kan finne relevant informasjon og fagstoff samt lovverk, forskrifter og stortingsmeldinger som er relevante for yrkesutøvelsen kan kartlegge en situasjon og identifisere faglige problemstillinger og behov for tiltak knyttet til mangfold og migrasjonshelse samt i møte med ulike kulturer",
        "competence": "Generell kompetanse Studenten forstår yrkes- og bransjeetiske prinsipper, dilemmaer og hvordan disse kan påvirke samhandlingen mellom tjenesteyter og tjenestemottaker har utviklet en etisk grunnholdning i utøvelsen av yrket som kommer til uttrykk gjennom refleksjon over egen yrkesutøvelse og gjennom kommunikasjon og samhandling med tjenestemottakere og samarbeidspartnere kan utføre arbeidet lovmessig, faglig og etisk forsvarlig ut fra tjenestemottakernes behov, med fokus på å fremme et helhetlig menneskesyn kan bygge relasjoner med fagfeller, tjenestemottakere og samarbeidspartnere basert på holdninger og verdier knyttet til et helhetlig menneskesyn, likeverd og respekt kan utvikle arbeidsmetoder, produkter og/eller tjenester som baserer seg på tjenestemottakerens behov og utfordringer, og som har relevans for yrkesutøvelsen"
      }
    },
    {
      "id": "01HH07O EIHOHOF-25",
      "title": "Svangerskaps-, fødsels- og barselomsorg",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH07O-EIHOHOF-25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om det normale svangerskapet, fosterets normale utvikling og gravide kvinners fysiske og psykiske forandringer, samt plager i svangerskapet har kunnskap om risikosvangerskap og neonatal påvirkning har kunnskap om den naturlige fødselsprosessen har kunnskap om komplikasjoner som kan oppstå under en fødsel, og om indikasjoner for assistert fødselshjelp har kunnskap om observasjon og pleie av barselkvinnens fysiske og psykiske helse har kunnskap om faktorer som kan forstyrre samspill mellom mor og barn har kunnskap om amming, ammeveiledning og alternativer til amming har kunnskap om forebyggende og helsefremmende arbeid i barseltiden har innsikt i lovverk, retningslinjer og prosedyrer som er knyttet til svangerskap og arbeidet med den fødende, barselkvinnen og partneren kan oppdatere sin kunnskap om den fødende og barselkvinnen forstår barsel- og barnepleierens rolle innenfor foreldreveiledning med tanke på å oppfylle barnets behov",
        "skills": "Ferdigheter Studenten kan anvende observasjons- og kartleggingsverktøy i pleie av syke gravide, fødende og barselkvinner kan anvende faglig kunnskap til å veilede og undervise omsorgspersoner i stell og observasjon av nyfødte barn kan anvende kommunikasjon for å informere og ivareta omsorgspersoner kan anvende observasjon og veiledning angående amming og kjenner til ulike hjelpemidler kan anvende refleksjon som et verktøy til å fremme samspill mellom mor, omsorgspersoner og barn kan finne og vurdere informasjon, prosedyrer og fagstoff som er relevant for pleie av og omsorg til syke gravide, fødende og barselkvinner kan kartlegge og identifisere hvilke behov den fødende, barselkvinnen og omsorgspersoner har for kunnskap, støtte og veiledning",
        "competence": "Generell kompetanse Studenten forstår, kjenner og respekterer sitt kompetanseområde og selvstendige ansvar i arbeidet med syke gravide, fødende, barselkvinner og omsorgspersoner har utviklet en etisk grunnholdning i utøvelsen av sitt arbeid i møte med mennesker fra forskjellige kulturer og med forskjellige behov har utviklet evne til selvinnsikt og forholder seg kritisk og reflektert i møte med den gravide, fødende, barselkvinnen og omsorgspersoner kan utføre sitt arbeid etter den syke gravides og barselkvinnens behov kan bygge relasjoner med andre yrkesgrupper og samarbeide tverrfaglig til beste for syke gravide, fødende og barselkvinner kan utvikle og oppdatere kunnskap og ferdigheter innenfor fagfeltet barsel- og barnepleie gjennom erfarings- og kunnskapsdeling"
      }
    },
    {
      "id": "01HH07P EIHOHOF-25",
      "title": "Omsorg for og pleie av nyfødte og premature barn",
      "credits": 6,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH07P-EIHOHOF-25/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om faglige vurderingsverktøy og strukturert kommunikasjon for å ivareta nyfødte og premature barn i et tverrfaglig samarbeid har kunnskap om de vanligste sykdommene og komplikasjonene som kan oppstå hos nyfødte og premature barn, og behandling av disse har kunnskap om årsaker til prematur fødsel og om observasjon og pleie av premature barn har kunnskap om NIDCAP-modellen og viktigheten av samspill mellom det premature barnet og omsorgspersonene har innsikt i lovverk, retningslinjer og prosedyrer knyttet til arbeidet med nyfødte og premature barn og deres omsorgspersoner kan oppdatere sin kunnskap om helsefremmende og forebyggende arbeid rettet mot nyfødte og premature barn",
        "skills": "Ferdigheter Studenten kan anvende observasjon for å identifisere det nyfødte og premature barnets behov og initiere adekvat stell og pleie kan anvende samspillsveilederen og NIDCAP-metoden i sitt arbeid med premature barn og deres omsorgspersoner kan finne, vurdere og anvende oppdatert informasjon og fagstoff relatert til arbeidet med nyfødte og premature barn kan kartlegge nyfødte og premature barns behov ved hjelp av faglige verktøy og involvere andre yrkesgrupper ut fra funn og kliniske observasjoner",
        "competence": "Generell kompetanse Studenten forstår betydningen av samspillet mellom omsorgspersoner og nyfødte/premature barn og kan bidra til å legge til rette for tilknytning mellom dem forstår etiske problemstillinger og kan reflektere over egen praksis og begrunne sine vurderinger faglig, etisk og juridisk i sitt arbeid med nyfødte og premature barn kan bygge relasjoner med andre yrkesgrupper og delta aktivt i tverrfaglig samarbeid med sikte på å fremme optimalt helse- og omsorgsnivå for nyfødte og premature barn og deres omsorgspersoner kan gi pleie og omsorg til nyfødte og premature barn ved å ivareta deres individuelle behov"
      }
    },
    {
      "id": "01HH07Q EIHOHOF-25",
      "title": "Sykepleie for barn 0-18 år",
      "credits": 9,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH07Q-EIHOHOF-25/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om barns normale utvikling i alderen 0–18 år og hvilke faktorer som kan true denne utviklingen har kunnskap om de vanligste sykdommene hos barn og unge samt symptomer og behandling av disse har kunnskap om sorg- og krisereaksjoner hos barn, unge, deres søsken og omsorgspersoner har kunnskap om etiske prinsipper, relasjonsbygging og målrettet kommunikasjon i ivaretakelse av syke barn og unge og deres omsorgspersoner har innsikt i lovverk, retningslinjer og prosedyrer som er knyttet til arbeidet med syke barn og unge og deres omsorgspersoner kan oppdatere sin kunnskap om faglige vurderingsverktøy og strukturert kommunikasjon for å ivareta syke barn og unge i et tverrfaglig samarbeid kan oppdatere sin kunnskap om forebyggende og helsefremmende arbeid for å ivareta barn og unges livskvalitet, trivsel og helse",
        "skills": "Ferdigheter Studenten kan kommunisere og samhandle med barn og unge for å skape og opprettholde tillit, med utgangspunkt i alder og utviklingstrinn, opplevelser og situasjon kan anvende kunnskap om ulike kommunikasjonsverktøy for å registrere, vurdere og rapportere tilstanden til syke barn og unge kan kartlegge barnets tilstand og identifisere forverring ved bruk av standardiserte observasjons- og kartleggingsverktøy og iverksette tiltak i samarbeid med andre yrkesgrupper kan finne og anvende oppdatert informasjon og fagstoff for å forberede og veilede barn, unge og omsorgspersoner angående undersøkelser, prosedyrer og behandling kan kartlegge og identifisere behov og støtte som barn, unge, deres søsken og omsorgspersoner trenger i bearbeidelse av sorg- og krisereaksjoner",
        "competence": "Generell kompetanse Studenten kan gi pleie og omsorg til syke barn ved å ivareta deres individuelle behov har utviklet en etisk grunnholdning i arbeidet med syke barn, deres søsken og omsorgspersoner kan utføre, vurdere og reflektere over sitt arbeid med syke barn på en profesjonell og etisk forsvarlig måte i samarbeid med annet helsepersonell og omsorgspersoner kan utføre systematisk kartlegging og observasjon av syke barns tilstand i samarbeid med aktuelle yrkesgrupper og etter gjeldende prosedyrer kan bygge relasjoner og samarbeide med barn og unge og deres omsorgspersoner ved å ta hensyn til deres ønsker, ressurser og tilstand har forståelse for egen kompetanse om syke barn og deres omsorgspersoner og kan bygge relasjoner tverrfaglig og på ulike tjenestenivåer for kompetanseutveksling"
      }
    },
    {
      "id": "01HH07R EIHOHOF-25",
      "title": "Praksis i barsel- og barnepleie",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH07R-EIHOHOF-25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om hva som kjennetegner den naturlige fødselsprosessen, indikasjoner for assistert fødselshjelp og komplikasjoner som kan oppstå under en fødsel har kunnskap om observasjons- og vurderingsverktøy til bruk i arbeidet med kartlegging av ressurser, behov og funksjonsnivå hos den fødende, barselkvinnen og det nyfødte, premature og syke barnet har kunnskap om verdier, målrettet kommunikasjon og etiske prinsipper for å kunne bygge gode relasjoner til fødekvinnen, barselkvinnen, barnet, pårørende og kollegaer har kunnskap om organiseringen av helsevesenet rundt den fødende, barselkvinnen, det nyfødte, premature og syke barnet og kjennskap til ansvar og oppgaver som er lagt til aktører og samarbeidspartnere på forskjellige avdelinger har innsikt i sentrale lover, forskrifter, retningslinjer og prosedyrer som regulerer rettigheter og plikter og gir anbefalinger innenfor fagfeltet barsel- og barnepleie forstår betydningen av yrkesfeltet barsel- og barnepleie i et folkehelse- og samfunnsperspektiv",
        "skills": "Ferdigheter Studenten kan anvende kunnskap om kvinner i svangerskap, fødsel og barseltid og barnet fra 0 til 18 år til å delta i behandling og pleie ut fra deres individuelle behov og iverksette tiltak i samarbeid med andre fagpersoner kan anvende observasjons- og kartleggingsverktøy til å delta i behandling og pleie av gravide med komplikasjoner, fødende, barselkvinner, nyfødte og syke barn kan gi omsorgspersoner veiledning og undervisning i stell og pleie av nyfødte og syke barn kan anvende kommunikasjonsformer og -teknikker og samhandling til å skape tillit, forberede og veilede barselkvinner barn på varierende alderstrinn og modningsnivå og deres omsorgspersoner kan anvende refleksjon i egen praksis og begrunne sine vurderinger faglig, etisk og juridisk for å ivareta den fødende, barselkvinnen og det syke barnets integritet kan finne og anvende informasjon og fagstoff som er relevant for problemstillinger i praksis innenfor yrkesfeltet barsel- og barnepleie kan kartlegge og observere premature barns behov og anvende utviklingstilpasset neonatalt stell og pleie kan kartlegge og identifisere faglige og etiske problemstillinger og behov for å iverksette tiltak knyttet til fødende, nyfødte, barselkvinner, syke barn og omsorgspersoner",
        "competence": "Generell kompetanse Studenten har utviklet en etisk grunnholdning og kjenner og respekterer sitt kompetanseområde og selvstendige ansvar i arbeidet med fødende, nyfødte, barselkvinner, syke barn og deres omsorgspersoner i samarbeid med annet helsepersonell kan gi pleie og omsorg til fødende, barselkvinner, nyfødte barn, syke barn og omsorgspersoner ut fra individuelle behov kan utføre utviklingstilpasset neonatal omsorg på en profesjonell og etisk forsvarlig måte i samarbeid med omsorgspersoner og helsepersonell kan bygge relasjoner med målgrupper, kollegaer og interne og eksterne samarbeidspartnere for å kvalitetsikre og videreutvikle sin kompetanse innenfor fagfeltet barsel- og barnepleie kan utvikle arbeidsmetoder gjennom veiledning og erfarings- og kunnskapsdeling innenfor barsel- og barnepleie i samarbeid med andre yrkesgrupper"
      }
    },
    {
      "id": "01HH00B EIHOHOF-25",
      "title": "Fordypningsoppgave",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00B-EIHOHOF-25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om undersøkelsesmetoder, standardiserte observasjons- og vurderingsverktøy og kommunikasjonsverktøy som benyttes i oppfølging og pleie av barselkvinner samt nyfødte, premature og syke barn har kunnskap om befruktning, fosterets utvikling, fysiske og psykiske endringer og plager i svangerskapet og neonatal påvirkning har kunnskap om den naturlige fødselsprosessen, indikasjoner for assistert fødselshjelp og komplikasjoner som kan oppstå under en fødsel har kunnskap om årsaker til prematur fødsel og utviklingstilpasset neonatal omsorg har kunnskap om barns normale utvikling, faktorer som kan true denne, sykdommer hos barn samt observasjon og pleie ut fra barnets behov og funksjonsnivå har kunnskap om verdier, målrettet kommunikasjon og etiske prinsipper for å kunne bygge gode relasjoner til fødekvinnen, barselkvinnen, barnet, pårørende og kollegaer har kunnskap om organiseringen av helsetjenester og kjennskap til ansvar og oppgaver som er lagt til ulike aktører knyttet til barsel- og barnepleie har innsikt i sentrale lover, forskrifter, retningslinjer og prosedyrer i sitt arbeid innenfor yrkesfeltet barsel- og barnepleie har kjennskap til virkninger og bivirkninger av vanlige legemidler brukt under svangerskaps-, fødsels- og barselomsorg samt legemidler som brukes til barn i alderen 0–18 år kan oppdatere sin yrkesfaglige kunnskap om barsel- og barnepleie samt helsefremmende og forebyggende arbeid i et folkehelseperspektiv forstår betydningen av eget kompetanseområde og egen rolle samt tverrfaglig samhandling på ulike nivåer innenfor helsetjenesten relatert til yrkesfeltet barsel- og barnepleie",
        "skills": "Ferdigheter Studenten kan anvende kunnskap om kvinner i svangerskap, fødsel og barseltid og barnet fra 0 til 18 år for å delta i behandling og pleie ut fra deres individuelle behov og iverksette tiltak i samarbeid med andre yrkesgrupper kan anvende observasjon og bruke observasjons- og vurderingsverktøy for å delta i behandling og pleie av den gravide med komplikasjoner, den fødende, barselkvinnen og det nyfødte barnet kan anvende kunnskap om undersøkelsesmetoder, standardiserte observasjons- og kartleggingsverktøy og kommunikasjonsverktøy som benyttes til tidlig oppdagelse av avvik i barnets normale utvikling og forverring av sykdom og helsetilstand hos syke barn kan anvende veiledning, undervisning og rådgivning i stell og pleie av barselkvinnen, det nyfødte, premature og syke barnet og barnets omsorgspersoner kan anvende kommunikasjon og samhandling for å skape tillit samt forberede og veilede barn på varierende alderstrinn og modningsnivå og deres omsorgspersoner kan anvende refleksjon for å vurdere og justere egen faglig utøvelse i tverrfaglig samarbeid innenfor yrkesfeltet barsel- og barnepleie kan finne, vurdere og anvende oppdatert informasjon og fagstoff som er relevant for problemstillinger knyttet til yrkesfeltet barsel- og barnepleie kan kartlegge og observere det premature barnets behov og anvende utviklingstilpasset neonatalt stell og neonatal pleie kan kartlegge og identifisere faglige og etiske problemstillinger og iverksette tiltak knyttet til behovene den fødende, barselkvinnen, barnet og deres omsorgspersoner har",
        "competence": "Generell kompetanse Studenten forstår og kan reflektere over etiske utfordringer og dilemmaer i eget arbeid med den fødende, barselkvinnen, barnet og omsorgspersoner forstår sin egen profesjonelle rolle i fagfeltet barsel- og barnepleie og kan begrunne sine vurderinger og handlinger faglig, etisk og juridisk har utviklet en etisk grunnholdning i utøvelsen av yrket som kommer til uttrykk gjennom refleksjoner og handlinger i møte med kulturelt mangfold kan gi pleie og omsorg til den fødende, barselkvinnen, barnet og omsorgspersoner ut fra individuelle behov kan utføre utviklingstilpasset neonatal omsorg på en profesjonell og etisk forsvarlig måte i samarbeid med omsorgspersoner og yrkesgrupper"
      }
    }
  ]
}