{
  "study_programs": [
    {
      "id": "Bedriftsutvikling i frisørfaget - 30",
      "title": "Bedriftsutvikling i frisørfaget",
      "description": "Bedriftsutvikling i frisørfaget er et 100 % nettstudium for frisører som vil lede, utvikle og løfte salongen. Du bruker verktøy innen økonomi, ledelse, markedsføring, digital kundereise og kjemi for frisører for å skape trygge behandlinger, lønnsom drift og sterkere kundeopplevelser.",
      "study_location": "Kjeller (Nettstudium 1 år)",
      "credits": 30,
      "language": "Norsk",
      "level": "Vitnemålsgivende studie",
      "why_choose": "Som nettstudium på deltid er det lett å kombinere med jobb i salong. Du får praktiske verktøy du kan ta i bruk med én gang – fra prisstrategi og budsjettstyring til synlighet i digitale kanaler og trygge, bærekraftige produktvalg. Studiet gir deg et helhetlig bilde av salongdrift: hvordan du organiserer arbeid, bygger kultur og merkevare, og skaper en sømløs kundereise fra første søk til ny timebestilling",
      "what_learn": "Studiet gir deg en samlet kompetanse i økonomistyring, ledelse og markedsføring, digital kundereise og merkevarebygging, samt kjemi, produktkunnskap og regelverk for trygge og bærekraftige behandlinger. Undervisningen er praktisk rettet: du jobber med egne case fra salong, analyserer tall, utvikler en enkel markedsplan, og trener på valg av produkter og behandlinger med hensyn til HMS og miljø.\nStudiet består av tre emner. Du søker opptak til hele utdanningen og får vitnemål når du har fullført og bestått.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning Studiet gjennomføres som 100% nettbasert deltidsstudium. Det vil være ukentlig nettundervisning og veiledning individuelt og i grupper. Obligatorisk oppmøte Du må delta på minst 80 % av undervisningen for å få vurdert eksamen. Manglende oppmøte kan føre til at du ikke får fullført emnet.",
      "police_certificate": null,
      "career_opportunities": "Kompetansen brukes direkte i salongledelse og drift . Mange går inn i eller styrker roller som daglig leder, mellomleder eller avdelingsleder , og tar ansvar for økonomi og prising, innkjøp og sortiment, kvalitet og HMS, rekruttering og opplæring . Med ferdigheter i digital kundereise og markedsføring kan du også lede arbeid med synlighet i digitale kanaler, kundeopplevelser og lojalitetsprogram . Utdanningen er relevant for enkeltstående salonger, kjeder, leverandører og opplæringskontor , og gir et solid grunnlag for å etablere egen virksomhet eller ta større ansvar i bedriften du allerede jobber i.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/skjonnhet-og-velvaere/bedriftsutvikling-i-frisorfaget"
    }
  ],
  "courses": [
    {
      "id": "01TL53A EIKBIFK",
      "title": "Økonomi, ledelse og markedsføring for frisører",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TL53A-EIKBIFK/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om sentrale økonomibegreper, bedriftsetablering, enkle kalkyler, lønnsomhetsbetraktninger, budsjettering og regnskapsanalyse har kunnskap om bransjens økonomiske utvikling har kunnskap om kjøpsatferd, merkevarebygging og markedsplanlegging har kunnskap om organisasjonsteori, organisasjonskultur, ledelsesteori og motivasjonsteori har innsikt i aktuelle lover innenfor ledelse, markedsføring og økonomi og forstår hvilken betydning disse har for bedriftens arbeidsbetingelser har kunnskap om bedriftsetablering og avvikling har kunnskap om ulike selskapsformer for organisering av bedriften har kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer",
        "skills": "Ferdigheter Studenten kan anvende og analysere et regnskap, og kan anvende denne informasjon for iverksetting av tiltak ved avvik fra budsjett og planen kan utarbeide et budsjett og sette opp enkle kalkyler kan utarbeide en markedsplan og relevante dokumenter for å søke finansiering i banker kan gjøre rede for og vurdere økonomiske utfordringer i lys av gjeldende lovkrav og bedriftens og bransjens behov kan anvende en markedsplan og sette om handlingsplaner for å gjennomføre denne kan kartlegge, formidle og presentere faglig informasjon, ideer og løsninger både muntlig og skriftlig kan finne, planlegge, gjennomføre og levere arbeidsoppgaver og prosjekter innen gitte tidsfrister, alene og i samarbeid med andre kan anvende faglig kunnskap på en tydelig og forståelig måte, og utveksle faglige synspunkter med medarbeidere, kunder og andre interessenter kan finne, utarbeide og følge opp planer",
        "competence": "Generell kompetanse Studenten kan planlegge, gjennomføre og levere arbeidsoppgaver og prosjekter innenfor LØM-emnet i henholdt til tidsfrister, alene og i samarbeid med andre har forståelse for bruk av generelle IKT systemer kan bygge relasjoner på en tydelig og forståelig måte, og utveksle faglige synspunkter med medarbeidere, kunder og andre interessenter. har forståelse i generelle ledelses-informasjonssystem kan utføre og følge opp planer kan utføre personalledelse og lede medarbeidere har forståelse for å behandle medarbeidere, kunder og andre med respekt"
      }
    },
    {
      "id": "01TL52C EIKBIFK",
      "title": "Digital kundereise i frisør- og hudpleierfaget",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TL52C-EIKBIFK/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om begreper, prosesser og verktøy som anvendes innenfor kartlegging av salong, kundegrupper og digital markedskommunikasjon har innsikt i verdien og effekten av merkevarebygging og digital markedsføring for salong. har kunnskap om den digitale kundereisen og hvordan man kan optimere den sømløse brukeropplevelsen og identifisere kundegruppen ved å benytte digitale verktøy i markedskommunikasjonen har innsikt i relevant regelverk som markedsføringsloven, bildebruk, nettvett, GDPR, og kunne gjøre rede for etiske retningslinjer innenfor digital markedsføring",
        "skills": "Ferdigheter Studenten kan anvende ulike verktøy og modeller for å identifisere og kartlegge sin egen kundegruppe, og anvende dette i praksis for å optimalisere kundetilfredshet i den digitale kundereisen. Kan kartlegge salongen, og kunne identifisere hva som differensierer sin salong/arbeidsplass fra andres Kan anvende metoder til å styrke merkevaren til bedriften og brukeropplevelsen til kunden Kan finne informasjon om hvordan man skal tilpasse den digitale markedskommunikasjonen til ulike kundegrupper ved hjelp av lover og regler",
        "competence": "Generell kompetanse Studenten Har forståelse for hvordan man kommuniserer og samhandler med kunder over de ulike digitale plattformene, for å oppnå best mulig bruker og kundeopplevelse har utviklet en etisk grunnholdning ved bruken av ulike verktøy for merkevarebygging og i den digitale kundereisen Kan bygge relasjoner med ulike kundegrupper gjennom digitale- verktøy og kanaler Kan utvikle arbeidsmetoder og tjenester som ivaretar den sømløse digitale kundereisen, markedskommunikasjon og markedsføring"
      }
    },
    {
      "id": "01TK55A EIKBIFK",
      "title": "Kjemi i frisørfaget",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK55A-EIKBIFK/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om frisørprodukter og deres påvirkning på helse og miljø har kunnskap om kjemiske sammensetninger i frisørprodukter, funksjonen av stoffgruppene og kjemiske reaksjoner har kunnskap om frisørprodukters egenskaper og klassifisering av atomer, molekyler og stoffgrupper- og kjemiske bindinger har innsikt i relevant regelverk, standarder og krav til kvalitet for frisørprodukter kan oppdatere sin yrkesfaglige kunnskap om frisørkjemi basert på relevante forskrifter og retningslinjer forstår betydningen av eksponering i frisørbransjen for kjemikalier, partikler og avgasser for utvikling av allergi, eksem og luftsveiplager",
        "skills": "Ferdigheter Studenten kan anvende faglig kunnskap om kjemi produktforståelse og regelverk i sitt arbeid med produkter relatert til frisøryrket kan utføre hensiktsmessige HMS tiltak i salongen for å forebygge helse- og miljøskader, basert på kunnskap om produktforståelse og ingrediensenes påvirkning kan anvende sikkerhetsdatablad og oppslagsverk for å vurdere frisørprodukters påvirkning på helse og sikkerhet kan finne informasjon og fagstoff som er relevant for arbeid med kjemiske reaksjoner i salong på en sikkerhets- og miljømessig måte. kan kartlegge innhold i frisørprodukter, strukturomforming og ulike grupper hårfarger, identifisere kjemisk innhold og virkning av disse og anvende denne forståelsen til forbedret kvalitet på arbeidet i salong",
        "competence": "Generell kompetanse Studenten har forståelse for bransjeetiske prinsipper gjennom ivaretakelse av HMS, miljøkjemi og FNs bærekrafts mål har utviklet en etisk grunnholdning i utøvelsen av yrket som ivaretar krav til HMS og bærekraft gjennom miljøbevisste valg av frisørprodukter kan utføre kjemiske behandlinger som ivaretar helse, sikkerhet og miljø for kunde og yrkesutøver har forståelse om kjemi, produkt og regelverk i formidling og relasjonsbygging med kolleger og samarbeidspartnere kan utvikle trygge arbeidsmetoder og behandlinger basert på kompetente valg av frisørprodukter"
      }
    }
  ]
}