{
  "study_programs": [
    {
      "id": "Bilteknikk - 120",
      "title": "Bilteknikk",
      "description": "Bilteknikk er videreutdanningen for deg som vil ta mer ansvar i verksted og drift. Du styrker kompetansen i kjøretøyteknologi, ledelse, kvalitet og HMS – og blir trygg på å lede arbeid i en bransje i rask teknologisk utvikling.",
      "study_category": "Teknologi og industri",
      "study_location": {
        "0": "Kongsberg"
      },
      "study_type": {
        "10": "Samlingsbasert 4 år"
      },
      "credits": 120,
      "language": "Norsk",
      "level": "Høyere fagskolegrad",
      "why_choose": "Bilbransjen endrer seg raskt med elektrifisering, nye materialer og skjerpede krav til sikkerhet og dokumentasjon. Det skaper behov for fagfolk som både forstår teknologien og kan lede arbeidet trygt og effektivt. | I denne utdanningen bygger du på fagbrevet ditt og får innsikt i både klassiske og nye drivlinjer, verkstedsdrift, logistikk og kundekvalitet. Du utvikler lederferdigheter, økonomiforståelse og systematikk i kvalitetsarbeidet – og lærer å kombinere praktisk erfaring med faglige beslutninger som tåler revisjon og tilsyn. Resultatet er økt trygghet i rollen og nye karrieremuligheter.",
      "what_learn": "I dette studiet lærer du å analysere, planlegge og lede biltekniske oppdrag – fra feilsøking og reparasjon til dokumentasjon, kvalitet og HMS. Du får faglig påfyll innen kjøretøyteknologi, elektro og energiteknikk (inkludert batteri og alternative drivsystemer), samt verkstedsdrift, logistikk og prosjektstyring. | Du trener på å ta tekniske og økonomiske valg, følge opp kvalitet og sikkerhet, og bruke digitale verktøy i planlegging og dokumentasjon. Emnene presenteres nedenfor.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres som nettbasert deltid med samlinger ved studiested Kongsberg. Samlingene holdes flere ganger per semester og varer normalt to til fem dager. Mellom samlingene deltar du i nettundervisning med forelesninger, veiledning og gruppearbeid – som regel på faste kvelder. Oppdatert plan med detaljerte samlingsuker og undervisningstider publiseres på studentsiden for Kongsberg . Oppmøte Eventuell oppmøteplikt og obligatoriske arbeidskrav framgår av emnebeskrivelsene. Manglende obligatorisk deltakelse kan påvirke vurdering/eksamen.",
      "police_certificate": null,
      "career_opportunities": "Med en høyere fagskolegrad i bilteknikk kvalifiserer du til roller som verkstedsleder, teknisk/administrativ leder, driftsleder eller kundemottaker med fagansvar . Du kan også arbeide med garantisaker, kvalitets- og HMS-oppfølging, logistikk og delelager , eller i tilsyn og forvaltning (f.eks. Statens vegvesen/biltilsyn). Mange bruker utdanningen som grunnlag for å bli faglærer/instruktør i videregående skole. Felles for rollene er at du kombinerer praktisk erfaring med ledelse, kvalitet, dokumentasjon og forståelse for ny kjøretøyteknologi.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/teknologi-og-industri/bilteknikk"
    }
  ],
  "courses": [
    {
      "id": "01TX00A",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om realfag som redskap innen sitt fagområde. har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes kan utføre beregninger, overslag og problemløsning relevant for dimensjoneringer og andre problemstillinger innen studieretningen kan vurdere eget arbeid i henhold til matematiske og fysiske lover kan utvide sine kunnskaper og har innsikt i egne utviklingsmuligheter innen realfag. kjenner til matematikkens og fysikkens egenart og plass i samfunnet",
        "skills": "Ferdigheter Studenten: kan gjøre rede for valg av regnemetode som anvendes for å løse faglige problemer kan gjøre rede for valg av digitale verktøy som anvendes til problemløsning innen realfaglige tema kan anvende digitale hjelpemidler til å løse matematiske problemer kan vurdere resultater av beregninger, samt reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til relevant informasjon og fagstoff i formelsamlinger, tabeller og fagbøker kan kartlegge en situasjon og identifisere realfaglige problemstillinger har kjennskap til og kan anvende grunnleggende fysiske lover og fysikkens metodikk kan tolke og anvende modeller som benyttes innen matematikk og fysikk",
        "competence": "Generell kompetanse Studenten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger har innsikt i rekkevidde og begrensninger for de metoder som anvendes kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om grunnleggende kommunikasjonsteori kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde har kunnskap om sentrale retoriske begreper og virkemidler har kunnskap om kildebruk og referanseteknikk etter standard for høyere utdanning kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter har kjennskap til hvordan man organiserer og produserer tekst har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne har kunnskap om språket som verktøy for god kommunikasjon og kjenner til norsk og engelsk fagterminologi innen sitt fagområde har kunnskap om grammatikk, sjangerforståelse samt språklige, stilistiske og grafiske virkemidler i tekst.",
        "skills": "Ferdigheter Kandidaten: kan reflektere over møter mellom forskjellige arbeidslivskulturer kan bruke relevante begreper for å analysere egen og andres tekst kan reflektere over og revidere tekster kan reflektere over hvordan retorikk benyttes kan bygge opp saklig argumentasjon og bruke retoriske virkemiddel kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig kan reflektere over egen kommunikasjon i profesjonell sammenheng kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og tekstbinding kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse Kandidaten: kan kommunisere hensiktsmessig for å bidra til en inkluderende og bærekraftig organisasjonskultur kan tilpasse språk og argumentasjon etter mål og mottaker kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting behersker relevante kommunikasjonsverktøy kan kommunisere gjennom relevante tekster og kanaler kan samarbeide om tekstproduksjon kan utvise etikk og gode holdninger i arbeidslivet kan reflektere over ulike verdier og tenkemåter i samfunnet"
      }
    },
    {
      "id": "01TX00C",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak har kunnskap om lønnskostnader har kunnskaper om mål, tiltak og handlingsplaner kjenner til emnets aktuelle lover og avtaler har erfaringsbasert kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer.",
        "skills": "Ferdigheter Kandidaten: kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler kan vurdere bedriftens betalingsevne og kapitalbehov kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler kan foreta en helhetlig prisvurdering og utarbeide kalkyler kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel kan identifisere, analysere og utvikle medarbeidernes kompetanse kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse Kandidaten kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid kan kommunisere internt og eksternt og benytte digitale verktøy til dette. kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TT00A",
      "title": "HMS-, prosjekt- og kvalitetsledelse",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00A/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om grunnleggende HMS-, prosjekt- og kvalitetsledelse har kunnskap til å se sammenheng mellom fagenes historiske utvikling og kontinuerlig endring også i framtiden har kunnskap om styringsverktøy for igangsetting, planlegging og gjennomføring av prosjekter har kunnskap om kvalitetsbegreper har kunnskap om utarbeidelse, bruk og vedlikehold av HMS-, IK-system og KS, i samsvar med lover, forskrifter og standarder kan vurdere eget og andres HMS-, prosjekt-, og kvalitetsarbeid i forhold til gjeldende normer og krav har innsikt i egne utviklingsmuligheter innen HMS-, prosjekt- og kvalitetsledelse",
        "skills": "Ferdigheter Studenten kan reflektere over et sikkert arbeidsmiljø og ut ifra dette, planlegge og iverksette systematiske tiltak for å forhindre skade på mennesker, materiell og miljø kan gjøre rede for aktiviteter som sikrer kvalitet kan gjøre rede for styringen av et prosjekt med hensyn til tid, kost og kvalitet kan gjøre rede for sine faglige valg kvalitativt og kvantitativt kan finne og henvise til informasjon og fagstoff og vurdere relevansen for aktuelle problemstillinger knyttet til HMS- prosjekt og kvalitetsledelse kan reflektere over egen faglig utøvelse og justere denne under veiledning",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre et prosjekt, samt utarbeide relevant dokumentasjon kan utveksle synspunkter og delta i diskusjoner om hvordan  HMS-, prosjekt- og kvalitetsledelse kan utøves kan bidra til et godt og sikkert fysisk og psykisk arbeidsmiljø med fokus på aktivt vernearbeid kan bidra til organisasjonsutvikling innen HMS-, prosjekt- og kvalitetsarbeid"
      }
    },
    {
      "id": "01TT00B",
      "title": "Mekanikk",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00B/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om statikk og grunnleggende mekanikk har kunnskap om materialers fasthetsegenskaper for dimensjoneringsanalyse kan gjøre rede for hvordan identifisere og beregne krefter, momenter og deformasjoner i mekaniske konstruksjoner kan vurdere design og konstruksjon av produkter i forhold til gjeldende normer og krav har innsikt i egne utviklingsmuligheter innen konstruksjon og dokumentasjon",
        "skills": "Ferdigheter Studenten kan gjøre rede for hvordan identifisere og beregne krefter, momenter og deformasjoner i mekaniske konstruksjoner kan reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre arbeidsoppgaver innen mekanisk konstruksjon kan utføre arbeidet etter oppdragsgivers behov kan utveksle synspunkter med fagfeller på tvers av fagområder kan utveksle faglige synspunkter på problemstillinger og delta i diskusjoner"
      }
    },
    {
      "id": "01TT00C",
      "title": "Materialkunnskap",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00C/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om moderne konstruksjonsmaterialer, prosesser og verktøy for fremstilling av produkter kan vurdere konstruksjonsmaterialer i henhold til produktstandarder kan vurdere egne arbeid innen materialteknologi i henhold til gjeldende normer og standarder har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter Studenten kan gjøre rede for aktuelle konstruksjonsmaterialer kan reflektere over materialtekniske valg og vurdere moderne og bærekraftige materialer kan finne og henvise til normer og standarder og vurdere relevansen i forbindelse med materialvalg kan gjøre rede for sine faglige valg med fokus på miljø og bærekraft",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre materialtekniske arbeidsoppgaver selvstendig, og som deltaker i et team i en bærekraftig utvikling kan utveksle synspunkter med andre med bakgrunn innenfor bransjen/ yrket og delta i diskusjoner om utvikling av god praksis kan bidra til organisasjonsutvikling ​"
      }
    },
    {
      "id": "01TT00K",
      "title": "Elektroteknikk",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00K/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om aktuelle elektriske og elektroniske komponenter, koblingsskjemaer og relevant elektroteknisk dokumentasjon etter gjeldende standard har kunnskap om sikkerhetsaspektet i eller nær spenningssatte anlegg i henhold til normer og krav har kunnskap om strømarter, effekter og lavspente styringssystemer kjenner til prinsipper rundt programmering innen automasjonssystemer kan vurdere eget arbeid i forhold til gjeldende normer og krav har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter Studenten kan gjøre rede for sammenhengen mellom resistans, strøm, spenning og effekt kan gjøre rede for komponenter og kretser kan gjøre rede for programmer i automasjonssystemer kan gjøre rede for koblingsskjemaer og feilsøking kan reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan utveksle synspunkter med andre med bakgrunn innenfor bransjen/ yrket og delta i diskusjoner om utvikling av god praksis kan bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TT00L",
      "title": "Teknisk dokumentasjon",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00L/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om DAK og aktuelle standarder, normer og krav som benyttes i tegningsproduksjon har kunnskap om 2D- og 3D-modellering kan vurdere eget arbeid i henhold til gjeldende standarder, normer og krav har bransjekunnskap og kjennskap til yrkesfeltet har innsikt i egne utviklingsmuligheter med designverktøy har forståelse i tegningslesing innenfor andre disipliner",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av designverktøy kan gjøre rede for oppbygningen av teknisk dokumentasjon og revisjonshåndtering kan reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til standarder, normer og krav kan anvende faglig kunnskap på praktiske og teoretiske problemstillinger",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre design- og konstruksjonsdokumentasjon kan utveksle faglige synspunkter på problemstillinger og delta i diskusjoner kan redegjøre for egen og bransjens struktur i lagring og arkivering av dokumentasjon"
      }
    },
    {
      "id": "01TT00R",
      "title": "Energiteknikk",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00R/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om termodynamikkens grunnbegreper, samt oppbygningen og virkemåten til aktuelle energisystemer har kunnskap om norsk energiforsyning, produksjonsmetoder og distribusjon av elektrisk kraft har kunnskap om forskjellige elektriske maskiner har kunnskap om batteriteknologier og hva som preger ny utvikling kan vurdere eget arbeid i henhold til HMS, lover, forskrifter, normer og standarder har kunnskap om energiteknikk kjenner til energiteknikkens historie, tradisjoner, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter innen energiteknikk",
        "skills": "Ferdigheter Studenten kan gjøre rede for termodynamikkens oppbygning og virkemåten til aktuelle energisystemer kan gjøre rede for bruken av analyseverktøy kan gjøre rede for prinsippene i norsk energiforsyning produksjonsmetoder og distribusjon kan gjøre rede for aktuelle batteriteknologier og hva som preger ny utvikling kan reflektere over eget arbeid i henhold til gjeldende HMS-regler, lover, forskrifter, normer og standarder kan reflektere over energiteknikkens miljøpåvirkning og plass i samfunnet kan reflektere over egne utviklingsmuligheter innen energiteknikk kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling kan gjøre rede for oppbygging og virkemåte av elektriske maskiner og aktuelle energisystemer kan gjøre rede for kjølemediers påvirkning på miljøet",
        "competence": "Generell kompetanse Studenten kan planlegge, prosjektere og iverksette løsninger for energiteknikk alene, eller som deltaker av en gruppe kan utføre arbeid etter oppdragsgivers behov i tråd med etiske krav og retningslinjer kan bidra med faglige synspunkter på problemstillinger og delta i diskusjoner kan bidra til organisasjonsutvikling kan bidra til at det utarbeides bruker- og servicedokumentasjon"
      }
    },
    {
      "id": "01TT01A EITBTKH24",
      "title": "Kjøretøyteknologi",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT01A-EITBTKH24/2028-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om utforming av påbygg og utbedring og reparasjon av karosserier for lette og tunge kjøretøy med hensyn på brukervennlighet, sikkerhet og miljø har kunnskap om oppbygging og virkemåte til bremsesystemer og understell på lette og tunge kjøretøy og kunne gjøre de nødvendige beregninger har kunnskap om hvordan den yrkesfaglige kunnskapen kan oppdateres kan vurdere eget arbeid i forhold til gjeldende normer og krav kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter Studenten kan gjøre rede for utforming av påbygg og utbedring og reparasjon av karosserier for lette og tunge kjøretøy kan gjøre rede for sine faglige problemstillinger for utforming av påbygg, og å foreta nødvendige reparasjoner alt etter gjeldende lover og regler, samt etter produsentenes henvisninger kan gjøre rede for oppbyggingen og virkemåten til bremsesystemer og understell på lette og tunge kjøretøy kan gjøre rede for sine faglige problemstillinger for bremsesystemer og understell og foreta nødvendige reparasjoner etter gjeldende lover og regler, samt etter produsentenes henvisninger kan reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre produksjonstekniske arbeidsoppgaver og prosjekter alene, og som deltaker i en gruppe, i tråd med etiske krav og retningslinjer som til enhver tid gjelder innen bilbransjen kan utveksle synspunkter med andre med bakgrunn innenfor bilteknikk og delta i diskusjoner om utvikling av god praksis kan bidra til organisasjonsutvikling ved å følge utviklingen av ny teknologi innen bilteknikk"
      }
    },
    {
      "id": "01TT01B EITBTKH24",
      "title": "Alternative fremdriftssystemer",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT01B-EITBTKH24/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om motor- og drivverkstekniske løsninger for lette og tunge kjøretøy med ulike fremdriftsformer og drivstoff har kunnskap om elektriske-, elektroniske- og datasystemer for lette og tunge kjøretøy har kunnskap om hvordan den yrkesfaglige kunnskapen kan oppdateres kan vurdere eget arbeid i forhold til gjeldende normer og krav kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter Studenten kan gjøre rede for motor- og drivverkstekniske løsninger for lette og tunge kjøretøy med ulike fremdriftsformer og drivstoff kan gjøre rede for sine faglige problemstillinger for motor- og drivverkstekniske løsninger og foreta nødvendige reparasjoner alt etter gjeldende lover og regler samt produsentenes henvisninger kan gjøre rede for elektriske, elektroniske og datasystemer for lette og tunge kjøretøy kan gjøre rede for sine faglige problemstillinger for elektriske, elektroniske og datasystemer og foreta nødvendige reparasjoner alt etter gjeldende lover og regler, samt produsentenes henvisninger kan reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre produksjonstekniske arbeidsoppgaver og prosjekter alene, og som deltaker i gruppe, i tråd med etiske krav og retningslinjer som til enhver tid gjelder innen bilbransjen kan utveksle synspunkter med andre med bakgrunn innenfor bilteknikk og delta i diskusjoner om utvikling av god praksis kan bidra til organisasjonsutvikling ved å følge utviklingen av ny teknologi innen bilteknikk"
      }
    },
    {
      "id": "01TT01C EITBTKH24",
      "title": "Administrasjon og bransjeledelse",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT01C-EITBTKH24/2029-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om begreper, teorier, prosesser og verktøy som anvendes innenfor fagområdet verksteddrift, og kan vurdere eget arbeid i forhold til gjeldende normer og krav har kunnskap til bransjen sin historie, tradisjoner, egenart og plass i samfunnet, samt innsikt i egne utviklingsmuligheter har kunnskap om aktuelle avtaler som eksisterer mellom partene i arbeidslivet har kunnskap om hvilke lover som styrer hoved- og tariffavtaler har kunnskap om å kunne løse praktiske problemstillinger ved hjelp av aktuelle rettskilder har kunnskap om reglene i kjøps- og forbrukerkjøpsloven kan vurdere hvilke faktorer som påvirker kostnader i bilbransjen kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter Studenten kan gjøre rede for og reflektere over sine faglige valg for drift og ledelse av et firma i bilbransjen kan finne og henvise til fagstoff, samt vurdere hvor relevant stoffet er for yrkesfaglige problemstillinger i bilbransjen kan gjøre rede for aktuelle lover som styrer hoved- og tariffavtaler kan reflektere og løse praktiske problemstillinger ved hjelp av aktuelle rettskilder kan finne og henvise til kjøpsbegrepet og kjøpslovens virkeområde",
        "competence": "Generell kompetanse Studenten kan utveksle faglige synspunkter med andre om avtalerettslige forhold kan planlegge og utføre yrkesrettede arbeidsoppgaver og prosjekter enten alene eller som deltaker i grupper, i tråd med retningslinjer og etiske krav kan utveksle faglige synspunkter med andre både i bilbransjen og andre relaterte næringer og organisasjoner, og delta i drøftelser om utvikling og god praksis, samt bidra til organisasjonsutvikling kan planlegge og opprette aktuelle avtaler som eksisterer mellom partene i arbeidslivet"
      }
    },
    {
      "id": "01TT01D EITBTKH24",
      "title": "Logistikk, bærekraft og sirkulærøkonomi",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT01D-EITBTKH24/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om forskjellene mellom lineærøkonomi og sirkulærøkonomi har kunnskap om sirkulæreøkonomiske prinsipper og utfordringene for en bærekraftig virksomhet i bransjesammenheng har kunnskap om hvordan innovasjonsprosesser kan bidra til at bedrifter og næringer tar i bruk sirkulærøkonomiske prinsipper. har kunnskap om logistikktekniske teorier og begreper, samt bransjetekniske prosesser og verktøy kan vurdere hvilke faktorer som påvirker kostnader i bilbransjen kan vurdere eget arbeid i forhold til gjeldende normer og krav som gjelder for energibruk og miljø kjenner til bransjens historie, tradisjon, egenart innen energiteknikk, kjemi og miljø har innsikt i egne utviklingsmuligheter innenfor det grønne skiftet",
        "skills": "Ferdigheter Studenten kan reflektere over energibruk med hensyn til utslipp og bærekraft og kunne endre energibruk for å bidra til det grønne skiftet kan reflektere over samspillet mellom økonomiske, sosiale, miljømessige spørsmål innen sirkulærøkonomi kan gjøre rede for innovative muligheter for verdiskaping ved å tilpasse sirkulærøkonomiske prinsipper innenfor bedriften kan finne og henvise til informasjon om forbedringspotensial innen drift av etter-marked ved bruk av bærekraftig verdikjedetankegang kan finne og henvise til informasjon og fagstoff om utfordringene for det grønne skiftet og vurdere tiltak for å bidra til 1,5 graders-målet kan finne og henvise situasjon som har med miljø og bærekraft å gjøre og identifisere energitekniske utfordringer for å ta i bruk nullutslippsenergibærere",
        "competence": "Generell kompetanse Studenten kan utveksle synspunkter om hvordan logistikk i virksomheten kan utvikles i samhandling med medarbeidere og prosjektdeltakere i prosessen kan utveksle synspunkter med andre om bærekraftsmål og delta i diskusjoner om sikker, økonomisk og miljøvennlig praksis kan planlegge og gjennomføre arbeidsmetoder som bedriften tar i bruk i for å fremme sirkulærøkonomiske prinsipper kan planlegge og gjennomføre en sirkulærøkonomisk grunnholdning i en virksomhet basert på bedriftens strategi og målsetninger kan bidra til styrking av etiske holdninger for sirkulærøkonomiske prinsipper i en virksomhet kan planlegge og gjennomføre arbeidsoppgaver, som å utføre miljøtiltak for å sikre en bærekraftig drift, alene, og som deltaker i gruppe, i tråd med etiske krav og retningslinjer kan utveksle synspunkter om energibruk og miljø på en bærekraftig måte med andre med bakgrunn innenfor bransjen/yrket og delta i diskusjoner om utvikling for å nå 1,5 graders-målet"
      }
    },
    {
      "id": "01TX00H",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H/2028-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om hvordan man skriver en prosjektrapport har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt har kunnskap om sammenhengen mellom teori og praksis kan vurdere eget prosjekt i forhold til gjeldende normer og krav kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av tema for hovedprosjekt kan identifisere, kartlegge og vurdere en faglig problemstilling kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat kan skrive en prosjektrapport kan drøfte sammenhengen mellom teori og praksis kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    }
  ]
}