{
  "study_programs": [
    {
      "id": "BIM-tekniker konstruksjon - 60",
      "title": "BIM-tekniker konstruksjon",
      "description": "BIM-tekniker konstruksjon er videreutdanningen for deg som vil ta en nøkkelrolle i digital prosjektering av bygg og anlegg. Du lærer å bruke bygningsinformasjonsmodellering (BIM) til å planlegge, modellere og kvalitetssikre konstruksjoner – fra idé til “as-built”.",
      "study_location": "Kongsberg (Samlingsbasert 2 år) | Fredrikstad (Stedbasert 2 år)",
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "BIM-tekniker konstruksjon er utdanningen for deg som vil bruke digitale verktøy til å forme framtidens bygg- og anleggsprosjekter. Som BIM-tekniker blir du bindeleddet mellom fagarbeidere, rådgivere og prosjekterende – og bidrar til at bygg planlegges, dokumenteres og gjennomføres mer presist og bærekraftig.\nStudiet gir deg praktisk kompetanse i bygningsinformasjonsmodellering (BIM), 3D-modellering og digital samhandling på tvers av fag. Du lærer å utvikle og kvalitetssikre modeller, forstå informasjonsflyt i komplekse byggeprosesser og bruke åpne standarder (som IFC) for sikker og effektiv kommunikasjon i prosjektet.\nBIM-teknikerens rolle blir stadig viktigere når byggenæringen skal møte krav til digitalisering, klima og effektiv ressursbruk. Med denne utdanningen får du en ettertraktet kompetanse som lar deg kombinere teknisk forståelse med digitale ferdigheter – og være med på å bygge smartere.",
      "what_learn": "Gjennom studiet får du en helhetlig forståelse av hvordan BIM brukes for å planlegge, dokumentere og gjennomføre byggeprosjekter mer effektivt og bærekraftig. Du lærer å modellere konstruksjoner i 3D, strukturere informasjon og kvalitetssikre digitale modeller for ulike faser av byggeprosessen.\nStudiet gir innsikt i standarder og metoder for åpen BIM, samhandling og informasjonsflyt, samt bruk av verktøy for mengdeberegning, kollisjonskontroll og teknisk dokumentasjon. Du får erfaring med å bruke data til å forbedre beslutninger og redusere feil i prosjekter – fra planlegging til ferdigstillelse.\nStudiet består av tre emner, inkludert et tverrfaglig prosjekt. Du søker opptak til hele utdanningen og oppnår fagskolegrad når du har fullført.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger – første studieår 2025–2026 | Studiet kombinerer nettundervisning med fysiske samlinger ved studiested Kongsberg. Samlingene holdes vanligvis to ganger per semester og varer opptil fem dager. Mellom samlingene følger du nettundervisning inntil to kvelder i uka, vanligvis mellom kl. 17.00 og 21.00. | Det utarbeides egne timeplaner for samlingene, og studentene får semesterplan ved studiestart. Oppdatert plan med undervisningstider og samlingsuker publiseres på | studentsiden for Kongsberg | før oppstart. | Obligatorisk oppmøte | Du må delta på minst | 75 % av de fysiske samlingene | for å få vurdert eksamen. Manglende oppmøte kan føre til at du ikke får fullført emnet.",
      "police_certificate": null,
      "career_opportunities": "Som BIM-tekniker konstruksjon får du en nøkkelrolle i planlegging, prosjektering og oppfølging av byggeprosjekter. Du bidrar til at informasjon, modeller og dokumentasjon flyter sømløst mellom fag og aktører – fra arkitekt og rådgiver til entreprenør og byggherre. | Kompetansen brukes i arbeid med modellering, kvalitetssikring, visualisering og teknisk dokumentasjon av bygningskonstruksjoner. Du blir en viktig ressurs i prosjekter som krever tverrfaglig samhandling og høy digital presisjon. | BIM-kompetanse er etterspurt i hele byggenæringen. Mange BIM-teknikere jobber hos | entreprenører, rådgivere, arkitekt- og ingeniørfirmaer, ferdighusprodusenter, programvareleverandører og i offentlig sektor | . Erfaringen kan også danne grunnlag for videre utvikling mot prosjektledelse, prosjektering eller undervisning.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/informasjonsmodellering-bim/bim-tekniker-konstruksjon"
    }
  ],
  "courses": [
    {
      "id": "01TI54A",
      "title": "Prosess, samhandling og informasjonsflyt",
      "credits": 28,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TI54A/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | forstår hvordan BIM-prosesser og informasjon i modell kan endre valgene av løsninger for å oppnå mere bærekraftige bygg og ivareta bruk inn mot FDVU | har kunnskap om bruk av kunstig intelligens (AI) i BIM for BAE næringen | har kunnskap om verktøy som forenkler og automatiserer prosesser | har kunnskap om programteknisk og BIM-faglig stoff på norsk og engelsk | har innsikt i informasjonsinnhenting på nett og har kunnskap om preaksepterte løsninger som oppfyller funksjonskrav i bygg- og anleggsprosjekter | har kunnskap om krav til detaljeringsnivå og kvalitet i digitale modeller samt har kjennskap til relevante norske standarder og bransjenormer | har kunnskap om konseptet åpenBIM, hvorav IFC og BCF er de viktigste felles filformatene for samhandling i BIM-prosesser | har kunnskap om tallbehandling relatert til de programmene og de problemstillingene som er aktuelle i en arbeidssituasjon | har kunnskap om plattformer og tekniske løsninger for kommunikasjon mellom byggeplass og digital modell | har kunnskap om byggebransjen og kjenner til samspillet mellom de ulike aktørene i bransjen gjennom bruk av for eksempel Lean og VDC | har kunnskap til ulike entrepriseformer/anbudskontrakter og svakheter og styrker ved dem i en gjennomføringsmodell | forstår oppbygging og hensikt med BIM-manualer og styringsdokumenter i en samhandlingsprosess | har kunnskap om håndtering av krav til informasjon på et organisasjons-, eiendels- og prosjekt-nivå | har kunnskap om filhåndtering og –navngivning, kjenner til risikovurderinger i forhold til tap av data samt kan identifisere de ulike filtypene som anvendes i arbeid med BIM | kan oppdatere sin yrkesfaglige kunnskap om bygningsinformasjonsmodellering",
        "skills": "Ferdigheter | Studenten: | kan anvende, håndtere og vedlikeholde relevant teknisk utstyr i en BIM-teknikers hverdag, på egen arbeidsplass, møteareal og andre samhandlingsområder | kan anvende forskjellige tekstbehandlingsprogrammer, digitale ordbøker/oppslagsverk og enkle skjerm- og bildebehandlings-programmer for raskt å skrive visuelle bruksanvisninger og visuelle rapporter til bruk i effektiv kommunikasjon med både byggeplass og andre aktører i en samhandlingsprosess | kan anvende kommunikasjon- og samhandlingsplattformer for planlegging, deling av innhold, aktiviteter, møtevirksomhet, samskrivning og fildeling | kan finne informasjon og dele kunnskap og fagstoff ved anvendelse av nettbaserte kunnskapssystemer, søkemotorer, nettforum, faglige nettverk og bransjeorganisasjoner | kan anvende BIM-programmer for å overføre filer fra BIM-programmene til andre programmer, med vekt på forarbeid/tilrettelegging i det programmet det eksporteres fra og etterarbeid/tilrettelegging i det programmet det importeres til | kan anvende relevante BIM-verktøy i en prosess på en rasjonell måte for problemløsning i prosjekter, som riktig oppstart, strukturert modellering og informasjonsuttak | kan anvende informasjonskilder som tabeller, preaksepterte løsninger, oppslagsverk, aktuelle norske standarder og bransjenormer som er relevant for en BIM-faglig problemstilling | kan anvende programmer for tallbehandling for å analysere informasjon, målinger og effekter mellom fag, samt behandle lister fra modelleringsprogrammer | Kan anvende verktøy for fremdriftsplanlegging, visualisering av framdrift og avhengigheter | kan anvende styringsdokumenter, herunder BIM-gjennomføringsplan (BEP), for praktisk digitalt samarbeid i koordinering av en byggeprosess | kan anvende visualiseringsverktøy for illustrasjoner og -presentasjoner | kan anvende skjermbilde for å dokumentere arbeid | kan anvende presentasjonsprogrammer og holde faglige presentasjoner | kan anvende maskinvalidering knyttet til BIM og BIM prosesser | kan anvende kunstig intelligens (AI) innenfor fagrelaterte oppgaver i prosjekter | kan kartlegge en situasjon og identifisere faglige problemstillinger og behov for iverksetting av tiltak knyttet til struktur og databehandling, digital kommunikasjon, tallbehandling, samt samhandling og koordinering i prosjekter.",
        "competence": "Generell kompetanse | Studenten: | kan utvikle metoder for digital samhandling og modellering og er i stand til å oppdatere sin kunnskap innenfor BIM ved hjelp av egenlæring og samarbeid med tverrfaglige fagmiljøer | kan utføre arbeid med dokumentasjon, tallbehandling og mengdeuttak. | kan utvikle og oppdatere egen kunnskap om BIM-programvare, - begreper og -verktøy | kan utføre relevant arbeid med å utforme og kontrollere BIM-modeller etter de ulike målgruppenes behov og er i stand til å definere hva som er det etterspurte detaljeringsnivå | har forståelse for utviklingen av BIM-modeller i samspillet mellom de ulike aktørene i bygg- og anleggsbransjen | kan utføre modellering og kontroll av digitale modeller i en prosjekterings-/byggeprosess etter kundens kvalitetskrav. | har utviklet holdninger og respekt for andre aktører som benyttes i situasjoner der teori og praksis møtes | har utviklet en etisk grunnholdning i sin framferd mot medarbeidere, kunder og samarbeidspartnere på grunnlag av gjensidig samarbeid og tillit som BIM-tekniker | kan bygge relasjoner med aktører i bransjen, kunder og andre BIM-teknikere på tvers av fag og bedrifter. | kan bygge relasjoner med andre fagdisipliner for å utvikle sine tverrfaglige kunnskaper og ferdigheter"
      }
    },
    {
      "id": "01TI54B",
      "title": "Bygningsinformasjonsmodellering- Konstruksjon",
      "credits": 28,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TI54B/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | Har kunnskap om BIM-programmer som er i bruk i bransjen og kan identifisere programmenes egenskaper. | Har kunnskap om fagrelaterte tegninger innen bygg- og anleggssektoren | Har kunnskap til de ulike tegningsgrunnlagene som er vanlige ved prosjekteringen av både større og mindre prosjekter, samt identifisere kravene til tegningsgrunnlag ved de forskjellige fasene i prosjektet | har kunnskap om oppbygning av modell, struktur og klassifiseringer etter bransjerelaterte standarder og andre sentrale formater | har kunnskap om hvordan etablere og implementere målinger og effekter (metrics) ved bruk av digitale modeller | har kunnskap om implementering av styringsdokumenter i modeller for bygg- eller anleggsprosjekter | har kunnskap om byggebransjen og til samspillet med behovet for BIM-leveranse mellom aktørene i bygg- og anleggsbransjen i prosjektets livsløp. | har kunnskap om kartdatum og koordinatsystemer brukt i Norge av aktører i bygg- og anleggsbransjen | har kunnskap om georeferering for å starte et BIM-prosjekt | har kunnskap om løsningene for utvidet virkelighet (XR) | har innsikt i forskrifter, normer, norske standarder og preaksepterte løsninger for bygg- og anleggsbransjen | har innsikt i kontraktsformer, styrende dokumenter, håndbøker og manualer | har kunnskap om verktøy som forenkler og automatiserer prosesser | har kunnskap til geografisk informasjonssystemer (GIS), og forholdet mellom BIM/GIS | har bransjekunnskap og kjennskap til yrkesfeltet, og kjenner til hvordan 3D-modellering, modellbasert dokumentasjon og IFC brukes i prosjekter for å sikre effektiv informasjonsflyt og samhandling. | kan oppdatere sin yrkesfaglige kunnskap ved å ta i bruk nye verktøy og metoder for 3D-modellering, modellkontroll og digital dokumentasjon i tråd med utviklingen i bransjen. | forstår egen bransjes/yrkes betydning i et samfunns- og verdiskapingsperspektiv, og ser hvordan modellbaserte arbeidsmetoder som IFC og tegningsforståelse bidrar til kvalitet, effektivitet og bærekraft i byggeprosesser.",
        "skills": "Ferdigheter | Studenten: | kan anvende løsninger til å fremstille visuelle dashbords av etablerte målinger og effekter fra modell | kan finne informasjon og fagstoff som er relevant for en BIM- og yrkesfaglig problemstilling | kan anvende ulike BIM-programmer for bygningskonstruksjoner | kan anvende relevante bransjeformater for modellering av faglig innhold | kan anvende forskjellige programvare for å generere relevante tegninger, mengdeuttak og dokumentasjon ut fra modeller | kan anvende analyseverktøy for kontroll med bruk av BIM-modell | kan anvende automatisering og parametrisering | kan anvende kartdatum og koordinatsystemer i modelleringsprogram | kan kartlegge dataflyt mellom programvare og behovet for ulike filformater til forskjellige formål | kan anvende ulike formater fra datafangst, bestillingstjenester og andre leverandører, til etablering av grunnlagsdata og/eller videre bearbeidelse | kan anvende landmålingsinstrumenter for datafangst og høsting med etterarbeid gjennom bearbeidelse og prosessering til bruk i ulike formål | kan anvende digitale tallbehandlingsprogram og tekstbehandlere for bearbeidelse, beregninger og dokumentasjon | kan anvende sin BIM-faglige kunnskap for å koordinere digital modellering og tverrfaglig modellkontroll i et bygg- og anleggsprosjekt | kan anvende modellering- og samhandlingsprogram til kvalitetssikring av mengder, klassifisering, regelsjekk av egen fagmodell | kan anvende modellering- og samhandlingsprogram til tverrfaglig kollisjonskontroll, verifisering av funn og byggbarhet | kan anvende bransjerelatert modell standard og andre relevante formater til utveksling av informasjon på tvers av ulik programvare og kan nyttiggjøre seg informasjonen i flere ulike BIM-programmer",
        "competence": "Generell kompetanse | Studenten: | kan utvikle sin BIM-kompetanse, samt utvikle metodikk for å lære seg nye BIM-programvarer og -prosesser og identifisere programmenes egenskaper | kan utføre modellerings- og kontrollarbeid ved å anvende flere ulike BIM-programmer for bygningskonstruksjoner | har utviklet kompetanse og anvendelse av bransje-relevante programmer for kvalitetskontroll og modellsjekking innenfor modellering av bygninger og tekniske installasjoner. | har utviklet etisk holdning og forståelse om kunstig intelligens (KI), og bruk av kunstig intelligens i BIM-programvare, -verktøy og -metoder. | kan utføre arbeidet med resultatdata og tilhørende dokumentasjon ved hjelp av en 3D-modell både i native format og i åpen-BIM-konseptet etter behov og for sin fagdisiplin. | har forståelse for yrkes- og bransjeetiske prinsipper knyttet til bruk av 3D-modellering, bearbeiding av informasjon, IFC og modellkontroll, samt modellbasert tegningsforståelse og dokumentasjon i tverrfaglige prosjekter. | kan bygge relasjoner med fagfeller og på tvers av fag, samt med eksterne målgrupper, gjennom samarbeid om 3D-modellering, bearbeiding av informasjon, IFC-basert modellkontroll og modellbasert tegningsforståelse og dokumentasjon."
      }
    },
    {
      "id": "01TI54C",
      "title": "Avsluttende tverrfaglig prosjekt",
      "credits": 4,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TI54C/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | har kunnskap om en selvvalgt problemstilling | innenfor BIM-utdanningens overordnende læringsutbyttebeskrivelser | har bransjekunnskap til å lage en problemstilling for samspillet mellom teori og praksis | har kunnskap om georeferering som en nødvendighet for å starte et BIM-prosjekt | har kunnskap om oppbygging av styringsdokumenter for digital samhandling gjennom blant annet CDE | har kunnskap om samspillet mellom aktørene | har kunnskap om filhåndtering og –navngivning, kjenner til risikovurderinger i forhold til tap av data samt kan identifisere de ulike filtypene som anvendes i arbeid med BIM | har kunnskap om verktøy som forenkler og automatiserer prosesser. | kan vurdere eget arbeid i forhold til normer og krav | har innsikt i relevant regelverk, standarder, avtaler og krav til kvalitet knyttet til strukturert 3D-modellering, bruk av IFC, modellkontroll og modellbasert dokumentasjon i koordinering og samhandling. | har bransjekunnskap og kjennskap til yrkesfeltet, og forstår hvordan databehandling, modellkontroll og 3D-modellering benyttes for å sikre kvalitet og effektiv informasjonsflyt i prosjekter. | kan oppdatere sin yrkesfaglige kunnskap ved å tilegne seg nye metoder og digitale verktøy for modellkontroll, databehandling og modellbasert koordinering i henhold til bransjeutviklingen. | forstår egen bransjes/yrkes betydning i et samfunns- og verdiskapingsperspektiv, og ser hvordan bruk av IFC, strukturert 3D-modellering og effektiv dokumentasjon bidrar til bærekraft, kvalitet og ressursutnyttelse i bygg- og anleggsprosjekter.",
        "skills": "Ferdigheter | Studenten: | kan anvende nødvendige styringsdokumenter, herunder BEP- og BIM-manualer for praktisk digitalt samarbeid i koordinering | kan anvende BIM-verktøy etter definert formål | kan anvende relevante bransjeformater for modellering av faglig innhold | kan finne informasjon og fagstoff som er relevant for en yrkesfaglig problemstilling | kan anvende programvare for å generere relevante tegninger og dokumentasjon ut fra digitale modeller | kan anvende modellering- og samhandlingsprogram til tverrfaglig kollisjonskontroll, verifisering av resultat og gjennomførbart, i forhold til formål og problemstilling | kan anvende tekstbehandlingsprogram til å skrive visuell rapport som egner seg for presentasjon av arbeidet med individuell problemstilling | kan anvende bransje-relatert modell standard og andre relevante åpne formater til utveksling av informasjon på tvers av ulik programvare og kan nyttiggjøre seg informasjonen i flere ulike BIM-programmer | kan kartlegge en situasjon og identifisere faglige problemstillinger og behov for iverksetting av tiltak knyttet til strukturert 3D-modellering, IFC og modellkontroll, samt modellbasert tegningsforståelse og dokumentasjon for å sikre effektiv samhandling og datakvalitet i prosjekter.",
        "competence": "Generell kompetanse | Studenten: | har forståelse for og tar hensyn til samspillet mellom de ulike aktørene | kan bygge relasjoner med aktører og andre BIM-teknikere på tvers av fag | kan utføre arbeidet etter utvalgte målgruppers behov ved å utvikle arbeidsmetoder knyttet til bruk av BIM-programvare, verktøy og prosesser. | kan utføre modelleringsarbeid knyttet til formål og problemstilling | har utviklet en etisk grunnholdning i utøvelsen av yrket, og anvender denne i kontrollarbeid med BIM-programmer for å sikre kvalitet og åpenhet i samhandlingsprosesser. | har forståelse for hvordan BIM kan bidra til færre feil, mindre svinn og økt bærekraft"
      }
    },
    {
      "id": "01TI54A",
      "title": "Prosess, samhandling og informasjonsflyt",
      "credits": 28,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TI54A/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | forstår hvordan BIM-prosesser og informasjon i modell kan endre valgene av løsninger for å oppnå mere bærekraftige bygg og ivareta bruk inn mot FDVU | har kunnskap om bruk av kunstig intelligens (AI) i BIM for BAE næringen | har kunnskap om verktøy som forenkler og automatiserer prosesser | har kunnskap om programteknisk og BIM-faglig stoff på norsk og engelsk | har innsikt i informasjonsinnhenting på nett og har kunnskap om preaksepterte løsninger som oppfyller funksjonskrav i bygg- og anleggsprosjekter | har kunnskap om krav til detaljeringsnivå og kvalitet i digitale modeller samt har kjennskap til relevante norske standarder og bransjenormer | har kunnskap om konseptet åpenBIM, hvorav IFC og BCF er de viktigste felles filformatene for samhandling i BIM-prosesser | har kunnskap om tallbehandling relatert til de programmene og de problemstillingene som er aktuelle i en arbeidssituasjon | har kunnskap om plattformer og tekniske løsninger for kommunikasjon mellom byggeplass og digital modell | har kunnskap om byggebransjen og kjenner til samspillet mellom de ulike aktørene i bransjen gjennom bruk av for eksempel Lean og VDC | har kunnskap til ulike entrepriseformer/anbudskontrakter og svakheter og styrker ved dem i en gjennomføringsmodell | forstår oppbygging og hensikt med BIM-manualer og styringsdokumenter i en samhandlingsprosess | har kunnskap om håndtering av krav til informasjon på et organisasjons-, eiendels- og prosjekt-nivå | har kunnskap om filhåndtering og –navngivning, kjenner til risikovurderinger i forhold til tap av data samt kan identifisere de ulike filtypene som anvendes i arbeid med BIM | kan oppdatere sin yrkesfaglige kunnskap om bygningsinformasjonsmodellering",
        "skills": "Ferdigheter | Studenten: | kan anvende, håndtere og vedlikeholde relevant teknisk utstyr i en BIM-teknikers hverdag, på egen arbeidsplass, møteareal og andre samhandlingsområder | kan anvende forskjellige tekstbehandlingsprogrammer, digitale ordbøker/oppslagsverk og enkle skjerm- og bildebehandlings-programmer for raskt å skrive visuelle bruksanvisninger og visuelle rapporter til bruk i effektiv kommunikasjon med både byggeplass og andre aktører i en samhandlingsprosess | kan anvende kommunikasjon- og samhandlingsplattformer for planlegging, deling av innhold, aktiviteter, møtevirksomhet, samskrivning og fildeling | kan finne informasjon og dele kunnskap og fagstoff ved anvendelse av nettbaserte kunnskapssystemer, søkemotorer, nettforum, faglige nettverk og bransjeorganisasjoner | kan anvende BIM-programmer for å overføre filer fra BIM-programmene til andre programmer, med vekt på forarbeid/tilrettelegging i det programmet det eksporteres fra og etterarbeid/tilrettelegging i det programmet det importeres til | kan anvende relevante BIM-verktøy i en prosess på en rasjonell måte for problemløsning i prosjekter, som riktig oppstart, strukturert modellering og informasjonsuttak | kan anvende informasjonskilder som tabeller, preaksepterte løsninger, oppslagsverk, aktuelle norske standarder og bransjenormer som er relevant for en BIM-faglig problemstilling | kan anvende programmer for tallbehandling for å analysere informasjon, målinger og effekter mellom fag, samt behandle lister fra modelleringsprogrammer | Kan anvende verktøy for fremdriftsplanlegging, visualisering av framdrift og avhengigheter | kan anvende styringsdokumenter, herunder BIM-gjennomføringsplan (BEP), for praktisk digitalt samarbeid i koordinering av en byggeprosess | kan anvende visualiseringsverktøy for illustrasjoner og -presentasjoner | kan anvende skjermbilde for å dokumentere arbeid | kan anvende presentasjonsprogrammer og holde faglige presentasjoner | kan anvende maskinvalidering knyttet til BIM og BIM prosesser | kan anvende kunstig intelligens (AI) innenfor fagrelaterte oppgaver i prosjekter | kan kartlegge en situasjon og identifisere faglige problemstillinger og behov for iverksetting av tiltak knyttet til struktur og databehandling, digital kommunikasjon, tallbehandling, samt samhandling og koordinering i prosjekter.",
        "competence": "Generell kompetanse | Studenten: | kan utvikle metoder for digital samhandling og modellering og er i stand til å oppdatere sin kunnskap innenfor BIM ved hjelp av egenlæring og samarbeid med tverrfaglige fagmiljøer | kan utføre arbeid med dokumentasjon, tallbehandling og mengdeuttak. | kan utvikle og oppdatere egen kunnskap om BIM-programvare, - begreper og -verktøy | kan utføre relevant arbeid med å utforme og kontrollere BIM-modeller etter de ulike målgruppenes behov og er i stand til å definere hva som er det etterspurte detaljeringsnivå | har forståelse for utviklingen av BIM-modeller i samspillet mellom de ulike aktørene i bygg- og anleggsbransjen | kan utføre modellering og kontroll av digitale modeller i en prosjekterings-/byggeprosess etter kundens kvalitetskrav. | har utviklet holdninger og respekt for andre aktører som benyttes i situasjoner der teori og praksis møtes | har utviklet en etisk grunnholdning i sin framferd mot medarbeidere, kunder og samarbeidspartnere på grunnlag av gjensidig samarbeid og tillit som BIM-tekniker | kan bygge relasjoner med aktører i bransjen, kunder og andre BIM-teknikere på tvers av fag og bedrifter. | kan bygge relasjoner med andre fagdisipliner for å utvikle sine tverrfaglige kunnskaper og ferdigheter"
      }
    },
    {
      "id": "01TI54B",
      "title": "Bygningsinformasjonsmodellering- KONSTRUKSJON",
      "credits": 28,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TI54B/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | Har kunnskap om BIM-programmer som er i bruk i bransjen og kan identifisere programmenes egenskaper. | Har kunnskap om fagrelaterte tegninger innen bygg- og anleggssektoren | Har kunnskap til de ulike tegningsgrunnlagene som er vanlige ved prosjekteringen av både større og mindre prosjekter, samt identifisere kravene til tegningsgrunnlag ved de forskjellige fasene i prosjektet | har kunnskap om oppbygning av modell, struktur og klassifiseringer etter bransjerelaterte standarder og andre sentrale formater | har kunnskap om hvordan etablere og implementere målinger og effekter (metrics) ved bruk av digitale modeller | har kunnskap om implementering av styringsdokumenter i modeller for bygg- eller anleggsprosjekter | har kunnskap om byggebransjen og til samspillet med behovet for BIM-leveranse mellom aktørene i bygg- og anleggsbransjen i prosjektets livsløp. | har kunnskap om kartdatum og koordinatsystemer brukt i Norge av aktører i bygg- og anleggsbransjen | har kunnskap om georeferering for å starte et BIM-prosjekt | har kunnskap om løsningene for utvidet virkelighet (XR) | har innsikt i forskrifter, normer, norske standarder og preaksepterte løsninger for bygg- og anleggsbransjen | har innsikt i kontraktsformer, styrende dokumenter, håndbøker og manualer | har kunnskap om verktøy som forenkler og automatiserer prosesser | har kunnskap til geografisk informasjonssystemer (GIS), og forholdet mellom BIM/GIS | har bransjekunnskap og kjennskap til yrkesfeltet, og kjenner til hvordan 3D-modellering, modellbasert dokumentasjon og IFC brukes i prosjekter for å sikre effektiv informasjonsflyt og samhandling. | kan oppdatere sin yrkesfaglige kunnskap ved å ta i bruk nye verktøy og metoder for 3D-modellering, modellkontroll og digital dokumentasjon i tråd med utviklingen i bransjen. | forstår egen bransjes/yrkes betydning i et samfunns- og verdiskapingsperspektiv, og ser hvordan modellbaserte arbeidsmetoder som IFC og tegningsforståelse bidrar til kvalitet, effektivitet og bærekraft i byggeprosesser.",
        "skills": "Ferdigheter | Studenten: | kan anvende løsninger til å fremstille visuelle dashbords av etablerte målinger og effekter fra modell | kan finne informasjon og fagstoff som er relevant for en BIM- og yrkesfaglig problemstilling | kan anvende ulike BIM-programmer for bygningskonstruksjoner | kan anvende relevante bransjeformater for modellering av faglig innhold | kan anvende forskjellige programvare for å generere relevante tegninger, mengdeuttak og dokumentasjon ut fra modeller | kan anvende analyseverktøy for kontroll med bruk av BIM-modell | kan anvende automatisering og parametrisering | kan anvende kartdatum og koordinatsystemer i modelleringsprogram | kan kartlegge dataflyt mellom programvare og behovet for ulike filformater til forskjellige formål | kan anvende ulike formater fra datafangst, bestillingstjenester og andre leverandører, til etablering av grunnlagsdata og/eller videre bearbeidelse | kan anvende landmålingsinstrumenter for datafangst og høsting med etterarbeid gjennom bearbeidelse og prosessering til bruk i ulike formål | kan anvende digitale tallbehandlingsprogram og tekstbehandlere for bearbeidelse, beregninger og dokumentasjon | kan anvende sin BIM-faglige kunnskap for å koordinere digital modellering og tverrfaglig modellkontroll i et bygg- og anleggsprosjekt | kan anvende modellering- og samhandlingsprogram til kvalitetssikring av mengder, klassifisering, regelsjekk av egen fagmodell | kan anvende modellering- og samhandlingsprogram til tverrfaglig kollisjonskontroll, verifisering av funn og byggbarhet | kan anvende bransjerelatert modell standard og andre relevante formater til utveksling av informasjon på tvers av ulik programvare og kan nyttiggjøre seg informasjonen i flere ulike BIM-programmer",
        "competence": "Generell kompetanse | Studenten: | kan utvikle sin BIM-kompetanse, samt utvikle metodikk for å lære seg nye BIM-programvarer og -prosesser og identifisere programmenes egenskaper | kan utføre modellerings- og kontrollarbeid ved å anvende flere ulike BIM-programmer for bygningskonstruksjoner | har utviklet kompetanse og anvendelse av bransje-relevante programmer for kvalitetskontroll og modellsjekking innenfor modellering av bygninger og tekniske installasjoner. | har utviklet etisk holdning og forståelse om kunstig intelligens (KI), og bruk av kunstig intelligens i BIM-programvare, -verktøy og -metoder. | kan utføre arbeidet med resultatdata og tilhørende dokumentasjon ved hjelp av en 3D-modell både i native format og i åpen-BIM-konseptet etter behov og for sin fagdisiplin. | har forståelse for yrkes- og bransjeetiske prinsipper knyttet til bruk av 3D-modellering, bearbeiding av informasjon, IFC og modellkontroll, samt modellbasert tegningsforståelse og dokumentasjon i tverrfaglige prosjekter. | kan bygge relasjoner med fagfeller og på tvers av fag, samt med eksterne målgrupper, gjennom samarbeid om 3D-modellering, bearbeiding av informasjon, IFC-basert modellkontroll og modellbasert tegningsforståelse og dokumentasjon."
      }
    },
    {
      "id": "01TI54C",
      "title": "Avsluttende tverrfaglig prosjekt",
      "credits": 4,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TI54C/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | har kunnskap om en selvvalgt problemstilling | innenfor BIM-utdanningens overordnende læringsutbyttebeskrivelser | har bransjekunnskap til å lage en problemstilling for samspillet mellom teori og praksis | har kunnskap om georeferering som en nødvendighet for å starte et BIM-prosjekt | har kunnskap om oppbygging av styringsdokumenter for digital samhandling gjennom blant annet CDE | har kunnskap om samspillet mellom aktørene | har kunnskap om filhåndtering og –navngivning, kjenner til risikovurderinger i forhold til tap av data samt kan identifisere de ulike filtypene som anvendes i arbeid med BIM | har kunnskap om verktøy som forenkler og automatiserer prosesser. | kan vurdere eget arbeid i forhold til normer og krav | har innsikt i relevant regelverk, standarder, avtaler og krav til kvalitet knyttet til strukturert 3D-modellering, bruk av IFC, modellkontroll og modellbasert dokumentasjon i koordinering og samhandling. | har bransjekunnskap og kjennskap til yrkesfeltet, og forstår hvordan databehandling, modellkontroll og 3D-modellering benyttes for å sikre kvalitet og effektiv informasjonsflyt i prosjekter. | kan oppdatere sin yrkesfaglige kunnskap ved å tilegne seg nye metoder og digitale verktøy for modellkontroll, databehandling og modellbasert koordinering i henhold til bransjeutviklingen. | forstår egen bransjes/yrkes betydning i et samfunns- og verdiskapingsperspektiv, og ser hvordan bruk av IFC, strukturert 3D-modellering og effektiv dokumentasjon bidrar til bærekraft, kvalitet og ressursutnyttelse i bygg- og anleggsprosjekter.",
        "skills": "Ferdigheter | Studenten: | kan anvende nødvendige styringsdokumenter, herunder BEP- og BIM-manualer for praktisk digitalt samarbeid i koordinering | kan anvende BIM-verktøy etter definert formål | kan anvende relevante bransjeformater for modellering av faglig innhold | kan finne informasjon og fagstoff som er relevant for en yrkesfaglig problemstilling | kan anvende programvare for å generere relevante tegninger og dokumentasjon ut fra digitale modeller | kan anvende modellering- og samhandlingsprogram til tverrfaglig kollisjonskontroll, verifisering av resultat og gjennomførbart, i forhold til formål og problemstilling | kan anvende tekstbehandlingsprogram til å skrive visuell rapport som egner seg for presentasjon av arbeidet med individuell problemstilling | kan anvende bransje-relatert modell standard og andre relevante åpne formater til utveksling av informasjon på tvers av ulik programvare og kan nyttiggjøre seg informasjonen i flere ulike BIM-programmer | kan kartlegge en situasjon og identifisere faglige problemstillinger og behov for iverksetting av tiltak knyttet til strukturert 3D-modellering, IFC og modellkontroll, samt modellbasert tegningsforståelse og dokumentasjon for å sikre effektiv samhandling og datakvalitet i prosjekter.",
        "competence": "Generell kompetanse | Studenten: | har forståelse for og tar hensyn til samspillet mellom de ulike aktørene | kan bygge relasjoner med aktører og andre BIM-teknikere på tvers av fag | kan utføre arbeidet etter utvalgte målgruppers behov ved å utvikle arbeidsmetoder knyttet til bruk av BIM-programvare, verktøy og prosesser. | kan utføre modelleringsarbeid knyttet til formål og problemstilling | har utviklet en etisk grunnholdning i utøvelsen av yrket, og anvender denne i kontrollarbeid med BIM-programmer for å sikre kvalitet og åpenhet i samhandlingsprosesser. | har forståelse for hvordan BIM kan bidra til færre feil, mindre svinn og økt bærekraft"
      }
    }
  ]
}