{
  "study_programs": [
    {
      "id": "Bygg - 120",
      "title": "Bygg",
      "description": "Bygg er fagskoleutdanningen for deg som vil ta steget fra fagarbeider til leder i byggebransjen. Du lærer å planlegge, prosjektere og lede byggeprosjekter med fokus på moderne byggteknikk, bærekraft og digital samhandling (BIM).",
      "study_location": "Fredrikstad (Deltid 3 år) | Kongsberg (Samlingsbasert 3 år) | Kongsberg (Heltid 2 år) | Fredrikstad (Heltid 2 år)",
      "credits": 120,
      "language": "Norsk",
      "level": "Høyere fagskolegrad",
      "why_choose": "Bygg- og anleggsbransjen er i rask endring. Nye materialer, digitale verktøy og krav til bærekraft gjør at næringen trenger fagfolk som forstår hele byggeprosessen – fra planlegging til ferdig bygg.\nMed fagskoleutdanningen i bygg får du kompetansen som gjør deg trygg i rollen som leder eller mellomleder i prosjekter. Du lærer å planlegge, beregne og koordinere både produksjon, innkjøp og personressurser, samtidig som du får innsikt i bygningsfysikk, konstruksjon og moderne byggteknikk.\nStudiet gir deg en solid kombinasjon av praksis og teori. Du utvikler forståelse for forvaltning, drift og vedlikehold av bygg, og lærer å bruke digitale verktøy som BIM for å sikre kvalitet og samhandling. Samtidig styrker du dine evner til å kommunisere, samarbeide og ta ansvar i prosjekter som krever både faglig dyktighet og godt lederskap.\nUtdanningen passer for deg som ønsker å bygge videre på fagbrev eller erfaring fra bygge- og anleggsbransjen – og som vil ta neste steg i karrieren. Du får oppdatert kompetanse som gjør deg ettertraktet i et arbeidsliv som stadig stiller høyere krav til fagkunnskap, planlegging og bærekraftige løsninger.",
      "what_learn": "I denne stedbaserte deltidsutdanningen lærer du å planlegge, prosjektere og lede byggeprosjekter ved siden av jobb. Du får bred faglig innsikt i byggteknikk, konstruksjon, prosjektstyring og bruk av digitale verktøy – og lærer å anvende kunnskapen direkte i arbeidshverdagen.\nStudiet gir deg lederkompetanse som gjør deg trygg i rollen som byggeleder, prosjektleder eller arbeidsleder. Du lærer å ta faglige og økonomiske beslutninger, sikre kvalitet og fremdrift og bidra til bærekraftige løsninger på byggeplassen.\nUndervisningen kombinerer teori, gruppearbeid og praktiske oppgaver med erfaringsdeling mellom studenter som allerede jobber i bransjen.Studiet består av ni emner og avsluttes med et hovedprosjekt som tar utgangspunkt i virkelige byggfaglige problemstillinger. | Klikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger Deltidsløpet er stedbasert over 3 år (6 semestre). Undervisningen organiseres i faste undervisningsdager gjennom semesteret, med klasseromsundervisning, veiledning og prosjektarbeid. Detaljert plan publiseres på studentsiden for Fredrikstad før oppstart.",
      "police_certificate": null,
      "career_opportunities": "Med en høyere fagskolegrad i bygg får du kompetansen til å ta større ansvar i byggeprosjekter og bidra til bærekraftig utvikling i bransjen. Du kan lede planlegging, prosjektering og produksjon, og sikre at arbeid utføres i tråd med lover, standarder og kvalitetskrav. Mange tidligere studenter går inn i roller som byggeleder, anleggsleder, prosjektleder, byggeplassleder eller arbeidsleder i entreprenørfirmaer, kommuner og eiendomsforvaltning. Andre arbeider som kontrollingeniør, oppmålingsingeniør, byggesaksbehandler, avdelingsingeniør, konstruktør, SHA-ansvarlig, driftsingeniør eller salgsingeniør. Utdanningen gir deg også grunnlag for å undervise i byggfag eller delta i utviklingsprosjekter der ny teknologi og digitale løsninger former fremtidens byggebransje. Du blir en fagperson som kan kombinere praktisk erfaring med ledelse, kvalitet og innovasjon i et yrke som stadig er i endring.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/bygg-og-anlegg/bygg"
    }
  ],
  "courses": [
    {
      "id": "01TX00A EITKFRE",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A-EITKFRE/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om realfag som redskap innen sitt fagområde har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes for å utføre nødvendige beregninger, dimensjoneringer, overslag og annen problemløsning med utgangspunkt i relevante praktiske situasjoner og problemstillinger innen fagretningen. har kunnskap om matematiske og fysiske lover, formler og symboler som er relevante for fagretningen kan vurdere eget arbeid i forhold til matematiske og fysiske lover har bransjekunnskap og kjennskap til yrkesfeltet en har valgt og om hvilken betydning realfaglige redskap har for fagretningen kan oppdatere sine kunnskaper innen realfag kjenner til matematikkens og fysikkens historie, tradisjoner, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter innen realfag",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av regneoperasjoner som anvendes for fagspesifikke problemstillinger kan gjøre rede for digitale verktøy som anvendes til problemløsninger innen realfaglige tema kan reflektere over egen faglig utøvelse og vurdere resultater av beregninger og justere denne under veiledning kan finne og henvise til informasjon og fagstoff i formelsamlinger og fagbøker og vurdere relevansen for en realfaglig problemstilling",
        "competence": "Generell kompetanse Studenten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger har innsikt i rekkevidde og begrensninger for de metoder som anvendes kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B EITKFRE",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B-EITKFRE/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om grunnleggende kommunikasjonsteori kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde har kunnskap om sentrale retoriske begreper og virkemidler har kunnskap om kildebruk etter standard for høyere utdanning kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter har kjennskap til prinsipper for tekstorganisering og -produksjon har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne",
        "skills": "Ferdigheter Studenten kan reflektere over møter mellom forskjellige arbeidslivskulturer kan bruke relevante begreper for å analysere egen og andres tekst kan reflektere over og revidere tekster kan reflektere over hvordan retorikk benyttes kan bygge opp saklig argumentasjon og bruke retoriske apellformer kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig kan reflektere over egen kommunikasjon i profesjonell sammenheng kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og god tekstbinding kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse Studenten kan kommunisere hensiktsmessig for å bidra til en inkluderende organisasjonskultur kan tilpasse språk og argumentasjon etter mål og mottaker kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting behersker relevante kommunikasjonsverktøy kan kommunisere gjennom relevante tekster og kanaler kan samarbeide om tekstproduksjon"
      }
    },
    {
      "id": "01TX00C EITKFRE",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C-EITKFRE/2025-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak har kunnskap om lønnskostnader har kunnskaper om mål, tiltak og handlingsplaner • kjenner til emnets aktuelle lover og avtaler",
        "skills": "Ferdigheter Studenten kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler kan vurdere bedriftens betalingsevne og kapitalbehov kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler kan foreta en helhetlig prisvurdering og utarbeide kalkyler kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel kan identifisere, analysere og utvikle medarbeidernes kompetanse • kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse Studenten kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid kan kommunisere internt og eksternt og benytte digitale verktøy til dette. kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "00TB00D EITKBYFH24",
      "title": "Samordnet byggeprosess",
      "credits": 20,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00TB00D-EITKBYFH24/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om begreper, teorier, modeller og prosesser og verktøy som anvendes innenfor en samordnet byggeprosess har kunnskap om bruk av relevant IT-verktøy i en byggeprosess og utarbeide enkle bransjerelaterte tegninger ved hjelp av et relevant DAK-verktøy kan beskrive krefter som virker på enkle konstruksjonselementer og forklare hvilke belastninger dette vil gi på de ulike deler og sammenføyninger har kunnskap om byggeprosesser for utendørs anlegg og konstruksjoner og har innsikt i tekniske standarder og krav har kunnskap om byggematerialenes oppbygning, karakteristiske egenskaper og bruksområde har kunnskap om bygg-, anleggs- og VVS-tekniske tegninger (både digitale og papirutgaver) har kunnskap om teori, data og utstyr til bransjerelevant geomatikk har kunnskap om energieffektive bygningskonsepter med lav miljøbelastning og godt inneklima har kunnskap om miljøutfordringer knyttet til både det ytre miljø, inneklima, byggematerialer, røranlegg (VA), utendørs konstruksjoner og bearbeiding, og kjenner til vanlig brukt utstyr innenfor bygg og anlegg har kunnskap om lydforhold i bygninger har kunnskaper om branntekniske forutsetninger og brannstrategier i bygninger har kunnskap om krav og sertifiseringsordninger for byggematerialer kan vurdere nøyaktigheten på kart og kartbaser kan vurdere eget arbeid i forhold til gjeldende regelverk, som bygningslovgivning, forskrifter, tekniske standarder, avtaler og krav til kvalitet kan vurdere energitekniske løsninger på byggkonstruksjoner og tekniske installasjoner har bransjekunnskap, kjennskap til gjennomføring av byggeprosesser, hvilke aktører som inngår og deres roller kan oppdatere sin yrkesfaglige kunnskap har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter Studenten kan gjøre rede for faglige valg, utstyr og metoder i en byggeprosess kan gjøre rede for krefter i konstruksjonselementer og kan utføre enkle statiske beregninger kan gjøre rede for krav i standarder og sertifiseringer kan reflektere over brann- og lydtekniske forhold i byggeprosjekter samt prosjektenes innvirkning på miljø og samfunn kan beregne koordinater og stikningsdata på objekter, både med tanke på innmåling og utsetting kan forholde seg til høyder, koter og nivåer på en bygge- og anleggsplass kan finne og henvise til relevant fagstoff og utføre enkle, termodynamiske og energitekniske beregninger, relatert til bygg og anleggsbransjen og aktuelle arbeidsoppgaver",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre bygg- og anleggsprosjekter i alle faser av et bygg eller anlegg, som deltaker eller leder i gruppe i tråd med etiske krav om bærekraftige bygg og anlegg og gjeldende retningslinjer kan utføre arbeidet etter kunders behov og myndigheters krav i en samordnet byggeprosess kan bygge relasjoner med fagfeller innen bygg- og anleggsbransjen og på tvers av fag, samt med byggherrer og myndigheter for å utvide egen kunnskap kan utveksle synspunkter med andre med bakgrunn innenfor bygg- og anleggsbransjen og delta i diskusjoner om optimale løsninger på utfordrende bygg- og anleggsprosjekter kan bidra til organisasjonsutvikling ved å følge med på ny teknologi innen bygg- og anleggsfaget"
      }
    },
    {
      "id": "00TB00E EITKBYFH24",
      "title": "Byggesaken",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00TB00E-EITKBYFH24/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om begreper, prosesser og verktøy som benyttes i alle faser av byggesaker, fra søknadsprosedyrer til kontraktsskriving og oppfølging av HMS har kunnskap om aktuelle krav til godkjennings-, sertifiserings- og kontrollordninger har kunnskap om innholdet i «40-timers» verneombuds kurs dokumentert med eget kursbevis har gjennomført førstehjelps- og LHR kurs har kunnskap om aktuelle lover, forskrifter, vedtekter og standarder innen byggesaker har kunnskap om anbudsprosessen og kontraktsinngåelse har kunnskap om kvalitet og HMS som en viktig del av all prosjektering, planlegging og utførelse innen byggesaker har kunnskap om registrering og oppfølging av avvik i en byggesak kan vurdere eget arbeid i forhold til gjeldende normer og krav har kunnskap om byggebransjen og kjennskap til søknadsprosesser, anbudsrunder og kontraktsskriving og om hvordan bransjen forholder seg til kvalitetsstyring og HMS kan oppdatere sin kunnskap innen byggesaker ved å følge med på nye krav og retningslinjer i byggebransjen",
        "skills": "Ferdigheter Studenten kan gjøre rede for søknadsprosedyrer, anbudsprosesser og kontraktsinngåelse i en byggesak kan gjøre rede for krav i standarder og sertifiseringer som angår kvalitet og HMS i byggesaker kan utøve funksjon som verneombud kan reflektere over egen faglig utøvelse i byggesaker og justere denne under veiledning kan finne og henvise til informasjon og fagstoff angående byggesaker og aktuelle arbeidsoppgaver",
        "competence": "Generell kompetanse Studenten kan planlegge og utarbeide søknad om byggetillatelse for aktuelle tiltaksklasser alene og som deltaker i gruppe i tråd med etiske krav, aktuelle lover, vedtekter, standarder og forskrifter kan planlegge og følge opp anbud, tilbud, kontrakter, HMS/KS-krav i en byggesak alene og som deltaker i gruppe i tråd med etiske krav og retningslinjer for å ivareta kontraktsmessige forpliktelser og rettigheter kan utarbeide og følge opp en KS/SHA-plan etter godkjennings-, sertifiserings- og kontrollordninger kan utføre arbeidet etter kunders behov og myndigheters krav i en byggesak kan bygge relasjoner med fagfeller innen bygg- og anleggsbransjen og på tvers av fag, samt med byggherrer og myndigheter for å utvide egen kunnskap angående byggesaker kan utveksle synspunkter med andre med bakgrunn innenfor bygg- og anleggsbransjen og delta i diskusjoner om utfordringer i byggesaker kan bidra til organisasjonsutvikling ved å følge med på nye krav og retningslinjer i byggesaker"
      }
    },
    {
      "id": "00TB01F EITKBYFH24",
      "title": "Konstruksjon bygg m/ faglig ledelse",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00TB01F-EITKBYFH24/2025-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om konstruksjonsløsninger på bygg i ulike materialer, som tre, stål og betong har kunnskap om hvordan en beregner laster på bygningskonstruksjoner har kunnskap om dimensjonering av enkle betongdekker, bjelker og søyler har kunnskap om aktuelle prøvemetoder har kunnskap om forskrifter for bærekonstruksjoner og brannkrav har kunnskap om gjeldende Euronormer kan vurdere konstruksjonsløsningen i forhold til gjeldende standarder for last, materialer og dimensjonering kan vurdere brannbeskyttelse i forhold til brannkrav som gjelder for bygningsdeler og bærekonstruksjoner har kunnskap om bransjen som driver med konstruksjon av bygg kan oppdatere sin kunnskap om konstruksjoner av bygg kjenner til byggkonstruksjonsbransjens historie, tradisjon, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter innen konstruksjon av bygg",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av konstruksjonsløsning ut fra tekniske og økonomiske forhold kan gjøre rede for valg av materialkvalitet til ulike konstruksjoner kan gjøre rede for hvordan en dimensjonerer konstruksjoner i tre og stål etter gjeldende standarder i tiltaksklasse 2 kan gjøre rede for hvordan man leser og tegner enkle betong- og armeringstegninger kan reflektere over hvilke løsninger som er tatt for konstruksjoner på bygg og justere disse under veiledning kan finne og henvise til informasjon og fagstoff om konstruksjoner av bygg og vurdere relevansen for et byggeprosjekt kan kartlegge konstruksjonen av et bygg og identifisere faglige problemstillinger og behov for iverksetting av tiltak",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre konstruksjonsarbeid for byggverk som deltaker eller leder av gruppe og i tråd med krav og standarder som gjelder for helse, miljø og sikkerhet kan utføre et konstruksjonsarbeid etter kundens ønsker og myndigheters krav kan bygge relasjoner med fagfeller innen konstruksjon av bygg og på tvers av fag som designere og ingeniører, samt med eksterne målgrupper kan utveksle synspunkter med andre med bakgrunn innenfor konstruksjon av bygg og delta i diskusjoner om sikker, økonomisk og miljøvennlig praksis kan bidra til organisasjonsutvikling gjennom proaktiv rapportering om eventuelle hendelser"
      }
    },
    {
      "id": "00TB01G EITKBYF24",
      "title": "Drift/Produksjon bygg m/faglig ledelse",
      "credits": 20,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00TB01G-EITKBYF24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om begreper, prosesser og verktøy som benyttes for drift og produksjon av bygg har kunnskap om metoder for å undersøke grunnens bæreevne og om hvilke fundamenter som kan benyttes har kunnskap om hvordan en kan beregne jordtrykk mot grunnmurer og enkle støttemurer har kunnskap om hvordan masse forflyttes på en sikker og effektiv måte har kunnskap om utarbeidelse av tekniske beskrivelser av bygg med grunnlag i tegninger og aktuelle Norske standarder har kunnskap om ombygging og restaurering av bygg med tanke på praktiske, estetiske, økonomiske og miljømessige krav, samt lovverk, reguleringsplaner og planer for kommunen har kunnskap om hvordan en bygge- og anleggsplass ledes og driftes, som hvordan en leder et byggemøte og hvordan en endringshåndtering gjennomføres kan vurdere om bygningsproduksjon og drift holder mål i forhold til lovverk, byggeforskrifter, HMS, bransjestandarder, avtaleverk og krav til dokumentasjon har kunnskap om bransjen innen drift og produksjon av bygg kan oppdatere sin kunnskap om drift og produksjon av bygg kjenner til byggverks historie, byggetradisjoner, byggeskikker og byggekulturen i samfunnet har innsikt i egne utviklingsmuligheter innen drift og produksjon av bygg har kunnskap om begreper, prosesser og verktøy som benyttes for stikking og innmåling på bygg og anlegg har kunnskap om praktisk utførelse av bygg- og anleggsstikking og oppbygging av et fastmerkenett",
        "skills": "Ferdigheter Studenten: kan gjøre rede for hvordan bygg produseres og driftes ut fra tekniske, estetiske og økonomiske forhold kan gjøre rede for kvaliteten på en bygningsmasse kan gjøre rede for dimensjoneringsgrunnlag for bygg, veityper og veiklasser kan reflektere over hvilke løsninger som er tatt for drift og produksjon av bygg og justere disse under veiledning kan finne og henvise til informasjon og fagstoff om drift og produksjon av bygg og vurdere relevansen for et byggeprosjekt kan kartlegge et bygg og identifisere behov for restaurering og ombygging etter byggeskikker og normer kan foreta enkel innmåling og utstikking med riktig valgt utstyr og ivareta byggets må og plassering, enten som leder eller som stikker.",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre et byggeprosjekt med tanke på drift og produksjon av bygg som deltaker eller leder av gruppe og i tråd med estetiske, økonomiske og miljømessige krav og retningslinjer kan planlegge og gjennomføre prosjekter som utbygging, ombygging og vedlikeholdsarbeid av bygg som deltaker eller leder av gruppe og i tråd med planer, tegninger og tekniske beskrivelser kan produsere eller drifte et bygg etter byggherrens ønsker og myndigheters krav kan bygge relasjoner med fagfeller innen produksjon og drift av bygg og på tvers av fag som bygningsantikvarer og arkitekter, samt med eksterne målgrupper kan utveksle synspunkter på kvalitet på bygningsmasse og driftsmessige utfordringer med andre med bakgrunn innenfor drift, vedlikehold og produksjon av bygg og delta i diskusjoner om god praksis for kommunen kan bidra til organisasjonsutvikling gjennom proaktiv rapportering om eventuelle hendelser"
      }
    },
    {
      "id": "01TB01H EITKBYFH24",
      "title": "Lokal tilpassing / spesialisering med faglig ledelse: Bruk av digitale verktøy",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01H-EITKBYFH24/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om utforming av prosjektorganisasjoner har kunnskap om fremdriftsplanlegging har kunnskap om vurdering av lønnsomhet i byggeprosjekter har kunnskap om ressursplanlegging i bygningsproduksjonen har kunnskap om IFC-standarden har kunnskap om kollisjonstesting av fremføringer i bygg har kunnskap om digitale modeller har kunnskap om veg og tunellmodeller har kunnskap om emner i kjemi- og miljøfag",
        "skills": "Ferdigheter Studenten kan gjøre rede for organisering av prosjekt kan gjøre rede for driftsoppfølging av bygg i produksjon kan gjøre rede utveksling av filer mellom ulike programmer kan gjøre rede for digital dataflyt kan reflektere over presentasjoner av måleresultater kan finne og henvise til informasjon og fagstoff om konstruksjoner av bygg og vurdere relevansen for et byggeprosjekt kan kartlegge konstruksjonen av et bygg og identifisere faglige problemstillinger og behov for iverksetting av tiltak kan kartlegge en situasjon som har med miljø og gjøre og identifisere problemstillinger innenfor tekniske fagområder og iverksette tiltak kan georeferere digitale bygningstegninger kan utføre enkel digital masseberegning",
        "competence": "Generell kompetanse Studenten kan utføre digital planlegging av utførelse av byggeprosjekter kan utføre 3D-modellering av bygg med justering av tegninger og dokumentasjon kan planlegge og utføre miljøtiltak for å sikre en miljømessig forsvarlig drift, alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer"
      }
    },
    {
      "id": "01TX00H",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om hvordan man skriver en prosjektrapport har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt har kunnskap om sammenhengen mellom teori og praksis kan vurdere eget prosjekt i forhold til gjeldende normer og krav kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av tema for hovedprosjekt kan identifisere, kartlegge og vurdere en faglig problemstilling kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat kan skrive en prosjektrapport kan drøfte sammenhengen mellom teori og praksis kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    },
    {
      "id": "01TX00A",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om realfag som redskap innen sitt fagområde. har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes kan utføre beregninger, overslag og problemløsning relevant for dimensjoneringer og andre problemstillinger innen studieretningen kan vurdere eget arbeid i henhold til matematiske og fysiske lover kan utvide sine kunnskaper og har innsikt i egne utviklingsmuligheter innen realfag. kjenner til matematikkens og fysikkens egenart og plass i samfunnet",
        "skills": "Ferdigheter Studenten: kan gjøre rede for valg av regnemetode som anvendes for å løse faglige problemer kan gjøre rede for valg av digitale verktøy som anvendes til problemløsning innen realfaglige tema kan anvende digitale hjelpemidler til å løse matematiske problemer kan vurdere resultater av beregninger, samt reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til relevant informasjon og fagstoff i formelsamlinger, tabeller og fagbøker kan kartlegge en situasjon og identifisere realfaglige problemstillinger har kjennskap til og kan anvende grunnleggende fysiske lover og fysikkens metodikk kan tolke og anvende modeller som benyttes innen matematikk og fysikk",
        "competence": "Generell kompetanse Studenten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger har innsikt i rekkevidde og begrensninger for de metoder som anvendes kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om grunnleggende kommunikasjonsteori kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde har kunnskap om sentrale retoriske begreper og virkemidler har kunnskap om kildebruk og referanseteknikk etter standard for høyere utdanning kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter har kjennskap til hvordan man organiserer og produserer tekst har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne har kunnskap om språket som verktøy for god kommunikasjon og kjenner til norsk og engelsk fagterminologi innen sitt fagområde har kunnskap om grammatikk, sjangerforståelse samt språklige, stilistiske og grafiske virkemidler i tekst.",
        "skills": "Ferdigheter Kandidaten: kan reflektere over møter mellom forskjellige arbeidslivskulturer kan bruke relevante begreper for å analysere egen og andres tekst kan reflektere over og revidere tekster kan reflektere over hvordan retorikk benyttes kan bygge opp saklig argumentasjon og bruke retoriske virkemiddel kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig kan reflektere over egen kommunikasjon i profesjonell sammenheng kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og tekstbinding kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse Kandidaten: kan kommunisere hensiktsmessig for å bidra til en inkluderende og bærekraftig organisasjonskultur kan tilpasse språk og argumentasjon etter mål og mottaker kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting behersker relevante kommunikasjonsverktøy kan kommunisere gjennom relevante tekster og kanaler kan samarbeide om tekstproduksjon kan utvise etikk og gode holdninger i arbeidslivet kan reflektere over ulike verdier og tenkemåter i samfunnet"
      }
    },
    {
      "id": "01TX00C",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak har kunnskap om lønnskostnader har kunnskaper om mål, tiltak og handlingsplaner kjenner til emnets aktuelle lover og avtaler har erfaringsbasert kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer.",
        "skills": "Ferdigheter Kandidaten: kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler kan vurdere bedriftens betalingsevne og kapitalbehov kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler kan foreta en helhetlig prisvurdering og utarbeide kalkyler kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel kan identifisere, analysere og utvikle medarbeidernes kompetanse kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse Kandidaten kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid kan kommunisere internt og eksternt og benytte digitale verktøy til dette. kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TB00A EITKBYK",
      "title": "Grunnleggende bygg og anlegg",
      "credits": 13,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB00A-EITKBYK/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om byggeprosesser for utendørs anlegg og konstruksjoner har innsikt i tekniske standarder og krav. har kunnskap om grøntanlegg, uteområder og landskap, inkludert bruk av dekketyper. kan vurdere energitekniske løsninger i byggkonstruksjoner. har kunnskap om krefter som virker på enkle konstruksjonselementer har kunnskap om bygningsmaterialer og deres konstruksjonsmessige, bygningsfysiske og branntekniske egenskaper. har kunnskap om byggematerialenes oppbygning, karakteristiske egenskaper og bruksområder. kjenner til ordninger for merking, sertifisering og godkjenning av bygningsmaterialer. har kunnskap om grunnleggende laboratorieøvelser og deres anvendelse i praktiske bygge- og anleggsprosjekter. kan vurdere egnede byggematerialer for aktuell brukssituasjon og i samsvar med offentlige krav. kjenner til materialbehandling og produksjonsprosesser for berg- og grusmasser. har kunnskap om hvordan øke levetiden og sikre bærekraftige løsninger i bygg og anlegg. kan vurdere og planlegge tiltak for å redusere avfall og miljøpåvirkning. har kunnskap om ulike miljødeklarasjoner. har kunnskap om bygg- og anleggsbransjens klimaavtrykk. har kunnskap om gjenbruk, ombruk og resirkulering. kjenner til ulike byggemetoder og materialvalg som bidrar til å redusere miljøpåvirkningen gjennom hele livssyklusen til bygninger og anlegg. har innsikt i globale miljøutfordringer som klimaendringer og tap av biologisk mangfold. har kunnskap om metoder for tilstandsanalyser, beregning av livssykluskostnader (LCC) og prinsipper for utarbeidelse av tilstandsrapporter, vedlikeholdsplaner og avfallsplaner kan vurdere eget arbeid opp mot gjeldende regelverk, som bygningslovgivning, forskrifter, tekniske standarder, avtaler og kvalitetskrav kjenner til hvordan man utarbeider tilstandsrapporter, vedlikeholdsplaner og avfallsplaner",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for faglige valg, utstyr og metoder i en byggeprosess kan gjøre rede for krefter i konstruksjonselementer kan anvende faglig kunnskap for å utføre beregninger kan reflektere over aktuelle krav og metoder i forbindelse med grunnarbeider knyttet til ulike bygg- og anleggskonstruksjoner kan gjøre rede for krav i standarder og sertifiseringer kan reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling kan anvende prinsipper for miljøvennlig materialbruk og gjenbruk av ressurser i bygg- og anleggsprosjekter kan gjøre rede for sine faglige valg knyttet til identifisering og håndtering av miljøutfordringer i prosjekter. kan reflektere over løsninger som reduserer karbonavtrykket og fremmer sirkulær økonomi. kan reflektere kritisk over egen faglig praksis og bidra til forbedring i tråd med miljø- og bærekrafts mål i sektoren kan reflektere over de økonomiske fordelene ved sirkulære løsninger sammenlignet med tradisjonelle byggeprosesser kan finne og henvise til informasjon og fagstoff om drift og produksjon av bygg og anlegg kan gjøre rede for myndighetskrav og kan bruke FDV-dokumentasjon og LCC-analyser for å fremme bærekraftig drift og ressursutnyttelse kan anvende lover, forskrifter, FDV-dokumentasjon og LCC-prinsipper i praksis",
        "competence": "Generell kompetanse Kandidaten: kan utveksle synspunkter med andre med bakgrunn fra bygg- og anleggsbransjen, og delta i diskusjoner om optimale løsninger på utfordrende bygg- og anleggsprosjekter kan bidra til organisasjonsutvikling ved å følge med på ny teknologi innen bygg- og anleggsfaget kan planlegge og gjennomføre et prosjekt, som deltaker eller leder av en gruppe, der hensynet til miljø ivaretas og arbeidet gjennomføres i tråd med gjeldende krav og regelverk kan planlegge og gjennomføre tester av stein, pukk og grus kan utveksle synspunkter for bruk av materialer som er miljøvennlige kan utveksle synspunkter om miljøutfordringer og bærekraftige løsninger med kolleger og oppdragsgivere kan bidra til utvikling av innovative og bærekraftige løsninger som fremmer redusert miljøbelastning i bygg- og anleggsnæringen kan planlegge og gjennomføre tiltak som sikrer at drift og vedlikehold av bygg følger gjeldende myndighetskrav og bransjestandarder kan utveksle synspunkter med andre ved å vurdere og kommunisere betydningen av god FDV-praksis og bærekraftige økonomiske valg gjennom livssykluskostnadsanalyser, og ved å samarbeide med ulike aktører for å sikre kvalitet og kostnadseffektivitet i byggforvaltning kan bidra til organisasjonsutvikling ved å holde seg oppdatert på ny teknologi innen bygg- og anleggsfaget og anvende denne kunnskapen for å forbedre praksis og effektivitet i organisasjonen"
      }
    },
    {
      "id": "01TB00B EITKBYK",
      "title": "Digital byggeprosess",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB00B-EITKBYK/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om tegninger innen bygg-, anlegg- og tekniske fag har kunnskap om bruk av IT-verktøy i en byggeprosess og utarbeide bransjerelaterte tegninger ved hjelp av et digitalt program har kunnskap om håndtering av dokumenter og tegninger har kunnskap om grunnleggende tegning og 3D-modellering kjenner til den digitale rolle og betydning i bygg-/ anleggsbransjen, samt hvordan digitale arbeidsmetoder og samhandling endrer tradisjonelle praksiser og påvirker yrkets utvikling har kunnskap om begreper, prosesser og verktøy som benyttes i alle faser av byggesaken har kunnskap om aktuelle lover, forskrifter, vedtekter og standarder innen byggesaker har kunnskap om bygg-/ anleggsbransjen og kjennskap til søknadsprosesser, og om hvordan bransjen forholder seg til kvalitetsstyring og HMS kjenner til søknadsprosedyren en må følge i ei bygge- eller anleggssak har kunnskap om kommuneplaner og reguleringsplaner, og hvordan disse legger føringer for byggeprosjekter, inkludert forståelse for hvordan reguleringsplaner påvirker arealbruk og utforming av bygg kan vurdere eget arbeid i forhold til gjeldende lover, forskrifter og retningslinjer for byggeprosjekter har kunnskap om krav til tegninger i byggesøknader har kunnskap til produksjon av dokumentasjon til søknadsprosesser for aktuell tiltaksklasse kan vurdere eget arbeid i forhold til etablerte standarder og prosedyrer for kvalitetsstyring, og har forståelse for hvordan kvalitetsstyring bidrar til økt sikkerhet og produktkvalitet i prosjekter har kunnskap om kvalitet og HMS som en viktig del av all prosjektering, planlegging og utførelse innen byggesaker kjenner til nye krav og retningslinjer, og hvordan disse legger føringer for byggeprosjekter har kunnskap om bygg-/ anleggsbransjen og kjennskap til hvordan bransjen forholder seg til kvalitetsstyring og HMS",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for sine faglige valg innen grunnleggende tegning og tegningsproduksjon kan reflektere over egen faglig utøvelse i modellering og justere denne i henhold til tilbakemeldinger og veiledning for å oppnå høyere presisjon og kvalitet i arbeidet kan gjøre rede for søknadsprosessen i en byggesak kan gjøre rede for krav i lover og forskrifter som angår kvalitet og HMS i byggesaker kan reflektere over egen faglig utøvelse i byggesaker og justere denne under veiledning kan finne og henvise til informasjon og fagstoff angående byggesaker og aktuelle arbeidsoppgaver kan finne og henvise til lover, forskrifter og normer for å kunne planlegge og utarbeide søknad om byggetillatelse for tiltaksklasser kan gjøre rede for sine faglige valg i forbindelse med søknadsprosessen kan reflektere over egen faglig utøvelse i utarbeidelsen av søknader og justere disse etter tilbakemeldinger og gjeldende krav for å sikre godkjennelse fra myndighetene kan finne og henvise til informasjon og fagstoff om lovverk og forskrifter som gjelder for byggesøknader har gjøre rede for krav angående kvalitet og HMS i byggesaker kan finne og henvise til lover, forskrifter, standarder og fagstoff angående byggesaker og aktuelle arbeidsoppgaver kan reflektere over egen faglig utøvelse innen HMS- og KS-arbeid, og justere utøvelsen etter tilbakemeldinger",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre grunnleggende tegningsoppgaver og prosjekter i tråd med bransjens etiske krav og retningslinjer, både individuelt og som deltaker i en gruppe kan planlegge og gjennomføre grunnleggende operasjoner i prosjekthotell, inkludert å administrere filer, dele modeller og samarbeide med andre aktører, samt navigere mellom tegninger og modeller fra andre fagfelt kan bidra til relasjonsbygging med fagfeller innen bygg- og anleggsbransjen og på tvers av fag, samt med byggherrer og myndigheter kan utveksle synspunkter med andre med bakgrunn innenfor bygg- og anleggsbransjen og delta i diskusjoner om utfordringer i byggesaker kan bidra til organisasjonsutvikling ved å følge med på nye krav og retningslinjer i byggesaken kan planlegge og gjennomføre søknadsprosesser i tråd med gjeldende lover, forskrifter og etiske retningslinjer, både individuelt og som del av et prosjektteam kan planlegge og gjennomføre HMS-, SHA- og KS-oppgaver i tråd med lover, forskrifter og etiske krav kan bidra til en sikkerhets- og kvalitetskultur på anlegg-/byggeplassen"
      }
    },
    {
      "id": "01TB01L EITKBYK",
      "title": "Prosjektstyring",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01L-EITKBYK/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om tømrerens tariffavtale, inkludert lønns- og arbeidsvilkår, samt hvordan disse reguleringene påvirker byggeprosjekter Har kunnskap om kalkulasjonsverktøy og standarder for å bidra til kostnadseffektive og rettferdige arbeidsvilkår i byggeprosjekter kjenner til digitale kalkulasjonsverktøy har innsikt i hvordan digitale kalkulasjonsverktøy brukes til kostnadsberegninger har kunnskap om NS3420-standarden for oppmåling, spesifikasjon og prissetting av byggearbeid i henhold til norske standarder kjenner til de ulike bestanddelene i anbudspriser, inkludert kostnader for materialer, arbeid og administrasjon har kunnskap om digital mengdeberegning og prinsippene bak nøyaktig materialberegning for byggeprosjekter har kunnskap om de ulike entrepriseformene har kunnskap om til utfylling av anbuds- /tilbudsdokumenter i de ulike entrepriseformene har kunnskap i bruken av Norsk Standard som blir brukt i bygg og anleggsbransjen kjenner til relevante lover innenfor byggebransjen har kunnskap om hvordan bærekraftsmål og miljøhensyn kan integreres i prosjektplanlegging har kunnskap om relevante digitale verktøy og programvare for prosjektplanlegging har kunnskap om prosjektgjennomføring, med fokus på optimal planlegging har kunnskap om bruk av planer som styringsverktøy i prosjekter har kunnskap om hvordan fremdrift og ressursbruk påvirker prosjektøkonomi har kunnskap i bruken av Gantt- og nettverksdiagrammer Har innsikt i egne utviklingsmuligheter gjennom arbeid med prosjektplanlegging, bruk av prosjektstyringsverktøy og utarbeidelse av prosjektstyringsplaner. Kan vurdere eget arbeid i forhold til gjeldende normer og krav innen anbud og kontrakter",
        "skills": "Ferdigheter Kandidaten: kan anvende tømrerens tariffavtale i planlegging og administrasjon av prosjekter for å sikre korrekt lønn og arbeidsvilkår kan anvende digitale verktøy for kalkulasjon kan anvende NS3420-standarden i oppmåling og prissetting for å sikre nøyaktige og standardiserte spesifikasjoner kan beregne anbudskalkulasjoner og skille ut kostnadselementene i anbudspriser for å gi realistiske og konkurransedyktige tilbud kan anvende digitale verktøy til mengdeberegning for nøyaktig materialbehov, redusert svinn og kostnadseffektiv prosjektplanlegging kan gjøre rede for sine faglige valg knyttet til anbud/tilbud og kontraktsformer kan gjøre rede for sine faglige valg innen prosjektplanlegging kan reflektere over egen faglig utøvelse i utvikling av prosjektplaner og justere disse i henhold til tilbakemeldinger kan gjøre rede for valg av verktøy og metoder for planlegging av et prosjekts kan reflektere over hvilke løsninger som er tatt for drift og produksjon av bygg og justere disse under veiledning kan finne og henvise til informasjon og fagstoff om drift og produksjon av bygg og vurdere relevansen for et byggeprosjekt kan gjøre rede for sine faglige valg av materialer og arbeid, og bidra til kostnadseffektiv drift kan anvende etiske prinsipper og ta ansvar for kvalitet og sikkerhet i utførelsen av bygningsproduksjon",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver innen kvalitet i anbudsprosesser gjennom prissetting og løsninger i henhold til bransjestandarder kan planlegge og gjennomføre komplette anbuds/tilbuds- og kontrakts prosesser kan bidra til en profesjonell og strukturert anbuds/ tilbudsprosess gjennom overholdelse av standarder og lovverk kan planlegge og følge opp anbud, tilbud og kontrakter for å ivareta kontraktsmessige forpliktelser og rettigheter kan planlegge og gjennomføre prosjektoppgaver i tråd med standarder, etiske krav og bærekrafts prinsipper kan utveksle synspunkter med andre om prosjektstyring og prosjektplanlegging kan bidra til en helhetlig og strukturert tilnærming til prosjektplanlegging kan gjennomføre prosjekter med fokus på optimal planlegging og effektiv fordeling av arbeidsoppgaver kan bygge relasjoner med fagfeller innen produksjon og drift av bygg kan planlegge og gjennomføre et byggeprosjekt med tanke på drift og produksjon, med økonomiske og miljømessige krav kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og byggeprosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan gjennomføre kostnadsberegninger og dokumentere budsjettoppfølging Kan planlegge og gjennomføre bygningsproduksjon i tråd med gjeldende forskrifter og kvalitetskrav"
      }
    },
    {
      "id": "01TB01M EITKBYK",
      "title": "Geomatikk og BIM bygg",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01M-EITKBYK/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om begreper, prosesser og instrumenter som benyttes innen geomatikk har kunnskap om programvare for behandling av innmålte data og produksjon av data til utstikking og maskinstyring har kunnskap om masseberegning med digitale verktøy har innsikt i gjeldene lovverk og standarder i forbindelse med geomatikk har kunnskap om bruk av BIM-manual i prosjekter og hvordan disse brukes som et styringsverktøy har kunnskap om hvordan BIM brukes til å koordinere tekniske fag i prosjekter for å redusere konflikter og sikre effektiv installasjon kjenner til metoder for mengdeberegning fra BIM-modeller har kunnskap om prinsippene for 3D-modellering kan vurdere eget arbeid i forhold til gjeldende normer og krav ved bruk av BIM i byggprosjekter, samt gjennom anvendelse av geomatikk med fokus på kart, koordinatsystemer, landmålingsinstrumenter og  databehandling.",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for innhenting av kartdata og bruke GIS kan gjøre rede for utarbeiding av dokumentasjon etter utførte oppgaver i felt kan gjøre rede for bruk av relevante faglige verktøy for beregning av høyder og koordinater på punkt i kart og terreng kan gjøre rede for bruk av faglig kunnskap til masseberegninger med data innhentet fra analoge og digitale kart kan gjøre rede for grunnleggende prinsipper for 3D-modellering kan gjøre rede for hvordan visualisering bidrar til kommunikasjon, planlegging og kvalitetssikring i byggeprosjekter kan gjøre rede for hvordan BIM brukes til å koordinere tekniske installasjoner og løse konflikter mellom fagområder kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling kan reflektere over egen faglig utøvelse og justere denne under veiledning",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer, med bruk av BIM i byggprosjekter til modellering, mengdeuttak, kostnadsestimering og tverrfaglig koordinering, samt anvende geomatikk til kartlegging, utsetting, dokumentasjon og bruk av landmålingsinstrumenter i samsvar med gjeldende standarder. kan planlegge og gjennomføre oppgaver i BIM-prosjekter i tråd med BIM-manualer og standarder kan utveksle synspunkter og samarbeide med ulike fagområder for å sikre god samhandling i BIM-prosjekter"
      }
    },
    {
      "id": "01TB01N EITKBYK",
      "title": "Konstruksjonslære bygg",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01N-EITKBYK/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om materialers egenskaper har kunnskap om konstruksjonsløsninger på bygg i ulike materialer, som tre, stål og betong har kunnskap om hvordan en beregner laster på bygningskonstruksjoner har kunnskap om dimensjonering av enkle betongdekker, bjelker og søyler har kunnskap om gjeldende Eurokoder kan vurdere eget arbeid i forhold til gjeldende normer og krav kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av konstruksjonsløsning kan gjøre rede for valg av materialkvalitet til ulike konstruksjoner kan gjøre rede for hvordan en dimensjonerer konstruksjoner i betong, tre og stål kan gjøre rede for hvordan man leser og tegner enkle betong- og armerings tegninger kan reflektere over hvilke løsninger som er tatt for konstruksjoner på bygg og justere disse under veiledning kan gjøre rede for krefter som virker på enkle konstruksjonselementer kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre konstruksjonsarbeid for byggverk som deltaker eller leder av gruppe kan planlegge og gjennomføre et konstruksjonsarbeid etter kundens ønsker og myndigheters krav kan bygge relasjoner med fagfeller innen konstruksjon av bygg og på tvers av fag kan utveksle synspunkter med andre med bakgrunn innenfor konstruksjon av bygg og delta i diskusjoner"
      }
    },
    {
      "id": "01TB01O EITKBYK",
      "title": "Bygningsbevaring og bygningsfysikk",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01O-EITKBYK/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: kjenner til byggverks historie, byggetradisjoner, byggeskikker og byggekulturen har innsikt i egne utviklingsmuligheter innen drift og produksjon av bygg har kunnskap om metoder for tilstandsanalyse og kartlegging av eksisterende bygg, har kunnskap om byggtekniske løsninger som benyttes i rehabiliteringsprosjekter har kunnskap om prinsippene for materialgjenbruk og ombruk i byggeprosjekter, har kunnskap om tiltak for energi og miljø i rehabilitering av bygg har kunnskap om relevante lover og forskrifter kan vurdere eget arbeid i forhold til bruken av BIM i rehabiliteringsprosjekter har kunnskap om hvordan klimatiske faktorer som vind, nedbør og temperatur påvirker bygg og kan forklare nødvendige tilpasninger for holdbarhet kan vurdere lysforhold og solenergiens rolle i å forbedre byggets energieffektivitet har innsikt i ventilasjon og lydisolering som sentrale elementer for inneklima og energieffektivitet kjenner til energivurdering, kuldebroer, varmeomfordeling og transmisjon for å minimere energitap har kunnskap om energieffektive bygg, energibruk og metoder for energivurdering samt innsikt i energi- og miljøledelse for redusert energiforbruk kan reflektere over egen faglig utøvelse i henhold til gjeldende regelverk og krav har innsikt i kuldebroer, varmeomfordeling og transmisjon og kan bruke dette til å redusere energitap og forbedre byggets termiske egenskaper har kunnskap om klimafaktorers påvirkning på bygg, som vind og nedbør, og foreslå løsninger som øker byggets motstandsdyktighet og holdbarhet har kunnskap om ventilasjon og lydforhold, forstå deres innvirkning på inneklima, og foreslå tiltak som forbedrer komfort og energieffektivitet har kunnskap om byggets energiytelse, identifisere tiltak for energireduksjon, inkludert energitilskudd og optimal varmefordeling kan vurdere og optimalisere lysforhold og bruk av solenergi i bygget for å teoretisk oppnå energieffektivitet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for sine faglige valg knyttet til tilstandsanalyse og valg av byggtekniske løsninger for rehabilitering kan reflektere over egen faglig utøvelse i planlegging og utførelse av materialgjenbruk og ombruk kan finne og henvise til informasjon og fagstoff kan gjøre rede for bruk av BIM-verktøy for å planlegge ulike prosjekter kan gjøre rede for lover og forskrifter i planleggingen og utførelsen av prosjekter kan gjøre rede for ulike vernemetoder og vurdere enkle tilstandsanalyser kan gjøre rede for bruk av materialer for gjenbruk og energieffektivisering. kan gjøre rede for byggskader kan anvende faglig kunnskap for å utføre beregninger for å redusere varmetransmisjon og tilhørende energitap i bygg. kan gjøre rede for energibruk og vurdere tiltak som optimaliserer både energiforbruk og miljøbelastning. kan gjøre rede for metoder og verktøy knyttet til energi- og miljøledelse. kan reflektere over bygningsfysiske forhold og vurdere deres påvirkning på miljø og samfunn. kan reflektere over hvordan tekniske løsninger påvirker miljø og samfunn, og anvende generell kompetanse til å fremme tiltak som ivaretar bærekraft, miljøpåvirkning og klimaforhold i prosjekter.",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre rehabiliterings- og gjenbruksprosjekter i tråd med bransjens etiske krav, kan utveksle synspunkter med andre innen bygge- og anleggsbransjen kan planlegge og gjennomføre rehabilitering med hensyn til miljø og kulturminner. kan bidra til en helhetlig forståelse for byggets livsløp og ansvar i bevaringsarbeid. kan bidra til samhandling på tvers av fagretninger kan utveksle synspunkter med andre med bakgrunn innenfor bransjen om energieffektivitet og klimatilpasning kan planlegge og justere ventilasjons- og lydisoleringssystemer for å sikre ønsket inneklima. kan gjennomføre energivurderinger, identifisere kuldebroer og omfordele varme for å forbedre energieffektiviteten."
      }
    },
    {
      "id": "01TB01P EITKBYK",
      "title": "Anleggsdrift",
      "credits": 6,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01P-EITKBYK/2028-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om de ulike løsmassene sin sammensetning og klassifisering har kunnskap om geotekniske forhold. kan vurdere fare for ras og setninger kjenner til geosynteter, geotekstiler, armering av jord, fyllinger, skråninger, støttemurer og fundament har kunnskap om ingeniørgeologi har kunnskap om jordtrykk har kunnskap om hvordan masse forflyttes på en sikker og effektiv måte har kunnskap om hvordan en bygge- og anleggsplass ledes og driftes har kunnskap om kapasitet for ulike typer bore- og transportutstyr, og kan velge har kunnskap om vanlige sivile sprengstoff og tennere, og bruksområde for disse har kunnskap om risikoanalyse og dekking av salve har kunnskap om pall- og grøftesprenging har kunnskap om å lage rutiner for alle typer sprengningsarbeid i henhold til gjeldende lovverk kjenner til beregninger av rystelser og bølger som følge av sprengning har kunnskap om dimensjonering og beregning av ledninger for vann og avløp iht aktuelle lover og forskrifter har kunnskap om rørmateriell og teknologi. har kunnskap om lover og forskrifter som regulerer bygging av vei og baneanlegg kjenner til veinormaler har kunnskap om materialer og utførelse i veiprosjekt har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for dimensjoneringsgrunnlag for bygg, veityper og veiklasser kan gjøre rede for oppbygging og utførelse av de ulike sjikt i vei kan reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre produksjon eller drift av anlegg i tråd med byggherrens behov og myndighetskrav, både alene og i samarbeid med andre, og i samsvar med etiske krav og retningslinjer. kan planlegge, vurdere og drøfte sprengningsarbeid over bakkenivå kan planlegge og lede arbeid med å etablere vann og avløp i mindre anlegg. kan planlegge og gjennomføre i nye veianlegg kan gjennomføre bæreevne beregninger av en direktefundamentert kan gjennomføre jordartsberegninger basert på resultat fra rutineundersøkinger kan planlegge tilrigging og massetransport kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan utveksle synspunkter med andre med bakgrunn innenfor anleggsdrift og delta i diskusjoner om utvikling av god praksis"
      }
    },
    {
      "id": "01TX00H",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om hvordan man skriver en prosjektrapport har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt har kunnskap om sammenhengen mellom teori og praksis kan vurdere eget prosjekt i forhold til gjeldende normer og krav kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av tema for hovedprosjekt kan identifisere, kartlegge og vurdere en faglig problemstilling kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat kan skrive en prosjektrapport kan drøfte sammenhengen mellom teori og praksis kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    },
    {
      "id": "01TX00A",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om realfag som redskap innen sitt fagområde. har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes kan utføre beregninger, overslag og problemløsning relevant for dimensjoneringer og andre problemstillinger innen studieretningen kan vurdere eget arbeid i henhold til matematiske og fysiske lover kan utvide sine kunnskaper og har innsikt i egne utviklingsmuligheter innen realfag. kjenner til matematikkens og fysikkens egenart og plass i samfunnet",
        "skills": "Ferdigheter Studenten: kan gjøre rede for valg av regnemetode som anvendes for å løse faglige problemer kan gjøre rede for valg av digitale verktøy som anvendes til problemløsning innen realfaglige tema kan anvende digitale hjelpemidler til å løse matematiske problemer kan vurdere resultater av beregninger, samt reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til relevant informasjon og fagstoff i formelsamlinger, tabeller og fagbøker kan kartlegge en situasjon og identifisere realfaglige problemstillinger har kjennskap til og kan anvende grunnleggende fysiske lover og fysikkens metodikk kan tolke og anvende modeller som benyttes innen matematikk og fysikk",
        "competence": "Generell kompetanse Studenten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger har innsikt i rekkevidde og begrensninger for de metoder som anvendes kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om grunnleggende kommunikasjonsteori kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde har kunnskap om sentrale retoriske begreper og virkemidler har kunnskap om kildebruk og referanseteknikk etter standard for høyere utdanning kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter har kjennskap til hvordan man organiserer og produserer tekst har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne har kunnskap om språket som verktøy for god kommunikasjon og kjenner til norsk og engelsk fagterminologi innen sitt fagområde har kunnskap om grammatikk, sjangerforståelse samt språklige, stilistiske og grafiske virkemidler i tekst.",
        "skills": "Ferdigheter Kandidaten: kan reflektere over møter mellom forskjellige arbeidslivskulturer kan bruke relevante begreper for å analysere egen og andres tekst kan reflektere over og revidere tekster kan reflektere over hvordan retorikk benyttes kan bygge opp saklig argumentasjon og bruke retoriske virkemiddel kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig kan reflektere over egen kommunikasjon i profesjonell sammenheng kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og tekstbinding kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse Kandidaten: kan kommunisere hensiktsmessig for å bidra til en inkluderende og bærekraftig organisasjonskultur kan tilpasse språk og argumentasjon etter mål og mottaker kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting behersker relevante kommunikasjonsverktøy kan kommunisere gjennom relevante tekster og kanaler kan samarbeide om tekstproduksjon kan utvise etikk og gode holdninger i arbeidslivet kan reflektere over ulike verdier og tenkemåter i samfunnet"
      }
    },
    {
      "id": "01TX00C",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak har kunnskap om lønnskostnader har kunnskaper om mål, tiltak og handlingsplaner kjenner til emnets aktuelle lover og avtaler har erfaringsbasert kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer.",
        "skills": "Ferdigheter Kandidaten: kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler kan vurdere bedriftens betalingsevne og kapitalbehov kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler kan foreta en helhetlig prisvurdering og utarbeide kalkyler kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel kan identifisere, analysere og utvikle medarbeidernes kompetanse kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse Kandidaten kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid kan kommunisere internt og eksternt og benytte digitale verktøy til dette. kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TB00A EITKBYK",
      "title": "Grunnleggende bygg og anlegg",
      "credits": 13,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB00A-EITKBYK/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om byggeprosesser for utendørs anlegg og konstruksjoner har innsikt i tekniske standarder og krav. har kunnskap om grøntanlegg, uteområder og landskap, inkludert bruk av dekketyper. kan vurdere energitekniske løsninger i byggkonstruksjoner. har kunnskap om krefter som virker på enkle konstruksjonselementer har kunnskap om bygningsmaterialer og deres konstruksjonsmessige, bygningsfysiske og branntekniske egenskaper. har kunnskap om byggematerialenes oppbygning, karakteristiske egenskaper og bruksområder. kjenner til ordninger for merking, sertifisering og godkjenning av bygningsmaterialer. har kunnskap om grunnleggende laboratorieøvelser og deres anvendelse i praktiske bygge- og anleggsprosjekter. kan vurdere egnede byggematerialer for aktuell brukssituasjon og i samsvar med offentlige krav. kjenner til materialbehandling og produksjonsprosesser for berg- og grusmasser. har kunnskap om hvordan øke levetiden og sikre bærekraftige løsninger i bygg og anlegg. kan vurdere og planlegge tiltak for å redusere avfall og miljøpåvirkning. har kunnskap om ulike miljødeklarasjoner. har kunnskap om bygg- og anleggsbransjens klimaavtrykk. har kunnskap om gjenbruk, ombruk og resirkulering. kjenner til ulike byggemetoder og materialvalg som bidrar til å redusere miljøpåvirkningen gjennom hele livssyklusen til bygninger og anlegg. har innsikt i globale miljøutfordringer som klimaendringer og tap av biologisk mangfold. har kunnskap om metoder for tilstandsanalyser, beregning av livssykluskostnader (LCC) og prinsipper for utarbeidelse av tilstandsrapporter, vedlikeholdsplaner og avfallsplaner kan vurdere eget arbeid opp mot gjeldende regelverk, som bygningslovgivning, forskrifter, tekniske standarder, avtaler og kvalitetskrav kjenner til hvordan man utarbeider tilstandsrapporter, vedlikeholdsplaner og avfallsplaner",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for faglige valg, utstyr og metoder i en byggeprosess kan gjøre rede for krefter i konstruksjonselementer kan anvende faglig kunnskap for å utføre beregninger kan reflektere over aktuelle krav og metoder i forbindelse med grunnarbeider knyttet til ulike bygg- og anleggskonstruksjoner kan gjøre rede for krav i standarder og sertifiseringer kan reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling kan anvende prinsipper for miljøvennlig materialbruk og gjenbruk av ressurser i bygg- og anleggsprosjekter kan gjøre rede for sine faglige valg knyttet til identifisering og håndtering av miljøutfordringer i prosjekter. kan reflektere over løsninger som reduserer karbonavtrykket og fremmer sirkulær økonomi. kan reflektere kritisk over egen faglig praksis og bidra til forbedring i tråd med miljø- og bærekrafts mål i sektoren kan reflektere over de økonomiske fordelene ved sirkulære løsninger sammenlignet med tradisjonelle byggeprosesser kan finne og henvise til informasjon og fagstoff om drift og produksjon av bygg og anlegg kan gjøre rede for myndighetskrav og kan bruke FDV-dokumentasjon og LCC-analyser for å fremme bærekraftig drift og ressursutnyttelse kan anvende lover, forskrifter, FDV-dokumentasjon og LCC-prinsipper i praksis",
        "competence": "Generell kompetanse Kandidaten: kan utveksle synspunkter med andre med bakgrunn fra bygg- og anleggsbransjen, og delta i diskusjoner om optimale løsninger på utfordrende bygg- og anleggsprosjekter kan bidra til organisasjonsutvikling ved å følge med på ny teknologi innen bygg- og anleggsfaget kan planlegge og gjennomføre et prosjekt, som deltaker eller leder av en gruppe, der hensynet til miljø ivaretas og arbeidet gjennomføres i tråd med gjeldende krav og regelverk kan planlegge og gjennomføre tester av stein, pukk og grus kan utveksle synspunkter for bruk av materialer som er miljøvennlige kan utveksle synspunkter om miljøutfordringer og bærekraftige løsninger med kolleger og oppdragsgivere kan bidra til utvikling av innovative og bærekraftige løsninger som fremmer redusert miljøbelastning i bygg- og anleggsnæringen kan planlegge og gjennomføre tiltak som sikrer at drift og vedlikehold av bygg følger gjeldende myndighetskrav og bransjestandarder kan utveksle synspunkter med andre ved å vurdere og kommunisere betydningen av god FDV-praksis og bærekraftige økonomiske valg gjennom livssykluskostnadsanalyser, og ved å samarbeide med ulike aktører for å sikre kvalitet og kostnadseffektivitet i byggforvaltning kan bidra til organisasjonsutvikling ved å holde seg oppdatert på ny teknologi innen bygg- og anleggsfaget og anvende denne kunnskapen for å forbedre praksis og effektivitet i organisasjonen"
      }
    },
    {
      "id": "01TB01L EITKBYK",
      "title": "Prosjektstyring",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01L-EITKBYK/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om tømrerens tariffavtale, inkludert lønns- og arbeidsvilkår, samt hvordan disse reguleringene påvirker byggeprosjekter Har kunnskap om kalkulasjonsverktøy og standarder for å bidra til kostnadseffektive og rettferdige arbeidsvilkår i byggeprosjekter kjenner til digitale kalkulasjonsverktøy har innsikt i hvordan digitale kalkulasjonsverktøy brukes til kostnadsberegninger har kunnskap om NS3420-standarden for oppmåling, spesifikasjon og prissetting av byggearbeid i henhold til norske standarder kjenner til de ulike bestanddelene i anbudspriser, inkludert kostnader for materialer, arbeid og administrasjon har kunnskap om digital mengdeberegning og prinsippene bak nøyaktig materialberegning for byggeprosjekter har kunnskap om de ulike entrepriseformene har kunnskap om til utfylling av anbuds- /tilbudsdokumenter i de ulike entrepriseformene har kunnskap i bruken av Norsk Standard som blir brukt i bygg og anleggsbransjen kjenner til relevante lover innenfor byggebransjen har kunnskap om hvordan bærekraftsmål og miljøhensyn kan integreres i prosjektplanlegging har kunnskap om relevante digitale verktøy og programvare for prosjektplanlegging har kunnskap om prosjektgjennomføring, med fokus på optimal planlegging har kunnskap om bruk av planer som styringsverktøy i prosjekter har kunnskap om hvordan fremdrift og ressursbruk påvirker prosjektøkonomi har kunnskap i bruken av Gantt- og nettverksdiagrammer Har innsikt i egne utviklingsmuligheter gjennom arbeid med prosjektplanlegging, bruk av prosjektstyringsverktøy og utarbeidelse av prosjektstyringsplaner. Kan vurdere eget arbeid i forhold til gjeldende normer og krav innen anbud og kontrakter",
        "skills": "Ferdigheter Kandidaten: kan anvende tømrerens tariffavtale i planlegging og administrasjon av prosjekter for å sikre korrekt lønn og arbeidsvilkår kan anvende digitale verktøy for kalkulasjon kan anvende NS3420-standarden i oppmåling og prissetting for å sikre nøyaktige og standardiserte spesifikasjoner kan beregne anbudskalkulasjoner og skille ut kostnadselementene i anbudspriser for å gi realistiske og konkurransedyktige tilbud kan anvende digitale verktøy til mengdeberegning for nøyaktig materialbehov, redusert svinn og kostnadseffektiv prosjektplanlegging kan gjøre rede for sine faglige valg knyttet til anbud/tilbud og kontraktsformer kan gjøre rede for sine faglige valg innen prosjektplanlegging kan reflektere over egen faglig utøvelse i utvikling av prosjektplaner og justere disse i henhold til tilbakemeldinger kan gjøre rede for valg av verktøy og metoder for planlegging av et prosjekts kan reflektere over hvilke løsninger som er tatt for drift og produksjon av bygg og justere disse under veiledning kan finne og henvise til informasjon og fagstoff om drift og produksjon av bygg og vurdere relevansen for et byggeprosjekt kan gjøre rede for sine faglige valg av materialer og arbeid, og bidra til kostnadseffektiv drift kan anvende etiske prinsipper og ta ansvar for kvalitet og sikkerhet i utførelsen av bygningsproduksjon",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver innen kvalitet i anbudsprosesser gjennom prissetting og løsninger i henhold til bransjestandarder kan planlegge og gjennomføre komplette anbuds/tilbuds- og kontrakts prosesser kan bidra til en profesjonell og strukturert anbuds/ tilbudsprosess gjennom overholdelse av standarder og lovverk kan planlegge og følge opp anbud, tilbud og kontrakter for å ivareta kontraktsmessige forpliktelser og rettigheter kan planlegge og gjennomføre prosjektoppgaver i tråd med standarder, etiske krav og bærekrafts prinsipper kan utveksle synspunkter med andre om prosjektstyring og prosjektplanlegging kan bidra til en helhetlig og strukturert tilnærming til prosjektplanlegging kan gjennomføre prosjekter med fokus på optimal planlegging og effektiv fordeling av arbeidsoppgaver kan bygge relasjoner med fagfeller innen produksjon og drift av bygg kan planlegge og gjennomføre et byggeprosjekt med tanke på drift og produksjon, med økonomiske og miljømessige krav kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og byggeprosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan gjennomføre kostnadsberegninger og dokumentere budsjettoppfølging Kan planlegge og gjennomføre bygningsproduksjon i tråd med gjeldende forskrifter og kvalitetskrav"
      }
    },
    {
      "id": "01TB01M EITKBYK",
      "title": "Geomatikk og BIM bygg",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01M-EITKBYK/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om begreper, prosesser og instrumenter som benyttes innen geomatikk har kunnskap om programvare for behandling av innmålte data og produksjon av data til utstikking og maskinstyring har kunnskap om masseberegning med digitale verktøy har innsikt i gjeldene lovverk og standarder i forbindelse med geomatikk har kunnskap om bruk av BIM-manual i prosjekter og hvordan disse brukes som et styringsverktøy har kunnskap om hvordan BIM brukes til å koordinere tekniske fag i prosjekter for å redusere konflikter og sikre effektiv installasjon kjenner til metoder for mengdeberegning fra BIM-modeller har kunnskap om prinsippene for 3D-modellering kan vurdere eget arbeid i forhold til gjeldende normer og krav ved bruk av BIM i byggprosjekter, samt gjennom anvendelse av geomatikk med fokus på kart, koordinatsystemer, landmålingsinstrumenter og  databehandling.",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for innhenting av kartdata og bruke GIS kan gjøre rede for utarbeiding av dokumentasjon etter utførte oppgaver i felt kan gjøre rede for bruk av relevante faglige verktøy for beregning av høyder og koordinater på punkt i kart og terreng kan gjøre rede for bruk av faglig kunnskap til masseberegninger med data innhentet fra analoge og digitale kart kan gjøre rede for grunnleggende prinsipper for 3D-modellering kan gjøre rede for hvordan visualisering bidrar til kommunikasjon, planlegging og kvalitetssikring i byggeprosjekter kan gjøre rede for hvordan BIM brukes til å koordinere tekniske installasjoner og løse konflikter mellom fagområder kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling kan reflektere over egen faglig utøvelse og justere denne under veiledning",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer, med bruk av BIM i byggprosjekter til modellering, mengdeuttak, kostnadsestimering og tverrfaglig koordinering, samt anvende geomatikk til kartlegging, utsetting, dokumentasjon og bruk av landmålingsinstrumenter i samsvar med gjeldende standarder. kan planlegge og gjennomføre oppgaver i BIM-prosjekter i tråd med BIM-manualer og standarder kan utveksle synspunkter og samarbeide med ulike fagområder for å sikre god samhandling i BIM-prosjekter"
      }
    },
    {
      "id": "01TB01N EITKBYK",
      "title": "Konstruksjonslære bygg",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01N-EITKBYK/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om materialers egenskaper har kunnskap om konstruksjonsløsninger på bygg i ulike materialer, som tre, stål og betong har kunnskap om hvordan en beregner laster på bygningskonstruksjoner har kunnskap om dimensjonering av enkle betongdekker, bjelker og søyler har kunnskap om gjeldende Eurokoder kan vurdere eget arbeid i forhold til gjeldende normer og krav kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av konstruksjonsløsning kan gjøre rede for valg av materialkvalitet til ulike konstruksjoner kan gjøre rede for hvordan en dimensjonerer konstruksjoner i betong, tre og stål kan gjøre rede for hvordan man leser og tegner enkle betong- og armerings tegninger kan reflektere over hvilke løsninger som er tatt for konstruksjoner på bygg og justere disse under veiledning kan gjøre rede for krefter som virker på enkle konstruksjonselementer kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre konstruksjonsarbeid for byggverk som deltaker eller leder av gruppe kan planlegge og gjennomføre et konstruksjonsarbeid etter kundens ønsker og myndigheters krav kan bygge relasjoner med fagfeller innen konstruksjon av bygg og på tvers av fag kan utveksle synspunkter med andre med bakgrunn innenfor konstruksjon av bygg og delta i diskusjoner"
      }
    },
    {
      "id": "01TB01O EITKBYK",
      "title": "Bygningsbevaring og bygningsfysikk",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01O-EITKBYK/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: kjenner til byggverks historie, byggetradisjoner, byggeskikker og byggekulturen har innsikt i egne utviklingsmuligheter innen drift og produksjon av bygg har kunnskap om metoder for tilstandsanalyse og kartlegging av eksisterende bygg, har kunnskap om byggtekniske løsninger som benyttes i rehabiliteringsprosjekter har kunnskap om prinsippene for materialgjenbruk og ombruk i byggeprosjekter, har kunnskap om tiltak for energi og miljø i rehabilitering av bygg har kunnskap om relevante lover og forskrifter kan vurdere eget arbeid i forhold til bruken av BIM i rehabiliteringsprosjekter har kunnskap om hvordan klimatiske faktorer som vind, nedbør og temperatur påvirker bygg og kan forklare nødvendige tilpasninger for holdbarhet kan vurdere lysforhold og solenergiens rolle i å forbedre byggets energieffektivitet har innsikt i ventilasjon og lydisolering som sentrale elementer for inneklima og energieffektivitet kjenner til energivurdering, kuldebroer, varmeomfordeling og transmisjon for å minimere energitap har kunnskap om energieffektive bygg, energibruk og metoder for energivurdering samt innsikt i energi- og miljøledelse for redusert energiforbruk kan reflektere over egen faglig utøvelse i henhold til gjeldende regelverk og krav har innsikt i kuldebroer, varmeomfordeling og transmisjon og kan bruke dette til å redusere energitap og forbedre byggets termiske egenskaper har kunnskap om klimafaktorers påvirkning på bygg, som vind og nedbør, og foreslå løsninger som øker byggets motstandsdyktighet og holdbarhet har kunnskap om ventilasjon og lydforhold, forstå deres innvirkning på inneklima, og foreslå tiltak som forbedrer komfort og energieffektivitet har kunnskap om byggets energiytelse, identifisere tiltak for energireduksjon, inkludert energitilskudd og optimal varmefordeling kan vurdere og optimalisere lysforhold og bruk av solenergi i bygget for å teoretisk oppnå energieffektivitet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for sine faglige valg knyttet til tilstandsanalyse og valg av byggtekniske løsninger for rehabilitering kan reflektere over egen faglig utøvelse i planlegging og utførelse av materialgjenbruk og ombruk kan finne og henvise til informasjon og fagstoff kan gjøre rede for bruk av BIM-verktøy for å planlegge ulike prosjekter kan gjøre rede for lover og forskrifter i planleggingen og utførelsen av prosjekter kan gjøre rede for ulike vernemetoder og vurdere enkle tilstandsanalyser kan gjøre rede for bruk av materialer for gjenbruk og energieffektivisering. kan gjøre rede for byggskader kan anvende faglig kunnskap for å utføre beregninger for å redusere varmetransmisjon og tilhørende energitap i bygg. kan gjøre rede for energibruk og vurdere tiltak som optimaliserer både energiforbruk og miljøbelastning. kan gjøre rede for metoder og verktøy knyttet til energi- og miljøledelse. kan reflektere over bygningsfysiske forhold og vurdere deres påvirkning på miljø og samfunn. kan reflektere over hvordan tekniske løsninger påvirker miljø og samfunn, og anvende generell kompetanse til å fremme tiltak som ivaretar bærekraft, miljøpåvirkning og klimaforhold i prosjekter.",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre rehabiliterings- og gjenbruksprosjekter i tråd med bransjens etiske krav, kan utveksle synspunkter med andre innen bygge- og anleggsbransjen kan planlegge og gjennomføre rehabilitering med hensyn til miljø og kulturminner. kan bidra til en helhetlig forståelse for byggets livsløp og ansvar i bevaringsarbeid. kan bidra til samhandling på tvers av fagretninger kan utveksle synspunkter med andre med bakgrunn innenfor bransjen om energieffektivitet og klimatilpasning kan planlegge og justere ventilasjons- og lydisoleringssystemer for å sikre ønsket inneklima. kan gjennomføre energivurderinger, identifisere kuldebroer og omfordele varme for å forbedre energieffektiviteten."
      }
    },
    {
      "id": "01TB01P EITKBYK",
      "title": "Anleggsdrift",
      "credits": 6,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01P-EITKBYK/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om de ulike løsmassene sin sammensetning og klassifisering har kunnskap om geotekniske forhold. kan vurdere fare for ras og setninger kjenner til geosynteter, geotekstiler, armering av jord, fyllinger, skråninger, støttemurer og fundament har kunnskap om ingeniørgeologi har kunnskap om jordtrykk har kunnskap om hvordan masse forflyttes på en sikker og effektiv måte har kunnskap om hvordan en bygge- og anleggsplass ledes og driftes har kunnskap om kapasitet for ulike typer bore- og transportutstyr, og kan velge har kunnskap om vanlige sivile sprengstoff og tennere, og bruksområde for disse har kunnskap om risikoanalyse og dekking av salve har kunnskap om pall- og grøftesprenging har kunnskap om å lage rutiner for alle typer sprengningsarbeid i henhold til gjeldende lovverk kjenner til beregninger av rystelser og bølger som følge av sprengning har kunnskap om dimensjonering og beregning av ledninger for vann og avløp iht aktuelle lover og forskrifter har kunnskap om rørmateriell og teknologi. har kunnskap om lover og forskrifter som regulerer bygging av vei og baneanlegg kjenner til veinormaler har kunnskap om materialer og utførelse i veiprosjekt har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for dimensjoneringsgrunnlag for bygg, veityper og veiklasser kan gjøre rede for oppbygging og utførelse av de ulike sjikt i vei kan reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre produksjon eller drift av anlegg i tråd med byggherrens behov og myndighetskrav, både alene og i samarbeid med andre, og i samsvar med etiske krav og retningslinjer. kan planlegge, vurdere og drøfte sprengningsarbeid over bakkenivå kan planlegge og lede arbeid med å etablere vann og avløp i mindre anlegg. kan planlegge og gjennomføre i nye veianlegg kan gjennomføre bæreevne beregninger av en direktefundamentert kan gjennomføre jordartsberegninger basert på resultat fra rutineundersøkinger kan planlegge tilrigging og massetransport kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan utveksle synspunkter med andre med bakgrunn innenfor anleggsdrift og delta i diskusjoner om utvikling av god praksis"
      }
    },
    {
      "id": "01TX00H",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om hvordan man skriver en prosjektrapport har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt har kunnskap om sammenhengen mellom teori og praksis kan vurdere eget prosjekt i forhold til gjeldende normer og krav kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av tema for hovedprosjekt kan identifisere, kartlegge og vurdere en faglig problemstilling kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat kan skrive en prosjektrapport kan drøfte sammenhengen mellom teori og praksis kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    },
    {
      "id": "01TX00A EITKFRE",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A-EITKFRE/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om realfag som redskap innen sitt fagområde har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes for å utføre nødvendige beregninger, dimensjoneringer, overslag og annen problemløsning med utgangspunkt i relevante praktiske situasjoner og problemstillinger innen fagretningen. har kunnskap om matematiske og fysiske lover, formler og symboler som er relevante for fagretningen kan vurdere eget arbeid i forhold til matematiske og fysiske lover har bransjekunnskap og kjennskap til yrkesfeltet en har valgt og om hvilken betydning realfaglige redskap har for fagretningen kan oppdatere sine kunnskaper innen realfag kjenner til matematikkens og fysikkens historie, tradisjoner, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter innen realfag",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av regneoperasjoner som anvendes for fagspesifikke problemstillinger kan gjøre rede for digitale verktøy som anvendes til problemløsninger innen realfaglige tema kan reflektere over egen faglig utøvelse og vurdere resultater av beregninger og justere denne under veiledning kan finne og henvise til informasjon og fagstoff i formelsamlinger og fagbøker og vurdere relevansen for en realfaglig problemstilling",
        "competence": "Generell kompetanse Studenten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger har innsikt i rekkevidde og begrensninger for de metoder som anvendes kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B EITKFRE",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B-EITKFRE/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om grunnleggende kommunikasjonsteori kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde har kunnskap om sentrale retoriske begreper og virkemidler har kunnskap om kildebruk etter standard for høyere utdanning kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter har kjennskap til prinsipper for tekstorganisering og -produksjon har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne",
        "skills": "Ferdigheter Studenten kan reflektere over møter mellom forskjellige arbeidslivskulturer kan bruke relevante begreper for å analysere egen og andres tekst kan reflektere over og revidere tekster kan reflektere over hvordan retorikk benyttes kan bygge opp saklig argumentasjon og bruke retoriske apellformer kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig kan reflektere over egen kommunikasjon i profesjonell sammenheng kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og god tekstbinding kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse Studenten kan kommunisere hensiktsmessig for å bidra til en inkluderende organisasjonskultur kan tilpasse språk og argumentasjon etter mål og mottaker kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting behersker relevante kommunikasjonsverktøy kan kommunisere gjennom relevante tekster og kanaler kan samarbeide om tekstproduksjon"
      }
    },
    {
      "id": "01TX00C EITKFRE",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C-EITKFRE/2025-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak har kunnskap om lønnskostnader har kunnskaper om mål, tiltak og handlingsplaner • kjenner til emnets aktuelle lover og avtaler",
        "skills": "Ferdigheter Studenten kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler kan vurdere bedriftens betalingsevne og kapitalbehov kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler kan foreta en helhetlig prisvurdering og utarbeide kalkyler kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel kan identifisere, analysere og utvikle medarbeidernes kompetanse • kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse Studenten kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid kan kommunisere internt og eksternt og benytte digitale verktøy til dette. kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "00TB00D EITKBYFH24",
      "title": "Samordnet byggeprosess",
      "credits": 20,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00TB00D-EITKBYFH24/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om begreper, teorier, modeller og prosesser og verktøy som anvendes innenfor en samordnet byggeprosess har kunnskap om bruk av relevant IT-verktøy i en byggeprosess og utarbeide enkle bransjerelaterte tegninger ved hjelp av et relevant DAK-verktøy kan beskrive krefter som virker på enkle konstruksjonselementer og forklare hvilke belastninger dette vil gi på de ulike deler og sammenføyninger har kunnskap om byggeprosesser for utendørs anlegg og konstruksjoner og har innsikt i tekniske standarder og krav har kunnskap om byggematerialenes oppbygning, karakteristiske egenskaper og bruksområde har kunnskap om bygg-, anleggs- og VVS-tekniske tegninger (både digitale og papirutgaver) har kunnskap om teori, data og utstyr til bransjerelevant geomatikk har kunnskap om energieffektive bygningskonsepter med lav miljøbelastning og godt inneklima har kunnskap om miljøutfordringer knyttet til både det ytre miljø, inneklima, byggematerialer, røranlegg (VA), utendørs konstruksjoner og bearbeiding, og kjenner til vanlig brukt utstyr innenfor bygg og anlegg har kunnskap om lydforhold i bygninger har kunnskaper om branntekniske forutsetninger og brannstrategier i bygninger har kunnskap om krav og sertifiseringsordninger for byggematerialer kan vurdere nøyaktigheten på kart og kartbaser kan vurdere eget arbeid i forhold til gjeldende regelverk, som bygningslovgivning, forskrifter, tekniske standarder, avtaler og krav til kvalitet kan vurdere energitekniske løsninger på byggkonstruksjoner og tekniske installasjoner har bransjekunnskap, kjennskap til gjennomføring av byggeprosesser, hvilke aktører som inngår og deres roller kan oppdatere sin yrkesfaglige kunnskap har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter Studenten kan gjøre rede for faglige valg, utstyr og metoder i en byggeprosess kan gjøre rede for krefter i konstruksjonselementer og kan utføre enkle statiske beregninger kan gjøre rede for krav i standarder og sertifiseringer kan reflektere over brann- og lydtekniske forhold i byggeprosjekter samt prosjektenes innvirkning på miljø og samfunn kan beregne koordinater og stikningsdata på objekter, både med tanke på innmåling og utsetting kan forholde seg til høyder, koter og nivåer på en bygge- og anleggsplass kan finne og henvise til relevant fagstoff og utføre enkle, termodynamiske og energitekniske beregninger, relatert til bygg og anleggsbransjen og aktuelle arbeidsoppgaver",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre bygg- og anleggsprosjekter i alle faser av et bygg eller anlegg, som deltaker eller leder i gruppe i tråd med etiske krav om bærekraftige bygg og anlegg og gjeldende retningslinjer kan utføre arbeidet etter kunders behov og myndigheters krav i en samordnet byggeprosess kan bygge relasjoner med fagfeller innen bygg- og anleggsbransjen og på tvers av fag, samt med byggherrer og myndigheter for å utvide egen kunnskap kan utveksle synspunkter med andre med bakgrunn innenfor bygg- og anleggsbransjen og delta i diskusjoner om optimale løsninger på utfordrende bygg- og anleggsprosjekter kan bidra til organisasjonsutvikling ved å følge med på ny teknologi innen bygg- og anleggsfaget"
      }
    },
    {
      "id": "00TB00E EITKBYFH24",
      "title": "Byggesaken",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00TB00E-EITKBYFH24/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om begreper, prosesser og verktøy som benyttes i alle faser av byggesaker, fra søknadsprosedyrer til kontraktsskriving og oppfølging av HMS har kunnskap om aktuelle krav til godkjennings-, sertifiserings- og kontrollordninger har kunnskap om innholdet i «40-timers» verneombuds kurs dokumentert med eget kursbevis har gjennomført førstehjelps- og LHR kurs har kunnskap om aktuelle lover, forskrifter, vedtekter og standarder innen byggesaker har kunnskap om anbudsprosessen og kontraktsinngåelse har kunnskap om kvalitet og HMS som en viktig del av all prosjektering, planlegging og utførelse innen byggesaker har kunnskap om registrering og oppfølging av avvik i en byggesak kan vurdere eget arbeid i forhold til gjeldende normer og krav har kunnskap om byggebransjen og kjennskap til søknadsprosesser, anbudsrunder og kontraktsskriving og om hvordan bransjen forholder seg til kvalitetsstyring og HMS kan oppdatere sin kunnskap innen byggesaker ved å følge med på nye krav og retningslinjer i byggebransjen",
        "skills": "Ferdigheter Studenten kan gjøre rede for søknadsprosedyrer, anbudsprosesser og kontraktsinngåelse i en byggesak kan gjøre rede for krav i standarder og sertifiseringer som angår kvalitet og HMS i byggesaker kan utøve funksjon som verneombud kan reflektere over egen faglig utøvelse i byggesaker og justere denne under veiledning kan finne og henvise til informasjon og fagstoff angående byggesaker og aktuelle arbeidsoppgaver",
        "competence": "Generell kompetanse Studenten kan planlegge og utarbeide søknad om byggetillatelse for aktuelle tiltaksklasser alene og som deltaker i gruppe i tråd med etiske krav, aktuelle lover, vedtekter, standarder og forskrifter kan planlegge og følge opp anbud, tilbud, kontrakter, HMS/KS-krav i en byggesak alene og som deltaker i gruppe i tråd med etiske krav og retningslinjer for å ivareta kontraktsmessige forpliktelser og rettigheter kan utarbeide og følge opp en KS/SHA-plan etter godkjennings-, sertifiserings- og kontrollordninger kan utføre arbeidet etter kunders behov og myndigheters krav i en byggesak kan bygge relasjoner med fagfeller innen bygg- og anleggsbransjen og på tvers av fag, samt med byggherrer og myndigheter for å utvide egen kunnskap angående byggesaker kan utveksle synspunkter med andre med bakgrunn innenfor bygg- og anleggsbransjen og delta i diskusjoner om utfordringer i byggesaker kan bidra til organisasjonsutvikling ved å følge med på nye krav og retningslinjer i byggesaker"
      }
    },
    {
      "id": "00TB01F EITKBYFH24",
      "title": "Konstruksjon bygg m/ faglig ledelse",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00TB01F-EITKBYFH24/2025-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om konstruksjonsløsninger på bygg i ulike materialer, som tre, stål og betong har kunnskap om hvordan en beregner laster på bygningskonstruksjoner har kunnskap om dimensjonering av enkle betongdekker, bjelker og søyler har kunnskap om aktuelle prøvemetoder har kunnskap om forskrifter for bærekonstruksjoner og brannkrav har kunnskap om gjeldende Euronormer kan vurdere konstruksjonsløsningen i forhold til gjeldende standarder for last, materialer og dimensjonering kan vurdere brannbeskyttelse i forhold til brannkrav som gjelder for bygningsdeler og bærekonstruksjoner har kunnskap om bransjen som driver med konstruksjon av bygg kan oppdatere sin kunnskap om konstruksjoner av bygg kjenner til byggkonstruksjonsbransjens historie, tradisjon, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter innen konstruksjon av bygg",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av konstruksjonsløsning ut fra tekniske og økonomiske forhold kan gjøre rede for valg av materialkvalitet til ulike konstruksjoner kan gjøre rede for hvordan en dimensjonerer konstruksjoner i tre og stål etter gjeldende standarder i tiltaksklasse 2 kan gjøre rede for hvordan man leser og tegner enkle betong- og armeringstegninger kan reflektere over hvilke løsninger som er tatt for konstruksjoner på bygg og justere disse under veiledning kan finne og henvise til informasjon og fagstoff om konstruksjoner av bygg og vurdere relevansen for et byggeprosjekt kan kartlegge konstruksjonen av et bygg og identifisere faglige problemstillinger og behov for iverksetting av tiltak",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre konstruksjonsarbeid for byggverk som deltaker eller leder av gruppe og i tråd med krav og standarder som gjelder for helse, miljø og sikkerhet kan utføre et konstruksjonsarbeid etter kundens ønsker og myndigheters krav kan bygge relasjoner med fagfeller innen konstruksjon av bygg og på tvers av fag som designere og ingeniører, samt med eksterne målgrupper kan utveksle synspunkter med andre med bakgrunn innenfor konstruksjon av bygg og delta i diskusjoner om sikker, økonomisk og miljøvennlig praksis kan bidra til organisasjonsutvikling gjennom proaktiv rapportering om eventuelle hendelser"
      }
    },
    {
      "id": "00TB01G EITKBYF24",
      "title": "Drift/Produksjon bygg m/faglig ledelse",
      "credits": 20,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00TB01G-EITKBYF24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om begreper, prosesser og verktøy som benyttes for drift og produksjon av bygg har kunnskap om metoder for å undersøke grunnens bæreevne og om hvilke fundamenter som kan benyttes har kunnskap om hvordan en kan beregne jordtrykk mot grunnmurer og enkle støttemurer har kunnskap om hvordan masse forflyttes på en sikker og effektiv måte har kunnskap om utarbeidelse av tekniske beskrivelser av bygg med grunnlag i tegninger og aktuelle Norske standarder har kunnskap om ombygging og restaurering av bygg med tanke på praktiske, estetiske, økonomiske og miljømessige krav, samt lovverk, reguleringsplaner og planer for kommunen har kunnskap om hvordan en bygge- og anleggsplass ledes og driftes, som hvordan en leder et byggemøte og hvordan en endringshåndtering gjennomføres kan vurdere om bygningsproduksjon og drift holder mål i forhold til lovverk, byggeforskrifter, HMS, bransjestandarder, avtaleverk og krav til dokumentasjon har kunnskap om bransjen innen drift og produksjon av bygg kan oppdatere sin kunnskap om drift og produksjon av bygg kjenner til byggverks historie, byggetradisjoner, byggeskikker og byggekulturen i samfunnet har innsikt i egne utviklingsmuligheter innen drift og produksjon av bygg har kunnskap om begreper, prosesser og verktøy som benyttes for stikking og innmåling på bygg og anlegg har kunnskap om praktisk utførelse av bygg- og anleggsstikking og oppbygging av et fastmerkenett",
        "skills": "Ferdigheter Studenten: kan gjøre rede for hvordan bygg produseres og driftes ut fra tekniske, estetiske og økonomiske forhold kan gjøre rede for kvaliteten på en bygningsmasse kan gjøre rede for dimensjoneringsgrunnlag for bygg, veityper og veiklasser kan reflektere over hvilke løsninger som er tatt for drift og produksjon av bygg og justere disse under veiledning kan finne og henvise til informasjon og fagstoff om drift og produksjon av bygg og vurdere relevansen for et byggeprosjekt kan kartlegge et bygg og identifisere behov for restaurering og ombygging etter byggeskikker og normer kan foreta enkel innmåling og utstikking med riktig valgt utstyr og ivareta byggets må og plassering, enten som leder eller som stikker.",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre et byggeprosjekt med tanke på drift og produksjon av bygg som deltaker eller leder av gruppe og i tråd med estetiske, økonomiske og miljømessige krav og retningslinjer kan planlegge og gjennomføre prosjekter som utbygging, ombygging og vedlikeholdsarbeid av bygg som deltaker eller leder av gruppe og i tråd med planer, tegninger og tekniske beskrivelser kan produsere eller drifte et bygg etter byggherrens ønsker og myndigheters krav kan bygge relasjoner med fagfeller innen produksjon og drift av bygg og på tvers av fag som bygningsantikvarer og arkitekter, samt med eksterne målgrupper kan utveksle synspunkter på kvalitet på bygningsmasse og driftsmessige utfordringer med andre med bakgrunn innenfor drift, vedlikehold og produksjon av bygg og delta i diskusjoner om god praksis for kommunen kan bidra til organisasjonsutvikling gjennom proaktiv rapportering om eventuelle hendelser"
      }
    },
    {
      "id": "01TB01H EITKBYFH24",
      "title": "Spesialisering med faglig ledelse: Bruk av digitale verktøy",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB01H-EITKBYFH24/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om utforming av prosjektorganisasjoner har kunnskap om fremdriftsplanlegging har kunnskap om vurdering av lønnsomhet i byggeprosjekter har kunnskap om ressursplanlegging i bygningsproduksjonen har kunnskap om IFC-standarden har kunnskap om kollisjonstesting av fremføringer i bygg har kunnskap om digitale modeller har kunnskap om veg og tunellmodeller har kunnskap om emner i kjemi- og miljøfag",
        "skills": "Ferdigheter Studenten kan gjøre rede for organisering av prosjekt kan gjøre rede for driftsoppfølging av bygg i produksjon kan gjøre rede utveksling av filer mellom ulike programmer kan gjøre rede for digital dataflyt kan reflektere over presentasjoner av måleresultater kan finne og henvise til informasjon og fagstoff om konstruksjoner av bygg og vurdere relevansen for et byggeprosjekt kan kartlegge konstruksjonen av et bygg og identifisere faglige problemstillinger og behov for iverksetting av tiltak kan kartlegge en situasjon som har med miljø og gjøre og identifisere problemstillinger innenfor tekniske fagområder og iverksette tiltak kan georeferere digitale bygningstegninger kan utføre enkel digital masseberegning",
        "competence": "Generell kompetanse Studenten kan utføre digital planlegging av utførelse av byggeprosjekter kan utføre 3D-modellering av bygg med justering av tegninger og dokumentasjon kan planlegge og utføre miljøtiltak for å sikre en miljømessig forsvarlig drift, alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer"
      }
    },
    {
      "id": "01TX00H EITKFRE",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H-EITKFRE/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om hvordan man skriver en prosjektrapport har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt har kunnskap om sammenhengen mellom teori og praksis kan vurdere eget prosjekt i forhold til gjeldende normer og krav kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av tema for hovedprosjekt kan identifisere, kartlegge og vurdere en faglig problemstilling kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat kan skrive en prosjektrapport kan drøfte sammenhengen mellom teori og praksis kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt kan benytte IKT-verktøy for prosjektstyring, og innenfor temaer og problemstillinger der programvarebruk er relevant/påkrevd",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    }
  ]
}