{
  "study_programs": [
    {
      "id": "Cybersikkerhet - 15",
      "title": "Cybersikkerhet",
      "description": "Cybersikkerhet er for deg som vil forstå trusselbildet og vite hvordan du faktisk sikrer systemer i praksis. På 16 uker bygger du grunnleggende kompetanse i nettverk, sikkerhet og hendelseshåndtering – og lærer å omsette teori til konkrete tiltak som beskytter data og tjenester.",
      "study_category": "IT og data",
      "study_location": {
        "0": "Kongsberg"
      },
      "study_type": {
        "5": "Samlingsbasert ca. 16 uker"
      },
      "credits": 15,
      "language": "Norsk",
      "level": "Enkeltemne",
      "why_choose": "Digitale angrep rammer alt fra små virksomheter til kritisk infrastruktur. Derfor trengs fagarbeidere som kan vurdere risiko, oppdage sårbarheter og sette inn riktige mottiltak. I dette emnet får du praktisk trening i å beskytte nettverk og enheter, forstå hva som skjer når noe går galt, og bidra til tryggere drift i egen organisasjon. Du får verktøyene som gjør deg relevant i et arbeidsliv med økende behov for sikkerhetskompetanse.\nDette studiet er en del av | Industrifagskolen | .",
      "what_learn": "Du lærer kjerneprinsippene i cybersikkerhet, hvordan nettverk er bygget opp og hvor sårbarheter oppstår. Du jobber med konkrete verktøy for å herde systemer, teste tiltak og oppdage uønskede hendelser. Dette er praksisnær læring som styrker dømmekraften din i ekte situasjoner.\nEmnet består av tre temaer på til sammen 15 studiepoeng. Klikk på et tema for å gå til emneplanen og for å finne ut mer hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger Emnet gjennomføres som nettbasert deltidsløp med fysiske samlinger ved studiested Kongsberg. Samlingene holdes vanligvis flere ganger i løpet av emneperioden og kan vare inntil én arbeidsuke. Mellom samlingene følger du nettundervisning på kveldstid med forelesninger, veiledning og samarbeid i Teams. Oppstart Uke 4, mandag 19.januar (fysisk samling) Nettundervisning Onsdager kl 17:30 - 20:00 Fysiske samlinger Uke 4 - Mandag - fredag, kl 08:15 - 15:45 Uke 21 - Tirsdag - fredag, kl 08:15 - 15:45 Obligatorisk oppmøte Samlingene har oppmøteplikt. Du må delta på minst 80 % for å få sluttvurdering. Ved fravær er du selv ansvarlig for å ta igjen tapt læring gjennom selvstudium. Arbeidskrav og vurdering Underveis leverer du 4-5 arbeidsoppdrag. Minst to er individuelle og resten gjennomføres i gruppe. Arbeidskrav vurderes til godkjent/ikke godkjent og inngår i totalvurderingen for å få en avsluttende vurdering med karakter. Det er ikke eksamen i emnet; når emnet er bestått får du karakterutskrift. Studenter som kun fullfører arbeidskrav uten avsluttende vurdering får kursbevis.",
      "police_certificate": null,
      "career_opportunities": "Kompetansen du bygger gjør deg tryggere i arbeidet med å forebygge, oppdage og håndtere sikkerhetshendelser. Du lærer å vurdere risiko, herde systemer og dokumentere tiltak på en faglig og etisk bevisst måte. Dette styrker rollen din i drift, utvikling eller supportmiljøer, og gjør deg til en nyttig ressurs i tverrfaglige team som jobber med digital sikkerhet i kommune, skole, industri, teknologibedrifter og andre virksomheter der tilgjengelighet, integritet og konfidensialitet er avgjørende.",
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Studiekoordinator: | Helene Eikefjord – e-post: | heleneeik@afk.no | Du kan også | melde din interesse i dette skjemaet | for en uforpliktende prat om dine muligheter.",
      "study_url": "https://fagskolen-viken.no/studier/it-og-data/cybersikkerhet"
    }
  ],
  "courses": []
}