{
  "study_programs": [
    {
      "id": "Demens og alderspsykiatri - 60",
      "title": "Demens og alderspsykiatri",
      "description": "Demens og alderspsykiatri er videreutdanningen for deg som jobber med eldre og ønsker trygghet i møte med mennesker med demens, psykiske lidelser og sammensatte behov. Du lærer å observere, vurdere og følge opp på en faglig og etisk trygg måte – og bidra til mer personsentrert omsorg for både den eldre og pårørende.",
      "study_location": "Kjeller (Samlingsbasert 2 år)",
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Eldre med demens eller psykiske plager trenger trygg oppfølging, ro og mennesker rundt seg som forstår hvem de er – ikke bare diagnosen deres. Dette studiet gir deg kompetansen til å møte hver bruker der han eller hun er, med respekt for livshistorie, sykdomsbilde og pårørende.\nDu lærer å oppdage endringer tidlig, håndtere uro og utfordrende atferd på en faglig og etisk trygg måte, og bidra til verdighet og mestring i hverdagen. Kompetansen er sterkt etterspurt i helse- og omsorgstjenestene, og gjør deg til en viktig støtte både for den eldre og de pårørende. | For dette studiet er det krav om | politiattest | .",
      "what_learn": "I dette studiet lærer du å gi individuelt tilpasset pleie og omsorg til eldre med demens og psykiske lidelser – og å støtte pårørende i krevende situasjoner. Du får kunnskap om aldring, demenssykdommer, alderspsykiatri, forebygging og hvordan du kan tolke og reagere på endringer i atferd og helsetilstand.\nDu lærer også å bruke gode kommunikasjons- og veiledningsteknikker, skape trygghet i møte med uro eller angst, og samarbeide med andre faggrupper rundt pasienten. I tillegg får du innsikt i hvordan tjenestene er organisert, og hvilke rettigheter, lover og plikter som gjelder i arbeidet med eldre med sammensatte behov.\nStudiet består av seks emner på til sammen 60 studiepoeng, inkludert praksis og en fordypningsoppgave. Du søker opptak til hele utdanningen, og oppnår fagskolegrad når du har fullført.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres som nettbasert deltidsstudium med fysiske samlinger på Kjeller. Samlingene holdes vanligvis to til tre ganger per semester, og varer to til fem dager. Mellom samlingene har du fast nettundervisning én kveld i uken, kombinert med fleksibelt læringsmateriell og oppgaver i Teams. Undervisningen veksler mellom forelesninger, ferdighetstrening, refleksjon og gruppearbeid . Samlingene brukes aktivt til praktiske øvelser, diskusjoner og veiledning fra faglærere. Praksis er en obligatorisk del av studiet. Du følger turnus på praksisstedet, får veiledning underveis og bygger trygghet i møte med personer med demens og alderspsykiatriske utfordringer. Obligatorisk oppmøte Du må delta på minst 75 % av de fysiske samlingene for å få vurdert eksamen. Praksis har egne regler for oppmøte – se studieplanen for detaljer. Manglende oppmøte kan føre til at du ikke får fullført emnet. Politiattest Dette studiet krever gyldig politiattest før studiestart. Søk om politiattest når du har akseptert studieplassen. Les vår veiledning til hvordan du søker politiattest før du går videre til politiets nettsider for å sende søknaden.",
      "police_certificate": "Sjekk opptakskrav",
      "career_opportunities": "Denne videreutdanningen gjør deg tryggere i møte med eldre som har demens, alderspsykiatriske lidelser eller endret atferd. Du lærer å observere, vurdere og følge opp helsetilstand og funksjon, tilpasse miljø og kommunikasjon, og veilede både pårørende og kollegaer. For deg betyr det en mer interessant og givende arbeidshverdag der du mestrer krevende situasjoner på en bedre måte – og blir en viktig ressurs i tjenesten. Kompetansen er særlig relevant i hjemmetjenesten, omsorgsboliger, dagsenter og aktivitetstilbud, demensavdelinger, skjermede enheter, bo- og behandlingssenter og sykehjem .",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/helse/demens-og-alderspsykiatri"
    }
  ],
  "courses": [
    {
      "id": "01HH00A EIHODAF-25",
      "title": "Etikk, samhandling og kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00A-EIHODAF-25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten skal etter fullført emne ha kunnskaper om: yrkesetikk gjennom kritisk og etisk refleksjon kommunikasjon for å samhandle med brukere, foresatte, pårørende og samarbeidspartnere på en trygg og tillitsvekkende måte veiledningsteori og kunne ta imot veiledning konflikter og konflikttyper helse- og omsorgsetaters oppbygging og funksjon og forstå betydningen av å ta medansvar for tverrfaglig og tverretatlig samarbeid kunnskap om andre yrkesgrupper innen helse- og oppvekstsektoren sentrale lover og forskrifter som regulerer helse- og oppvekstetater",
        "skills": "Ferdigheter Studenten skal etter fullført emne kunne: benytte generell studieteknikk, prosjekt- og utviklingsarbeid og ha ferdigheter i IKT kommunisere og samhandle om organisering av tiltak med utgangspunkt i brukernes behov bruke kunnskaper i psykologi og sosiologi for å få større bevissthet om egen fungering for bedre å mestre samhandling med brukere, foresatte, pårørende og kollegaer ta yrkesetiske beslutninger på grunnlag av kritisk og etisk refleksjon benytte aktuelt lov- og rammeverk for helse- og oppvekstsektoren i sin egen yrkesutøvelse samarbeide og håndtere konflikter",
        "competence": "Generell kompetanse Studenten skal etter fullført emne: ha generell kompetanse om og kunne anvende sentrale lover og forskrifter som regulerer helse- og omsorgstjenestene kjenne til de utfordringer helse- og omsorgssektoren står overfor i dagens samfunn kunne gjøre nødvendige etiske og moralske vurderinger i egen yrkesutøvelse reflektere over og begrunne sitt arbeid i forhold til overordnede faglige og etiske perspektiver, samt kunne se sin egen yrkesrolle i et kritisk lys"
      }
    },
    {
      "id": "01HH50B EIHODAF-25",
      "title": "Naturlig aldring og alderdommens utfordringer",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH50B-EIHODAF-25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten skal etter fullført emne ha kunnskaper om: innovasjon i muligheter og tilbud i lokalsamfunnet som kan ha betydning for økt livskvalitet eldre menneskers situasjon i dagens samfunn lover og forskrifter som regulerer tjenesten, trygde- og pensjonsrettigheter rettssikkerheten til eldre mennesker ut ifra pasientrettighetsloven forståelse for hvordan ulike former for sorg og tap kan gi psykiske og sosiale problemer og at funksjonsevne og livskvalitet påvirkes forebyggende helsearbeid i forhold til eldre personsentrert omsorg pårørende sin situasjon",
        "skills": "Ferdigheter Studenten skal etter fullført emne kunne: forstå nettverksarbeid i et perspektiv der integrering er sentralt utvikle evne til kritisk og etisk refleksjon i forhold til å gi individrettet- og personorientert omsorg, og forstå eldre sine individuelle opplevelser av sykdom og aldring samarbeide med bruker og pårørende benytte sosialt nettverk i ulike mestringsstrategier for brukeren ha forståelse for pårørende sin situasjon evaluere tiltak sammen med pasient og pårørende og justere disse",
        "competence": "Generell kompetanse Studenten skal etter fullført emne: forstå viktigheten av å kjenne til pasientens sammensatte situasjon ved å inngå dialog med pasient og pårørende og bruke journal aktivt vurdere og identifisere den eldre sine ressurser og behov på bakgrunn av en helhetlig forståelse og kartlegging sette pasienten i sentrum inkludere pårørende i alle faser av behandlingen"
      }
    },
    {
      "id": "01HH50C EIHODAF-25",
      "title": "Demens og psykiatriske lidelser hos eldre",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH50C-EIHODAF-25/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten skal etter fullført emne ha kunnskaper om: ulike forståelsesrammer, omsorgs og behandlingsmodeller ulike typer demens ulike psykiske lidelser som rammer eldre utfordrende atferd i forbindelse med demens og psykiske lidelser symptomer, diagnostiske metoder og differensial diagnostiske utfordringer prinsipper, teorier og metoder for behandling og omsorg for personer med demens og eldre med psykiske lidelser forebyggende helsearbeid i forhold til målgruppene innovasjon og velferdsteknologi som kan møte den enkeltes brukers behov",
        "skills": "Ferdigheter Studenten skal etter fullført emne kunne: forebygge utfordrende atferd møte utfordrende adferd på en faglig og ivaretagende måte identifisere symptomer og begrunne sin oppfatning møte personer med demens og psykiske lidelser med trygghet og verdighet legge til rette for bruk av teknologi i den personsentrerte omsorg",
        "competence": "Generell kompetanse Studenten skal etter fullført emne: ha kompetanse til å møte og forstå brukeren og pårørende sin sammensatte situasjon innsikt i hvordan det er å være hjelpemottaker - den eldre sin opplevelse av demens og psykiske lidelser"
      }
    },
    {
      "id": "01HH50D EIHODAF-25",
      "title": "Organisering, system og ledelse",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH50D-EIHODAF-25/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten skal etter fullført emne ha kunnskap om: pasientforløp og aktørers rolle og ansvar veiledning og pedagogiske prinsipper utviklingsarbeid og innovasjon i helse- og omsorgssektoren",
        "skills": "Ferdigheter Studenten skal etter fullført emne kunne: anvende kunnskap om veiledning og pedagogiske prinsipper til å informere og veilede brukere og pårørende anvende kunnskap om medarbeiderskap og organisasjonskultur for å bidra til et godt arbeidsmiljø anvende metoder eller verktøy for etisk refleksjon i samarbeid med kollegaer delta i faggrupper og videreutvikle kunnskaper og ferdigheter for fagfeltet på egen arbeidsplass gjøre relevante observasjoner, dokumentere og rapportere ta initiativ og legge til rette for tverrfaglig samarbeid anvende velferdsteknologi",
        "competence": "Generell kompetanse Studenten skal etter fullført emne: kunne erkjenne og utvikle sin personlige kompetanse; kreativitet og mot, samt styrke sin evne til videre utvikling ha evne til kritisk og etisk refleksjon i utførelse av eget arbeid være bevisst verdien av brukermedvirkning ha forståelse for egen rolle i tverrfaglig team kunne ta hensyn til alle tilgjengelige tjenester for å sikre kontinuitet i behandlingen kan bidra til å utvikle arbeidsmetoder og tjenestetilbud på arbeidsplassen gjennom kunnskapsdeling, veiledning og etisk refleksjon"
      }
    },
    {
      "id": "01HH50F EIHODAF-25",
      "title": "Praksis",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH50F-EIHODAF-25/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten kan: sette teoretisk kunnskap fra utdanningen i sammenheng med praktiske ferdigheter",
        "skills": "Ferdigheter Studenten kan: se betydningen av tverrfaglig samhandling bidra aktivt med egen kompetanse ivareta eget fags særegenhet i en tverrfaglig sammenheng gi faglige begrunnelser av sin individrettede- og personorienterte omsorg i sitt arbeid med personer med demens og alderspsykiatri",
        "competence": "Generell kompetanse Studenten kan: drøfte etiske utfordringer og utvikle egen relasjonskompetanse til brukere, pårørende og kolleger"
      }
    },
    {
      "id": "01HH00B EIHODAF-25",
      "title": "Fordypningsoppgave",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00B-EIHODAF-25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten kan: tilegne seg kunnskaper gjennom fordyping innenfor et valgt tema innhente, vurdere og bearbeide teori",
        "skills": "Ferdigheter Studenten kan: systematisere, utvikle og formidle erfarings basert kunnskap vurdere og faglig begrunne ulike handlingsalternativer i sin individrettede- og personorienterte omsorg til mennesker med demens og alderspsykiatri bidra til at samarbeidet i gruppen legger til rette for at alle kan få utnyttet sin individuelle kompetanse",
        "competence": "Generell kompetanse Studenten kan: reflektere og drøfte sammenhengen mellom relevant teori og egen praksis og benytte dette i samarbeid med andre"
      }
    }
  ]
}