{
  "study_programs": [
    {
      "id": "Energirådgiver - 5",
      "title": "Energirådgiver",
      "description": "Vil du bidra til en mer bærekraftig byggenæring? Med enkeltemnet Energirådgiver får du kompetanse til å veilede enkeltpersoner, bedrifter og samfunn mot energieffektive og miljøvennlige løsninger. Studiet gir deg praktisk kunnskap og ferdigheter som er etterspurt i både privat og offentlig sektor.",
      "study_location": "Kongsberg (Samlingsbasert ca. 10 uker)",
      "credits": 5,
      "language": "Norsk",
      "level": "Enkeltemne",
      "why_choose": "Bygg og anleggsbransjen er ansvarlig for 40 prosent av både klimagassutslipp, materialbruk og energibruk. Byggebransjen trenger riktig kompetanse for å redusere klimabelastningene og nå ambisiøse klimamål. Dette studiet gir deg muligheten til å jobbe med bærekraft i praksis. Kompetansen du opparbeider er svært etterspurt i arbeidsmarkedet, og åpner dører til spennende jobber i konsulentbransjen, energiselskaper og offentlige virksomheter.\nStudiet er fleksibelt og tilrettelagt for deg som ønsker å kombinere utdanning med jobb. Undervisningen er nettbasert med samlinger, slik at du kan studere uansett hvor du bor. Innholdet er utviklet i samarbeid med aktører i byggenæringen, noe som sikrer at du får relevant og oppdatert kunnskap. Med en kort og målrettet struktur på kun 5 studiepoeng, kan du raskt styrke din kompetanse og gjøre deg attraktiv i et voksende marked.\nDette enkeltemnet er en del av utdanningsprogrammet | Bærekraft i byggenæringen | . | Utdanningen består av tre korte og fleksible emner som hver gir 5 studiepoeng, og du kan velge å ta ett, to eller alle tre. Emnene kombinerer faglig innsikt, praktiske verktøy og casearbeid utviklet i samarbeid med næringslivet. I søknadsskjemaet velger du hvilke emner du vil ta. Du kan velge mellom enkeltemnene:\nDette utdanningsprogrammet er en del av | Industrifagskolen.",
      "what_learn": "Denne fagskoleutdanningen gir deg økt kompetanse og trygghet i å planlegge og vurdere bærekraftige løsninger i bygge- og eiendomsbransjen. Du lærer å analysere energibruk, materialvalg og ressursflyt – og å foreslå tiltak som reduserer miljøpåvirkning og driftskostnader.\nGjennom studiet veksler du mellom nettbasert læring, veiledning og arbeid med oppgaver, og får tett oppfølging fra faglærere. Samlingen brukes til fordypning, praktiske øvelser og erfaringsutveksling. Studiet legger vekt på praktisk anvendelse av bærekraftige løsninger i bygg og energisystemer.\nEnkeltemnet gjennomføres som et deltidsløp over omtrent 9–10 uker, og gir 5 studiepoeng. Studiet kombinerer nettundervisning med fysisk samlingsuke ved studiested Kongsberg. Undervisningen foregår vanligvis én kveld i uken på nett (2–3 timer), kombinert med én fysisk samlingsuke ved studiestedet. Den fysiske samlingsuken kan ha varighet på inntil en arbeidsuke.",
      "teaching_format": null,
      "mandatory_attendance": null,
      "police_certificate": null,
      "career_opportunities": "Kompetansen gjør deg i stand til å bidra i utvikling, drift og vedlikehold av bygg som oppfyller dagens og fremtidens krav til energi og miljø. Du kan ta ansvar for veiledning, rådgivning og kvalitet i prosjekter der klima, energi og bærekraft står sentralt. Utdanningen er særlig relevant for arbeid i entreprenør- og byggmesterbedrifter, eiendomsforvaltning, kommunale og statlige virksomheter, energiselskaper og rådgivende ingeniørfirmaer . Du får en bred og praktisk kompetanse som gjør deg til en verdifull ressurs i overgangen til en grønnere byggenæring.",
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Studiekoordinator: | Helene Eikefjord – e-post: | heleneeik@afk.no | Du kan også | melde din interesse i dette skjemaet | , så vil vi ta kontakt med deg.",
      "study_url": "https://fagskolen-viken.no/studier/bygg-og-anlegg/baerekraft-i-byggenaeringen/energiradgiver"
    }
  ],
  "courses": []
}