{
  "study_programs": [
    {
      "id": "Helhetlig energisystemer - 5",
      "title": "Helhetlig energisystemer",
      "description": "Vil du få dyptgående innsikt i energisystemers rolle i en bærekraftig framtid? Emnet Helhetlig energisystemer gir deg kompetanse til å forstå, analysere og forbedre hvordan energi genereres, distribueres, lagres og brukes i bygg. Gjennom fleksibel, nettbasert undervisning med samlinger, utvikles du til en nøkkelressurs i overgangen til mer bærekraftige energiløsninger.",
      "study_category": "Bygg og anlegg",
      "study_location": {
        "0": "Kongsberg"
      },
      "study_type": {
        "2": "Samlingsbasert ca. 10 uker"
      },
      "credits": 5,
      "language": "Norsk",
      "level": "Enkeltemne",
      "why_choose": "Dette emnet gir deg en helhetlig forståelse av energi i bygg, fra produksjon og distribusjon til lagring og forbruk. Du lærer å identifisere og analysere energieffektive løsninger, med grunnlag i forskning og regelverk. Gjennom studiet får du inngående kunnskap om teknologier for fornybar energi og energilagring, samt bruk av digitale verktøy for energiberegning. På denne måten utvikler du ferdigheter som er etterspurt i arbeidslivet – både i privat og offentlig sektor – for å drive det grønne skiftet fremover.\nDette enkeltemnet er en del av utdanningsprogrammet | Bærekraft i byggenæringen | . | Utdanningen består av tre korte og fleksible emner som hver gir 5 studiepoeng, og du kan velge å ta ett, to eller alle tre. Emnene kombinerer faglig innsikt, praktiske verktøy og casearbeid utviklet i samarbeid med næringslivet. I søknadsskjemaet velger du hvilke emner du vil ta. Du kan velge mellom enkeltemnene:\nDette utdanningsprogrammet er en del av | Industrifagskolen.",
      "what_learn": "I dette emnet får du en helhetlig forståelse av hvordan energisystemer fungerer i bygg og hvordan de kan optimaliseres for bærekraft. Du lærer om energiflyt fra produksjon til forbruk, og hvordan ulike teknologier for fornybar energi og energilagring kan integreres i moderne bygg. Gjennom praktiske oppgaver og digitale verktøy får du ferdigheter i energiberegning og simulering, slik at du kan analysere og foreslå effektive løsninger. | Du får også kunnskap om gjeldende lover, forskrifter og standarder som regulerer energibruk, og lærer å vurdere tiltak som reduserer energiforbruk og klimagassutslipp.\nStudiet er strukturert som et kort modulfag på 5 studiepoeng over ca. 10 uker med nettbasert undervisning og fysiske samlinger på Kongsberg, noe som gir deg fleksibilitet til å kombinere utdanning med jobb. Studiet kombinerer nettundervisning med fysisk samling ved studiested Kongsberg. Undervisningen foregår vanligvis én kveld i uken på nett (2–3 timer), kombinert med én fysisk samling ved studiestedet.",
      "teaching_format": null,
      "mandatory_attendance": null,
      "police_certificate": null,
      "career_opportunities": "Bedrifter, organisasjoner og myndigheter søker kompetente fagfolk som kan bidra til å optimalisere energibruk, redusere klimafotavtrykk og legge til rette for overgang til fornybar energi. Du kan arbeide i konsulentfirmaer, entreprenørselskaper, energiselskaper eller offentlig sektor – alle steder med behov for fagpersoner som kan drive det grønne skiftet",
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Studiekoordinator: | Helene Eikefjord – e-post: | heleneeik@afk.no | Du kan også | melde din interesse i dette skjemaet | , så vil vi ta kontakt med deg.",
      "study_url": "https://fagskolen-viken.no/studier/bygg-og-anlegg/baerekraft-i-byggenaeringen/helhetlig-energisystemer"
    }
  ],
  "courses": []
}