{
  "study_programs": [
    {
      "id": "Industriell digitalisert automatisering - 10",
      "title": "Industriell digitalisert automatisering",
      "description": "Utdanningen gir fagarbeidere spisskompetanse innen automatiserte og digitaliserte løsninger. Du blir faglig oppdatert, tilegner deg kunnskap om ny teknologi og bidrar til å gjøre din arbeidsplass enda mer konkurransedyktig.",
      "study_location": "Kongsberg (Samlingsbasert ca. 10 uker) | Kjeller (Samlingsbasert 1 år) | Kongsberg (Samlingsbasert 1 år)",
      "credits": 10,
      "language": "Norsk",
      "level": "Vitnemålsgivende studie",
      "why_choose": "For å lykkes i krevende tider må vi lære av hverandre på tvers av tradisjonelle næringsgrener. Dette studiet legger vekt på digitalisering, datafangst og analyse, for å få så optimaliserte og fleksible prosesser som mulig, som vil gi ferdighetene til å kunne etablere en innovativ og smart produksjon, som gjør at bedrifter blir konkurransedyktig i eksisterende og nye produkter.",
      "what_learn": "Norsk industri trenger fagarbeidere som kan koble teknologi, data og drift, og gjøre produksjonen smartere, sikrere og mer lønnsom. Dette studiet gir deg oppdatert kompetanse der digitalisering møter praktisk automasjon.\nDu utvikler ferdigheter i å hente inn, analysere og bruke produksjonsdata til bedre beslutninger, mer fleksible prosesser og høyere kvalitet. Samtidig får du verktøyene som gjør at du kan samarbeide på tvers av fag og bidra til reell forbedring i egen bedrift.\nMålet er at du skal stå stødig i omstillingen: trygg på teknologi, bevisst på HMS og kvalitet, og i stand til å drive endring som merkes i hverdagen på gulvet.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger | Studiet tilbys som nettbasert med samlinger ved studiested Kongsberg. Hvert emne tar ca. 10 uker å gjennomføre, og består av 2-3 timers nettundervisning èn kveld i uken og èn fysisk samlingsuke med varighet inntil en arbeidsuke. Mellom samlingene arbeider du med oppgaver, veiledning og prosjektarbeid i læringsplattformen. | Fleksibel digitalisert produksjon | Hadde oppstart i uke 41 i 2025. | Stengt for opptak. | Industriell intelligens | Oppstart: | Uke 3, tirsdag 19.januar | Nettundervisning: | Tirsdager kl 19:20 - 21:00 | Fysisk samling: | Uke 8 (mandag - torsdag, kl 08:15 - 15:45) | Stengt for opptak. | Tingenes internett og stordata | Oppstart: | Uke 15 | Nettundervisning: | Tirsdager kl 18:25 - 20:05 | Fysisk samling: | Uke 18 (mandag - torsdag, kl 08:15 - 15:45) | Åpent for opptak.",
      "police_certificate": null,
      "career_opportunities": "Denne utdanningen kan bidra til at bedriften du jobber for, får et større konkuransefortrinn i smart produksjon, hvor moderne teknologi, kvalifisert arbeidskraft og verdensledende kultur på organisering av arbeidslivet er viktige suksessfaktorer. Du vil lære å planlegge, iverksette og drifte en moderne industriproduksjon.",
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Utdanningsleder: | Jøran Bergerud – e-post: joranbe@afk.no | Studiekoordinator: | Helene Eikefjord – e-post: heleneeik@afk.no | Du kan også melde din interesse i | dette skjemaet | for en uforpliktende prat om dine muligheter.",
      "study_url": "https://fagskolen-viken.no/studier/elektro/industriell-digitalisert-automatisering"
    }
  ],
  "courses": [
    {
      "id": "25TE59C EITKFDK",
      "title": "Fleksibel digitalisert produksjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TE59C-EITKFDK/2025-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | Har kunnskap om 3D modellering og anvendelsen av disse i moderne industrielle sammenhenger | har kunnskap om samhandling mellom maskiner, logistikksystemer, sentraliserte og distribuerte styresystemer og deres grensesnitt mot andre systemer | har kunnskap om autonomi i fleksible digitaliserte produksjonssystemer | har kunnskap om dynamiske systemer og materialhåndtering i automatiserte anlegg med tanke på fleksibilitet og rask omstilling | har kunnskap om roboter og CNC maskiner i en industriell sammenheng | Har kunnskap om visionsystemer, gripere, kringutstyr og andre komponenter som brukes i moderne industrielle sammenhenger | Kan beskrive menneske og maskin (robot) i fysisk interaksjon i felles arbeidsområder | har kunnskap om planlegging og simulering av fleksibel digitalisert produksjon med henblikk på kvalitet, resursoptimalisering og lønnsomhet | har kunnskap om ulike aktuelle prosesser for automatiserte produksjonsmaskineri og additiv produksjon | har kunnskaper om bruk av aktuelle automatiserte måleverktøy til bruk i kvalitetskontroll og produksjon | har kunnskap om produktutviklingsprosessen og hovedfasene i produktenes livsløp",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for 3D modellering og anvendelsen av disse i moderne industrielle sammenhenger | kan gjøre rede for samhandling mellom maskiner, logistikksystemer, sentraliserte og distribuerte styresystemer og deres grensesnitt mot andre systemer | kan gjøre rede for autonomi i fleksible digitaliserte produksjonssystemer | kan gjøre rede for dynamiske systemer og materialhåndtering i automatiserte anlegg med tanke på fleksibilitet og rask omstilling | kan gjøre rede for roboter og CNC maskiner i en industriell sammenheng | kan gjøre rede for visionsystemer, gripere, kringutstyr og andre komponenter som brukes i moderne industrielle sammenhenger | kan gjøre rede for menneske og maskin (robot) i fysisk interaksjon i felles arbeidsområder | kan gjøre rede for planlegging og simulering av fleksibel digitalisert produksjon med henblikk på kvalitet, resursoptimalisering og lønnsomhet | kan gjøre rede for ulike aktuelle prosesser for automatiserte produksjonsmaskineri og additiv produksjon | kan gjøre rede for bruk av aktuelle automatiserte måleverktøy til bruk i kvalitetskontroll og produksjon | kan gjøre rede for produktutviklingsprosessen og hovedfasene i produktenes livsløp",
        "competence": "Generell kompetanse | Kandidaten: | Kan i samarbeid med andre yrkesgrupper foreslå og planlegge forbedringer i produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som til enhver tid gjelder innenfor moderne industrielle sammenhenger og produksjon | Kan drifte et fleksibelt digitalisert produksjonsteknisk system for å optimalisere ressursbruk og lønnsomhet basert på helhetsperspektiv og etiske vurderinger | kan utveksle synspunkter og problemstillinger om fleksibel digitalisert produksjon med andre som har bakgrunn innenfor fagfeltet og delta i diskusjoner om utvikling av god praksis"
      }
    },
    {
      "id": "25TE59B EITKFDK",
      "title": "Industriell intelligens",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TE59B-EITKFDK/2025-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | Har kunnskap om relevante sensorer, aktuatorer, servoer og energitekniske komponenter som brukes i moderne industrielle prosesser | Har kunnskap om aktuelle styre- og reguleringssystemer | Kan vurdere programvarearkitekturer, rekkefølge på arbeidsoperasjoner og designkrav i industrielle styringssystemer | har bransjekunnskap om målemetoder, analyseverktøy og teknisk utstyr i forbindelse med automatiserte produksjonssystemer | har kunnskap om fysiske målinger og innstilling av PID regulatorer ved hjelp av Ziegler-Nichols første og andre metode | har kunnskap om design av brukergrensesnitt for operasjon av industrielle prosesser | har kunnskap om industriell datakommunikasjon og kan vurdere utfordringer innen datasikkerhet | har kunnskap om helhetlige dokumentasjonssystemer for industrielle automatiserte systemer",
        "skills": "Ferdigheter | Kandidaten: | Kan gjøre rede for relevante sensorer, aktuatorer, servoer og energitekniske komponenter som brukes i moderne industrielle prosesser | Kan gjøre rede for aktuelle styre- og reguleringssystemer | Kan gjøre rede for programvarearkitekturer, rekkefølge på arbeidsoperasjoner og designkrav i industrielle styringssystemer | Kan gjøre rede for målemetoder, analyseverktøy og teknisk utstyr i forbindelse med automatiserte produksjonssystemer | Kan gjøre rede for fysiske målinger og innstilling av PID regulatorer ved hjelp av Ziegler-Nichols første og andre metode | Kan gjøre rede for design av brukergrensesnitt for operasjon av industrielle prosesser | Kan gjøre rede for industriell datakommunikasjon og kan vurdere utfordringer innen datasikkerhet | Kan gjøre rede for helhetlige dokumentasjonssystemer for industrielle automatiserte systemer | Kan reflektere over egen og andres faglige utførelse innen moderne industrielle sammenhenger og implementere endringer basert på erfaring | Kan finne og henvise til teknisk informasjon og fagstoff for produkter og systemer, samt vurdere relevansen mot en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Kandidaten: | Kan i samarbeid med andre yrkesgrupper planlegge, dokumentere og drifte produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som gjelder innenfor moderne industrielle sammenhenger | Kan bygge relasjoner over egen og andres faglige utførelse innen moderne industrielle sammenhenger | Kan utveksle synspunkter og henvise til teknisk og innovativ informasjon og fagstoff om moderne industrielle sammenhenger og produksjon for produkt og systemer"
      }
    },
    {
      "id": "25TE59A EITKFDK",
      "title": "Tingenes internett og stordata",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TE59A-EITKFDK/2024-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om arkitektur for, oppbygging av og administrasjon av datanettverk som benyttes i industrielle sammenhenger | har kunnskap om grunnleggende anvendelse av databaser | har kunnskap om oppbyggingen av en PC, de ulike funksjonelle delene av maskinvaren og systemprogramvarens strukturelle oppbygging | har kunnskap om virkemåte og anvendelse av aktuelle sporingsteknologier | har kunnskap om grunnleggende prinsipper for statistikk og dens anvendelse i analyse av innsamlede data | har kunnskap om prinsippene for aktuell teknologi for datalagring, lokalt og over nettverk | har kunnskap om prinsippene for tjenester i nettskyen som dataprosessering, datalagring og programvaretjenester på tjenere i eksterne tjenerparker tilknyttet internett. | kan vurdere data innsamlet fra et produksjonsanlegg ved hjelp analyseverktøy (f.eks. regneark) til formål som for eksempel produksjonsoptimalisering og prediktivt vedlikehold. | har kunnskap om vern mot dataangrep mot et industrielt datanettverk | har kunnskap om begrepet tingenes internett, anvendelser og infrastruktur",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for arkitektur for, oppbygging av og administrasjon av datanettverk som benyttes i industrielle sammenhenger | kan gjøre rede for grunnleggende anvendelse av databaser | kan gjøre rede for oppbyggingen av en PC, de ulike funksjonelle delene av maskinvaren og systemprogramvarens strukturelle oppbygging | kan gjøre rede for virkemåte og anvendelse av aktuelle sporingsteknologier | kan gjøre rede for grunnleggende prinsipper for statistikk og dens anvendelse i analyse av innsamlede data | kan gjøre rede for prinsippene for aktuell teknologi for datalagring, lokalt og over nettverk | kan gjøre rede for prinsippene for tjenester i nettskyen som dataprosessering, datalagring og programvaretjenester på tjenere i eksterne tjenerparker tilknyttet internett. | kan gjøre rede for data innsamlet fra et produksjonsanlegg ved hjelp analyseverktøy (f.eks. regneark) til formål som for eksempel produksjonsoptimalisering og prediktivt vedlikehold. | kan gjøre rede for vern mot dataangrep mot et industrielt datanettverk | kan gjøre rede for begrepet tingenes internett, anvendelser og infrastruktur",
        "competence": "Generell kompetanse | Kandidaten: | kan i samarbeid med andre yrkesgrupper planlegge, foreslå forbedringer og drifte et system for datafangst og nettskybaserte tjenester i en industriell sammenheng | kan utføre arbeid i en moderne industriell virksomhet på tvers av fag, og med eksterne målgrupper som myndigheter og instanser ved å opprette team og nettverk | kan bygge relasjoner med fagfeller og på tvers av fag innen Tingenes Internett og Stordata | kan utveksle synspunkter innen Tingenes Internett og Stordata | kan bidra til organisasjonsutvikling i bedriften"
      }
    },
    {
      "id": "25TE59A EITKFDK",
      "title": "Tingenes Internett og Stordata",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TE59A-EITKFDK/2024-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om arkitektur for, oppbygging av og administrasjon av datanettverk som benyttes i industrielle sammenhenger | har kunnskap om grunnleggende anvendelse av databaser | har kunnskap om oppbyggingen av en PC, de ulike funksjonelle delene av maskinvaren og systemprogramvarens strukturelle oppbygging | har kunnskap om virkemåte og anvendelse av aktuelle sporingsteknologier | har kunnskap om grunnleggende prinsipper for statistikk og dens anvendelse i analyse av innsamlede data | har kunnskap om prinsippene for aktuell teknologi for datalagring, lokalt og over nettverk | har kunnskap om prinsippene for tjenester i nettskyen som dataprosessering, datalagring og programvaretjenester på tjenere i eksterne tjenerparker tilknyttet internett. | kan vurdere data innsamlet fra et produksjonsanlegg ved hjelp analyseverktøy (f.eks. regneark) til formål som for eksempel produksjonsoptimalisering og prediktivt vedlikehold. | har kunnskap om vern mot dataangrep mot et industrielt datanettverk | har kunnskap om begrepet tingenes internett, anvendelser og infrastruktur",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for arkitektur for, oppbygging av og administrasjon av datanettverk som benyttes i industrielle sammenhenger | kan gjøre rede for grunnleggende anvendelse av databaser | kan gjøre rede for oppbyggingen av en PC, de ulike funksjonelle delene av maskinvaren og systemprogramvarens strukturelle oppbygging | kan gjøre rede for virkemåte og anvendelse av aktuelle sporingsteknologier | kan gjøre rede for grunnleggende prinsipper for statistikk og dens anvendelse i analyse av innsamlede data | kan gjøre rede for prinsippene for aktuell teknologi for datalagring, lokalt og over nettverk | kan gjøre rede for prinsippene for tjenester i nettskyen som dataprosessering, datalagring og programvaretjenester på tjenere i eksterne tjenerparker tilknyttet internett. | kan gjøre rede for data innsamlet fra et produksjonsanlegg ved hjelp analyseverktøy (f.eks. regneark) til formål som for eksempel produksjonsoptimalisering og prediktivt vedlikehold. | kan gjøre rede for vern mot dataangrep mot et industrielt datanettverk | kan gjøre rede for begrepet tingenes internett, anvendelser og infrastruktur",
        "competence": "Generell kompetanse | Kandidaten: | kan i samarbeid med andre yrkesgrupper planlegge, foreslå forbedringer og drifte et system for datafangst og nettskybaserte tjenester i en industriell sammenheng | kan utføre arbeid i en moderne industriell virksomhet på tvers av fag, og med eksterne målgrupper som myndigheter og instanser ved å opprette team og nettverk | kan bygge relasjoner med fagfeller og på tvers av fag innen Tingenes Internett og Stordata | kan utveksle synspunkter innen Tingenes Internett og Stordata | kan bidra til organisasjonsutvikling i bedriften"
      }
    },
    {
      "id": "25TE59B EITKFDK",
      "title": "Industriell Intelligens",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TE59B-EITKFDK/2025-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | Har kunnskap om relevante sensorer, aktuatorer, servoer og energitekniske komponenter som brukes i moderne industrielle prosesser | Har kunnskap om aktuelle styre- og reguleringssystemer | Kan vurdere programvarearkitekturer, rekkefølge på arbeidsoperasjoner og designkrav i industrielle styringssystemer | har bransjekunnskap om målemetoder, analyseverktøy og teknisk utstyr i forbindelse med automatiserte produksjonssystemer | har kunnskap om fysiske målinger og innstilling av PID regulatorer ved hjelp av Ziegler-Nichols første og andre metode | har kunnskap om design av brukergrensesnitt for operasjon av industrielle prosesser | har kunnskap om industriell datakommunikasjon og kan vurdere utfordringer innen datasikkerhet | har kunnskap om helhetlige dokumentasjonssystemer for industrielle automatiserte systemer",
        "skills": "Ferdigheter | Kandidaten: | Kan gjøre rede for relevante sensorer, aktuatorer, servoer og energitekniske komponenter som brukes i moderne industrielle prosesser | Kan gjøre rede for aktuelle styre- og reguleringssystemer | Kan gjøre rede for programvarearkitekturer, rekkefølge på arbeidsoperasjoner og designkrav i industrielle styringssystemer | Kan gjøre rede for målemetoder, analyseverktøy og teknisk utstyr i forbindelse med automatiserte produksjonssystemer | Kan gjøre rede for fysiske målinger og innstilling av PID regulatorer ved hjelp av Ziegler-Nichols første og andre metode | Kan gjøre rede for design av brukergrensesnitt for operasjon av industrielle prosesser | Kan gjøre rede for industriell datakommunikasjon og kan vurdere utfordringer innen datasikkerhet | Kan gjøre rede for helhetlige dokumentasjonssystemer for industrielle automatiserte systemer | Kan reflektere over egen og andres faglige utførelse innen moderne industrielle sammenhenger og implementere endringer basert på erfaring | Kan finne og henvise til teknisk informasjon og fagstoff for produkter og systemer, samt vurdere relevansen mot en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Kandidaten: | Kan i samarbeid med andre yrkesgrupper planlegge, dokumentere og drifte produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som gjelder innenfor moderne industrielle sammenhenger | Kan bygge relasjoner over egen og andres faglige utførelse innen moderne industrielle sammenhenger | Kan utveksle synspunkter og henvise til teknisk og innovativ informasjon og fagstoff om moderne industrielle sammenhenger og produksjon for produkt og systemer"
      }
    },
    {
      "id": "25TE59C EITKFDK",
      "title": "Fleksibel digitalisert produksjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TE59C-EITKFDK/2025-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | Har kunnskap om 3D modellering og anvendelsen av disse i moderne industrielle sammenhenger | har kunnskap om samhandling mellom maskiner, logistikksystemer, sentraliserte og distribuerte styresystemer og deres grensesnitt mot andre systemer | har kunnskap om autonomi i fleksible digitaliserte produksjonssystemer | har kunnskap om dynamiske systemer og materialhåndtering i automatiserte anlegg med tanke på fleksibilitet og rask omstilling | har kunnskap om roboter og CNC maskiner i en industriell sammenheng | Har kunnskap om visionsystemer, gripere, kringutstyr og andre komponenter som brukes i moderne industrielle sammenhenger | Kan beskrive menneske og maskin (robot) i fysisk interaksjon i felles arbeidsområder | har kunnskap om planlegging og simulering av fleksibel digitalisert produksjon med henblikk på kvalitet, resursoptimalisering og lønnsomhet | har kunnskap om ulike aktuelle prosesser for automatiserte produksjonsmaskineri og additiv produksjon | har kunnskaper om bruk av aktuelle automatiserte måleverktøy til bruk i kvalitetskontroll og produksjon | har kunnskap om produktutviklingsprosessen og hovedfasene i produktenes livsløp",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for 3D modellering og anvendelsen av disse i moderne industrielle sammenhenger | kan gjøre rede for samhandling mellom maskiner, logistikksystemer, sentraliserte og distribuerte styresystemer og deres grensesnitt mot andre systemer | kan gjøre rede for autonomi i fleksible digitaliserte produksjonssystemer | kan gjøre rede for dynamiske systemer og materialhåndtering i automatiserte anlegg med tanke på fleksibilitet og rask omstilling | kan gjøre rede for roboter og CNC maskiner i en industriell sammenheng | kan gjøre rede for visionsystemer, gripere, kringutstyr og andre komponenter som brukes i moderne industrielle sammenhenger | kan gjøre rede for menneske og maskin (robot) i fysisk interaksjon i felles arbeidsområder | kan gjøre rede for planlegging og simulering av fleksibel digitalisert produksjon med henblikk på kvalitet, resursoptimalisering og lønnsomhet | kan gjøre rede for ulike aktuelle prosesser for automatiserte produksjonsmaskineri og additiv produksjon | kan gjøre rede for bruk av aktuelle automatiserte måleverktøy til bruk i kvalitetskontroll og produksjon | kan gjøre rede for produktutviklingsprosessen og hovedfasene i produktenes livsløp",
        "competence": "Generell kompetanse | Kandidaten: | Kan i samarbeid med andre yrkesgrupper foreslå og planlegge forbedringer i produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som til enhver tid gjelder innenfor moderne industrielle sammenhenger og produksjon | Kan drifte et fleksibelt digitalisert produksjonsteknisk system for å optimalisere ressursbruk og lønnsomhet basert på helhetsperspektiv og etiske vurderinger | kan utveksle synspunkter og problemstillinger om fleksibel digitalisert produksjon med andre som har bakgrunn innenfor fagfeltet og delta i diskusjoner om utvikling av god praksis"
      }
    },
    {
      "id": "25TE59A EITKFDK",
      "title": "Tingenes Internett og Stordata",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TE59A-EITKFDK/2024-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om arkitektur for, oppbygging av og administrasjon av datanettverk som benyttes i industrielle sammenhenger | har kunnskap om grunnleggende anvendelse av databaser | har kunnskap om oppbyggingen av en PC, de ulike funksjonelle delene av maskinvaren og systemprogramvarens strukturelle oppbygging | har kunnskap om virkemåte og anvendelse av aktuelle sporingsteknologier | har kunnskap om grunnleggende prinsipper for statistikk og dens anvendelse i analyse av innsamlede data | har kunnskap om prinsippene for aktuell teknologi for datalagring, lokalt og over nettverk | har kunnskap om prinsippene for tjenester i nettskyen som dataprosessering, datalagring og programvaretjenester på tjenere i eksterne tjenerparker tilknyttet internett. | kan vurdere data innsamlet fra et produksjonsanlegg ved hjelp analyseverktøy (f.eks. regneark) til formål som for eksempel produksjonsoptimalisering og prediktivt vedlikehold. | har kunnskap om vern mot dataangrep mot et industrielt datanettverk | har kunnskap om begrepet tingenes internett, anvendelser og infrastruktur",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for arkitektur for, oppbygging av og administrasjon av datanettverk som benyttes i industrielle sammenhenger | kan gjøre rede for grunnleggende anvendelse av databaser | kan gjøre rede for oppbyggingen av en PC, de ulike funksjonelle delene av maskinvaren og systemprogramvarens strukturelle oppbygging | kan gjøre rede for virkemåte og anvendelse av aktuelle sporingsteknologier | kan gjøre rede for grunnleggende prinsipper for statistikk og dens anvendelse i analyse av innsamlede data | kan gjøre rede for prinsippene for aktuell teknologi for datalagring, lokalt og over nettverk | kan gjøre rede for prinsippene for tjenester i nettskyen som dataprosessering, datalagring og programvaretjenester på tjenere i eksterne tjenerparker tilknyttet internett. | kan gjøre rede for data innsamlet fra et produksjonsanlegg ved hjelp analyseverktøy (f.eks. regneark) til formål som for eksempel produksjonsoptimalisering og prediktivt vedlikehold. | kan gjøre rede for vern mot dataangrep mot et industrielt datanettverk | kan gjøre rede for begrepet tingenes internett, anvendelser og infrastruktur",
        "competence": "Generell kompetanse | Kandidaten: | kan i samarbeid med andre yrkesgrupper planlegge, foreslå forbedringer og drifte et system for datafangst og nettskybaserte tjenester i en industriell sammenheng | kan utføre arbeid i en moderne industriell virksomhet på tvers av fag, og med eksterne målgrupper som myndigheter og instanser ved å opprette team og nettverk | kan bygge relasjoner med fagfeller og på tvers av fag innen Tingenes Internett og Stordata | kan utveksle synspunkter innen Tingenes Internett og Stordata | kan bidra til organisasjonsutvikling i bedriften"
      }
    },
    {
      "id": "25TE59B EITKFDK",
      "title": "Industriell Intelligens",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TE59B-EITKFDK/2025-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | Har kunnskap om relevante sensorer, aktuatorer, servoer og energitekniske komponenter som brukes i moderne industrielle prosesser | Har kunnskap om aktuelle styre- og reguleringssystemer | Kan vurdere programvarearkitekturer, rekkefølge på arbeidsoperasjoner og designkrav i industrielle styringssystemer | har bransjekunnskap om målemetoder, analyseverktøy og teknisk utstyr i forbindelse med automatiserte produksjonssystemer | har kunnskap om fysiske målinger og innstilling av PID regulatorer ved hjelp av Ziegler-Nichols første og andre metode | har kunnskap om design av brukergrensesnitt for operasjon av industrielle prosesser | har kunnskap om industriell datakommunikasjon og kan vurdere utfordringer innen datasikkerhet | har kunnskap om helhetlige dokumentasjonssystemer for industrielle automatiserte systemer",
        "skills": "Ferdigheter | Kandidaten: | Kan gjøre rede for relevante sensorer, aktuatorer, servoer og energitekniske komponenter som brukes i moderne industrielle prosesser | Kan gjøre rede for aktuelle styre- og reguleringssystemer | Kan gjøre rede for programvarearkitekturer, rekkefølge på arbeidsoperasjoner og designkrav i industrielle styringssystemer | Kan gjøre rede for målemetoder, analyseverktøy og teknisk utstyr i forbindelse med automatiserte produksjonssystemer | Kan gjøre rede for fysiske målinger og innstilling av PID regulatorer ved hjelp av Ziegler-Nichols første og andre metode | Kan gjøre rede for design av brukergrensesnitt for operasjon av industrielle prosesser | Kan gjøre rede for industriell datakommunikasjon og kan vurdere utfordringer innen datasikkerhet | Kan gjøre rede for helhetlige dokumentasjonssystemer for industrielle automatiserte systemer | Kan reflektere over egen og andres faglige utførelse innen moderne industrielle sammenhenger og implementere endringer basert på erfaring | Kan finne og henvise til teknisk informasjon og fagstoff for produkter og systemer, samt vurdere relevansen mot en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Kandidaten: | Kan i samarbeid med andre yrkesgrupper planlegge, dokumentere og drifte produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som gjelder innenfor moderne industrielle sammenhenger | Kan bygge relasjoner over egen og andres faglige utførelse innen moderne industrielle sammenhenger | Kan utveksle synspunkter og henvise til teknisk og innovativ informasjon og fagstoff om moderne industrielle sammenhenger og produksjon for produkt og systemer"
      }
    },
    {
      "id": "25TE59C EITKFDK",
      "title": "Fleksibel digitalisert produksjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TE59C-EITKFDK/2025-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | Har kunnskap om 3D modellering og anvendelsen av disse i moderne industrielle sammenhenger | har kunnskap om samhandling mellom maskiner, logistikksystemer, sentraliserte og distribuerte styresystemer og deres grensesnitt mot andre systemer | har kunnskap om autonomi i fleksible digitaliserte produksjonssystemer | har kunnskap om dynamiske systemer og materialhåndtering i automatiserte anlegg med tanke på fleksibilitet og rask omstilling | har kunnskap om roboter og CNC maskiner i en industriell sammenheng | Har kunnskap om visionsystemer, gripere, kringutstyr og andre komponenter som brukes i moderne industrielle sammenhenger | Kan beskrive menneske og maskin (robot) i fysisk interaksjon i felles arbeidsområder | har kunnskap om planlegging og simulering av fleksibel digitalisert produksjon med henblikk på kvalitet, resursoptimalisering og lønnsomhet | har kunnskap om ulike aktuelle prosesser for automatiserte produksjonsmaskineri og additiv produksjon | har kunnskaper om bruk av aktuelle automatiserte måleverktøy til bruk i kvalitetskontroll og produksjon | har kunnskap om produktutviklingsprosessen og hovedfasene i produktenes livsløp",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for 3D modellering og anvendelsen av disse i moderne industrielle sammenhenger | kan gjøre rede for samhandling mellom maskiner, logistikksystemer, sentraliserte og distribuerte styresystemer og deres grensesnitt mot andre systemer | kan gjøre rede for autonomi i fleksible digitaliserte produksjonssystemer | kan gjøre rede for dynamiske systemer og materialhåndtering i automatiserte anlegg med tanke på fleksibilitet og rask omstilling | kan gjøre rede for roboter og CNC maskiner i en industriell sammenheng | kan gjøre rede for visionsystemer, gripere, kringutstyr og andre komponenter som brukes i moderne industrielle sammenhenger | kan gjøre rede for menneske og maskin (robot) i fysisk interaksjon i felles arbeidsområder | kan gjøre rede for planlegging og simulering av fleksibel digitalisert produksjon med henblikk på kvalitet, resursoptimalisering og lønnsomhet | kan gjøre rede for ulike aktuelle prosesser for automatiserte produksjonsmaskineri og additiv produksjon | kan gjøre rede for bruk av aktuelle automatiserte måleverktøy til bruk i kvalitetskontroll og produksjon | kan gjøre rede for produktutviklingsprosessen og hovedfasene i produktenes livsløp",
        "competence": "Generell kompetanse | Kandidaten: | Kan i samarbeid med andre yrkesgrupper foreslå og planlegge forbedringer i produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som til enhver tid gjelder innenfor moderne industrielle sammenhenger og produksjon | Kan drifte et fleksibelt digitalisert produksjonsteknisk system for å optimalisere ressursbruk og lønnsomhet basert på helhetsperspektiv og etiske vurderinger | kan utveksle synspunkter og problemstillinger om fleksibel digitalisert produksjon med andre som har bakgrunn innenfor fagfeltet og delta i diskusjoner om utvikling av god praksis"
      }
    }
  ]
}