{
  "study_programs": [
    {
      "id": "Innføring i teknologifag - 5",
      "title": "Innføring i teknologifag",
      "description": "Få kompetanse som tar deg videre i teknologifagene, ved å utvikle kritisk tenkning, samarbeid og digitale ferdigheter.",
      "study_category": "Teknologi og industri",
      "study_location": {
        "0": "Kongsberg"
      },
      "study_type": {
        "1": "Samlingsbasert 6 uker"
      },
      "credits": 5,
      "language": "Norsk",
      "level": "Enkeltemne",
      "why_choose": "Studiet gir en introduksjon til teknologi, digitale verktøy og grunnleggende mekaniske beregninger, og utvikler ferdigheter innen kritisk tenkning, selvledelse og effektiv tidsplanlegging. Gjennom utdanningen utvikler studenten evne til samhandling for å arbeide i team, lede og delta i gruppeprosesser samt utvikle et arbeidsmiljø som er trygt, utfordrende og tilfredsstiller krav til HMS.\nEmnet danner et solid fundament for videre fagskolestudier innen tekniske fag og legger til rette for tverrfaglig kompetanse som er etterspurt i arbeidslivet.\nDette studiet er en del av | Industrifagskolen | .",
      "what_learn": "Innføring i teknologifag er et nettbasert enkeltemne på 5 studiepoeng som gjennomføres på deltid over 6 uker.\nStudiet er bygget opp med en kombinasjon av lærerstyrt undervisning, gruppearbeid, tverrfaglige oppgaver og prosjekter, veiledning og refleksjoner, og individuelle arbeidsoppgaver.\nDet er 2-3 timers nettbasert undervisning èn kveld i uka, og èn fysisk samling i Kongsberg med varighet på 3 dager.\nKlikk på et tema for å lese mer om hva du lærer i dette studiet.",
      "teaching_format": null,
      "mandatory_attendance": null,
      "police_certificate": null,
      "career_opportunities": null,
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Utdanningsleder | : | Jøran Bergerud – e-post: | joranbe@afk.no | Studiekoordinator | : | Helene Eikefjord – e-post: | heleneeik@afk.no | Du kan også | melde din interesse i dette skjemaet | for en uforpliktende prat om dine muligheter.",
      "study_url": "https://fagskolen-viken.no/studier/teknologi-og-industri/innforing-i-teknologifag"
    }
  ],
  "courses": []
}