{
  "study_programs": [
    {
      "id": "Innsatsleder Helse - 60",
      "title": "Innsatsleder Helse",
      "description": "Innsatsleder Helse er en videreutdanning for prehospitalt personell som ønsker formalisert kompetanse og økt trygghet i ledelse av helsetjenestens organisering ved alvorlige og større hendelser. Du styrker kompetansen din i ledelse, samhandling, beslutningstaking og beredskap – og bidrar til tryggere og mer koordinert helsehjelp når det gjelder som mest.",
      "study_category": "Helse",
      "study_location": {
        "1": "Fredrikstad"
      },
      "study_type": {
        "8": "Samlingsbasert 2 år"
      },
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Ved ulykker, kriser og større hendelser stilles det høye krav til ledelse, koordinering og raske, faglig forsvarlige beslutninger. Innsatsleder helse har en sentral rolle i å lede og organisere helsetjenestens innsats på skadestedet, og i å ivareta personell- og pasientsikkerhet i krevende situasjoner.\nDenne videreutdanningen er utviklet i tett samarbeid med arbeidslivet for å møte behovet for mer ensartet og formalisert kompetanse i rollen som innsatsleder helse. Studiet gir faglig trygghet i ledelse under press, økt forståelse for tverretatlig samvirke og styrket beredskapskompetanse.\nKompetansen er relevant både for deg som allerede har en operativ lederrolle, og for deg som ønsker videre faglig utvikling innen prehospital tjeneste og beredskapsarbeid.",
      "what_learn": "I dette studiet utvikler du helhetlig kompetanse i å lede og koordinere helsetjenestens innsats ved akutte hendelser, ulykker og kriser. Du arbeider med beslutningstaking under press, situasjonsforståelse, kommunikasjon og samhandling, med særlig vekt på rollen som Innsatsleder helse i tverretatlig samarbeid.\nUndervisningen kombinerer faglig kunnskap med erfaringsbasert læring. Du bruker egen operativ erfaring aktivt i arbeid med ledelse, beredskap, risikovurdering og samvirke med politi, brann- og redningstjeneste og andre relevante aktører. Simulering, øvelser og refleksjon inngår som sentrale læringsformer.\nStudiet gir også innsikt i juridiske og etiske rammer, organisatoriske strukturer og nasjonale prinsipper for beredskap og samvirke. Du utvikler forståelse for hvordan ledelse, kommunikasjon og menneskelige faktorer påvirker kvalitet, sikkerhet og samarbeid i operative miljøer. Studiet består av seks emner og gir totalt 60 studiepoeng. Du søker opptak til hele utdanningen, og fullført studium gir fagskolegrad. | Klikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres som nettbasert deltidsutdanning med fysiske samlinger ved studiested Fredrikstad. Undervisningen kombinerer nettbaserte læringsaktiviteter med samlinger flere ganger per semester. Mellom samlingene arbeider du med oppgaver, veiledning og refleksjon i læringsplattformen. Studiet er praksisnært og legger til rette for aktiv bruk av egen yrkeserfaring gjennom simulering, øvelser og faglige diskusjoner. Endelig plan for samlinger og undervisning publiseres på studentsiden for Fredrikstad før oppstart. Obligatorisk oppmøte Studiet kan inneholde krav til obligatorisk deltakelse i undervisning, samlinger og læringsaktiviteter. Nærmere informasjon om oppmøtekrav fremgår av emnebeskrivelsene.",
      "police_certificate": null,
      "career_opportunities": "Studiet gir faglig og operativ kompetanse til å planlegge, koordinere og lede helsetjenestens innsats ved akutte hendelser og i beredskapsarbeid. Videreutdanningen styrker evnen til å ta lederansvar i komplekse og ofte uoversiktlige situasjoner, bidra til pasientsikkerhet, og sikre effektiv samhandling med andre nødetater på skadestedet. Kompetansen er særlig relevant for operativt arbeid innen ambulansetjenesten, akuttmedisinsk beredskap, AMK-sentraler og helseforetakenes beredskaps- og samvirkearbeid, og gir et formalisert grunnlag for videre ansvar og faglig utvikling innen prehospital tjeneste.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/helse/innsatsleder-helse"
    }
  ],
  "courses": []
}