{
  "study_programs": [
    {
      "id": "Instruksjon og veiledning i bedrift - 5",
      "title": "Instruksjon og veiledning i bedrift",
      "description": "Instruksjon og veiledning i bedrift er studiet for deg som har ansvar for opplæring, innfasing eller faglig oppfølging av andre på jobb – enten det er lærlinger, nyansatte eller kollegaer. Du lærer å planlegge, gjennomføre og evaluere gode læringssituasjoner i bedriften, slik at kunnskap blir delt videre på en strukturert og trygg måte.",
      "study_location": "Kongsberg (Samlingsbasert 6 uker)",
      "credits": 5,
      "language": "Norsk",
      "level": "Enkeltemne",
      "why_choose": "Mange fagarbeidere og nøkkelpersoner får ansvar for å lære opp andre – uten å få opplæring i hvordan de skal veilede. Med dette emnet får du et faglig fundament for instruksjon og veiledning i bedrift, tilpasset praktisk arbeidshverdag.\nDu får verktøy for å skape trygge læringssituasjoner, bygge gode relasjoner og gi tilbakemeldinger som motiverer og utvikler andre. Emnet tar utgangspunkt i egen arbeidserfaring, slik at du kan jobbe direkte med situasjoner, utfordringer og læringsbehov fra din egen arbeidsplass.\nKompetansen du bygger opp styrker både din rolle i bedriften og virksomhetens evne til å ta imot lærlinger, nyansatte og omstillingsprosesser på en profesjonell måte.\nDette studiet er med i | Industrifagskolen | og er godkjent av | Industriens kompetansefond | .",
      "what_learn": "I dette studiet lærer du hva kompetanse og læring betyr i en arbeidshverdag, og hvordan motivasjon, mestring og gode rammer påvirker læringsutbyttet. Du blir kjent med sentrale begreper som læringsutbytte, vurdering for og av læring, og hvordan dette kan brukes i opplæring i bedrift.\nDu får en innføring i kommunikasjon, relasjonsbygging og grunnleggende prinsipper for instruksjon og veiledning. Gjennom praktiske oppgaver trener du på å veilede lærlinger, lærekandidater og kollegaer på en tydelig, respektfull og strukturert måte.\nStudiet gir deg også verktøy for å planlegge og gjennomføre læringsaktiviteter i egen bedrift – fra å definere mål, til å tilpasse opplæringen til ulike læringssituasjoner og følge opp utviklingen til den som skal lære.\nStudiet består av ett emne på 5 studiepoeng som inneholder tre temaer. | Klikk på et tema for å lese mer i emneplanen.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger | Studiet gjennomføres som et nettbasert tilbud med fysiske samlinger. Det er nettundervisning på kveldstid, kombinert med èn fysisk samlingsuke ved studiested Kongsberg. Den fysiske samlingsuken kan ha varighet på inntil en arbeidsuke. Den fysiske samlingsuken kan inkludere arbeid med obligatorisk arbeidskrav, som krever fysisk oppmøte. Undervisningen veksler mellom faglige innlegg, erfaringsdeling, gruppearbeid og arbeid med egne oppgaver knyttet til din arbeidshverdag. | Plan for undervisning | Oppstart: | Uke 3, onsdag 14.januar | Nettundervisning: | Onsdager i tidsrommet 17:00 - 21:00 | Fysisk samlingsuke: | Uke 4 (torsdag-fredag, kl 08:15 - 15:45), studiested Kongsberg | Studiet er lukket for opptak våren 2026",
      "police_certificate": null,
      "career_opportunities": "Denne fagskoleutdanningen gir deg økt trygghet og tydeligere rolleforståelse som instruktør og veileder i bedrift. Du lærer å planlegge, gjennomføre og følge opp opplæring på en faglig og pedagogisk bevisst måte, og bidra til at ny kompetanse blir tatt godt imot og brukt i praksis. | Kompetansen er særlig relevant for fagarbeidere, teamledere, formenn, instruktører, opplæringsansvarlige og andre som har ansvar for lærlinger, lærekandidater, nyansatte eller interne opplæringsløp. | Med dette studiet blir du en viktig ressurs i arbeidet med kompetanseutvikling i virksomheten – både ved å styrke kvaliteten på opplæringen, og ved å bidra til et læringsmiljø der ansatte opplever mestring, utvikling og tilhørighet.",
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Utdanningsleder: | Jøran Bergerud – e-post: | joranbe@afk.no | Studiekoordinator: | Helene Eikefjord – e-post: | heleneeik@afk.no | Du kan også melde din interesse i | dette skjemaet | for en uforpliktende prat om dine muligheter.",
      "study_url": "https://fagskolen-viken.no/studier/ledelse/instruksjon-og-veiledning-i-bedrift"
    }
  ],
  "courses": []
}