{
  "study_programs": [
    {
      "id": "Klima, energi og miljø i bygg (KEM) - 120",
      "title": "Klima, energi og miljø i bygg (KEM)",
      "description": "Klima, energi og miljø (KEM) er videreutdanningen for deg som vil planlegge, prosjektere og drifte tekniske installasjoner i bygg. Du lærer å levere energieffektive løsninger med godt inneklima og helhetlig systemforståelse – i tett kontakt med bransjens krav og standarder.",
      "study_category": "Bygg og anlegg",
      "study_location": {
        "0": "Kongsberg",
        "1": "Fredrikstad"
      },
      "study_type": {
        "10": "Samlingsbasert 4 år",
        "13": "Deltid 3 år"
      },
      "credits": 120,
      "language": "Norsk",
      "level": "Høyere fagskolegrad",
      "why_choose": "Bygg får stadig mer avanserte tekniske anlegg. For å nå energi- og miljømål trengs fagfolk som forstår samspillet mellom ventilasjon, varme/kulde, sanitær, automasjon og styring. Med KEM utvikler du kompetansen som gjør deg trygg i valg av løsninger, kvalitet og dokumentasjon – fra prosjektering til drift. Du lærer å vurdere tiltak i et livsløpsperspektiv, slik at bygg fungerer som planlagt, bruker mindre energi og gir godt inneklima. | Utdanningen styrker mulighetene dine i en bransje med høy etterspørsel etter praktisk, oppdatert kompetanse innen bærekraft, energioptimalisering og ITB/samordning.",
      "what_learn": "I dette studiet lærer du å planlegge, prosjektere og drifte tekniske installasjoner med vekt på energi, inneklima og helhetlig systemforståelse. Du jobber med VVS-prosjektering, automasjon/SD, ITB, energivurdering, LCC og miljøsertifisering – og bruker relevante digitale verktøy som 3D-DAK og BIM.\nUndervisningen kombinerer teori, case og oppgaver fra praksisfeltet. Du bruker egen arbeidserfaring aktivt i samarbeid og refleksjon. Studiet består av ni emner og avsluttes med et hovedprosjekt som tar utgangspunkt i reelle KEM-problemstillinger.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres nettbasert med fysiske samlinger ved studiested Kongsberg. Samlingene holdes flere ganger i løpet av hvert semester og kan vare inntil en arbeidsuke. Mellom samlingene deltar du i nettundervisning etter fastsatt plan, med forelesninger, veiledning og gruppearbeid. Oppdatert plan med detaljerte undervisningstider og samlingsuker for alle emner publiseres på studentsiden for Kongsberg før oppstart. Obligatorisk oppmøte Noen samlinger og aktiviteter kan ha obligatoriske arbeidskrav eller oppmøteplikt. Se emnebeskrivelsene i studieplanen for detaljer. Ved fravær er du selv ansvarlig for å ta igjen tapt læring gjennom selvstudium.",
      "police_certificate": null,
      "career_opportunities": "Med KEM-kompetanse kan du jobbe i entreprenør- og rådgiverfirmaer, eiendomsforvaltning og tekniske avdelinger i offentlig og privat sektor. Typiske roller er prosjektleder/assisterende prosjektleder, prosjekterende/teknisk tegner (VVS/KEM), energirådgiver, driftsleder/FDV-tekniker, kvalitets- og HMS-koordinator, ITB-/samordningsansvarlig eller faglærer/kursinstruktør . Du blir en nøkkelperson som kan samordne fag, sikre funksjon og dokumentasjon og bidra til energieffektive bygg med godt inneklima .",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/bygg-og-anlegg/klima-energi-og-miljo-i-bygg-kem"
    }
  ],
  "courses": [
    {
      "id": "01TX00A",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om realfag som redskap innen sitt fagområde. har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes kan utføre beregninger, overslag og problemløsning relevant for dimensjoneringer og andre problemstillinger innen studieretningen kan vurdere eget arbeid i henhold til matematiske og fysiske lover kan utvide sine kunnskaper og har innsikt i egne utviklingsmuligheter innen realfag. kjenner til matematikkens og fysikkens egenart og plass i samfunnet",
        "skills": "Ferdigheter Studenten: kan gjøre rede for valg av regnemetode som anvendes for å løse faglige problemer kan gjøre rede for valg av digitale verktøy som anvendes til problemløsning innen realfaglige tema kan anvende digitale hjelpemidler til å løse matematiske problemer kan vurdere resultater av beregninger, samt reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til relevant informasjon og fagstoff i formelsamlinger, tabeller og fagbøker kan kartlegge en situasjon og identifisere realfaglige problemstillinger har kjennskap til og kan anvende grunnleggende fysiske lover og fysikkens metodikk kan tolke og anvende modeller som benyttes innen matematikk og fysikk",
        "competence": "Generell kompetanse Studenten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger har innsikt i rekkevidde og begrensninger for de metoder som anvendes kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om grunnleggende kommunikasjonsteori kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde har kunnskap om sentrale retoriske begreper og virkemidler har kunnskap om kildebruk og referanseteknikk etter standard for høyere utdanning kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter har kjennskap til hvordan man organiserer og produserer tekst har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne har kunnskap om språket som verktøy for god kommunikasjon og kjenner til norsk og engelsk fagterminologi innen sitt fagområde har kunnskap om grammatikk, sjangerforståelse samt språklige, stilistiske og grafiske virkemidler i tekst.",
        "skills": "Ferdigheter Kandidaten: kan reflektere over møter mellom forskjellige arbeidslivskulturer kan bruke relevante begreper for å analysere egen og andres tekst kan reflektere over og revidere tekster kan reflektere over hvordan retorikk benyttes kan bygge opp saklig argumentasjon og bruke retoriske virkemiddel kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig kan reflektere over egen kommunikasjon i profesjonell sammenheng kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og tekstbinding kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse Kandidaten: kan kommunisere hensiktsmessig for å bidra til en inkluderende og bærekraftig organisasjonskultur kan tilpasse språk og argumentasjon etter mål og mottaker kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting behersker relevante kommunikasjonsverktøy kan kommunisere gjennom relevante tekster og kanaler kan samarbeide om tekstproduksjon kan utvise etikk og gode holdninger i arbeidslivet kan reflektere over ulike verdier og tenkemåter i samfunnet"
      }
    },
    {
      "id": "01TX00C",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak har kunnskap om lønnskostnader har kunnskaper om mål, tiltak og handlingsplaner kjenner til emnets aktuelle lover og avtaler har erfaringsbasert kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer.",
        "skills": "Ferdigheter Kandidaten: kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler kan vurdere bedriftens betalingsevne og kapitalbehov kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler kan foreta en helhetlig prisvurdering og utarbeide kalkyler kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel kan identifisere, analysere og utvikle medarbeidernes kompetanse kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse Kandidaten kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid kan kommunisere internt og eksternt og benytte digitale verktøy til dette. kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "25TB03J EITKKEK H25",
      "title": "Byggesaken for tekniske installasjoner",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TB03J-EITKKEK-H25/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har innsikt i aktuelle lover, forskrifter, vedtekter og standarder innen emnet har innsikt i aktuelle krav til godkjennings-, sertifiserings- og kontrollordninger har kunnskap om kvalitet og HMS som en viktig del av all prosjektering, planlegging og utførelse har innsikt i fysiske, organisatoriske og psykososiale arbeidsmiljøfaktorer har kunnskap om prosesser knyttet til anbud og kontraktsinngåelse har kunnskap om entrepriseformer, kontrahering og kontraktsformer har kunnskap om metodikk for styring, gjennomføring, ledelse og oppfølging av klima, energi og miljøtekniske installasjoner har kunnskap om ferdigstillelse, overlevering og sluttdokumentasjon kan vurdere eget arbeid i forhold til gjeldende normer og krav kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet",
        "skills": "Ferdigheter Studenten kan finne informasjon i akkordtariff, bedriftens lønnssystem samt materialpriser i forbindelse med kalkulasjon og kostnadsberegning av rør- og ventilasjonstekniske installasjoner kan anvende aktuelle standarder for anbud og tilbud samt kontrakter for aktuelle prosjekter kan finne og henvise til informasjon om KS/SHA/HMS-plan etter godkjennings-, sertifiserings- og kontrollordninger kan kartlegge en situasjon og vurdere og identifisere behov for tiltak i forhold til avvik fra KS/SHA/HMS-plan reflektere over egen og andres sikkerhet på en bygge/anleggsplass kan anvende IT-baserte prosjektstyringsverktøy som hjelp i planlegging og oppfølging av aktiviteter, ressurser, kostnader og tidsforbruk i bransje-relaterte prosjekter kan gjøre rede for sine faglige valg i prosjektgjennomføring og ledelse, inkludert bruk av prosjektstyringsverktøy, produksjonsplanlegging, etikk, HMS, søknadsprosedyrer, anbudsprosesser og kalkulasjon i tråd med gjeldende lover, forskrifter og standarder.",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre søknad for tillatelser i aktuelle tiltaksklasser iht. lover, forskrifter og veiledninger relatert til bransje kan utføre kalkulasjon og kostnadsberegning av rør- og ventilasjonstekniske installasjoner for private og profesjonelle oppdragsgivere, herunder utarbeidelse av anbud og tilbud kan planlegge og følge opp anbud, tilbud, kontrakter, HMS/KS-krav i en byggesak alene og som deltaker i gruppe i tråd med etiske krav og retningslinjer for å ivareta kontraktsmessige forpliktelser og rettigheter kan planlegge og gjennomføre implementering av en KS/SHA/HMS-plan etter godkjennings-, sertifiserings- og kontrollordninger kan utføre arbeidet etter kunders behov og myndigheters krav i en byggesak kan bygge relasjoner med fagfeller innen bygg- og anleggsbransjen og på tvers av fag, samt med byggherrer og myndigheter for å utvide egen kunnskap angående byggesaker kan utveksle synspunkter med andre med bakgrunn innenfor bygg- og anleggsbransjen og delta i diskusjoner om utfordringer i byggesaker kan bidra til organisasjonsutvikling ved å følge med på nye krav og retningslinjer i byggesaker"
      }
    },
    {
      "id": "25TB03K EITKKEK H25",
      "title": "Energi og miljø i bygg",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TB03K-EITKKEK-H25/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om energieffektive bygningskonsepter med lav miljøbelastning og godt inneklima har kunnskap om inneklima, byggkonstruksjoner, byggematerialer og VVS-tekniske installasjoner i bygg har kunnskap om rett energibruk i bygg og om hva som må til for å skape et godt inneklima har kunnskap om termodynamikk og energi- og klimatekniske beregninger har kunnskap om energimerking, metoder for energivurdering, måletekniske metoder og utstyr som benyttes i VVS-fagene har innsikt i prinsipper for energi- og miljøledelse og energioppfølgingssystemer har kunnskap om samkjøring av de tekniske anleggene slik at det sikres optimal drifts-økonomi og et godt inneklima har innsikt i gjeldende regelverk, tekniske standarder, avtaler og krav til kvalitet som gjelder innen VVS-fagene, og kan vurdere eget arbeid i forhold til regelverket Kan vurdere eget arbeid i forhold til gjeldende normer og krav innen energi- og miljøeffektive bygg, inneklima, byggkonstruksjoner og bygningstekniske installasjoner, samt bruke dokumentasjonsverktøy og DAK på en faglig forsvarlig måte. Kjenner til bransjens og yrkets historie, tradisjoner, egenart og plass i samfunnet, og forstår hvordan disse påvirker utviklingen av bærekraftige byggeløsninger, tekniske installasjoner og bruk av digitale verktøy i planlegging og dokumentasjon.",
        "skills": "Ferdigheter Studenten kan kartlegge en situasjon, vurdere, identifisere, planlegge og iverksette tiltak som optimaliserer energibruk, reduserer miljøbelastning og sikrer tilfredsstillende inneklima i bygninger kan finne fram og henvise til relevant fagstoff og utføre VVS-tekniske målinger og grunnleggende energitekniske beregninger i samsvar med gjeldende regelverk kan anvende bygg-, og VVS-tekniske tegninger kan anvende relevant IT verktøy, herunder bransjerelevant DAK-verktøy kan anvende metoder for energi- og miljøledelse og energioppfølgingssystemer kan reflektere over brann, fukt og lydtekniske forhold i byggverk samt prosjektenes innvirkning på miljø og samfunn kan gjøre rede for sine faglige valg innen de aktuelle disiplinene kan reflektere over egen faglig utøvelse og justere denne under veiledning i tråd med bedriftens retningslinjer",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre et prosjekt med tanke på energi og miljø i bygg, som deltaker eller leder av gruppe og i tråd med etiske krav og retningslinjer kan utføre arbeidet med utarbeidelse av enkle bransjerelaterte tegninger ved hjelp av et relevant DAK-verktøy kan utføre et prosjekt etter kunders ønske og myndigheters krav kan bygge relasjoner med fagfeller innen energi og miljø av bygg og på tvers av fag med involverte aktører kan utveksle synspunkter med andre med bakgrunn innenfor energi og miljø av bygg og delta i diskusjoner om nasjonale og globale klimautfordringer og stadig skjerpede krav til energieffektive tekniske installasjoner i bygg, uten at strenge energikrav skal gå utover funksjon og inneklima kan bidra til organisasjonsutvikling gjennom å formidle energiteknisk kompetanse"
      }
    },
    {
      "id": "00TB03K EITKKEK H25",
      "title": "VVS-prosjektering og systemforståelse",
      "credits": 25,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00TB03K-EITKKEK-H25/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om prosjektering av sanitæranlegg, varmeanlegg, brannslokkeanlegg, kuldesystemer og varmepumper, luftbehandling og komfortkjøling har kunnskap om VVS-teknisk prosjektering av energioptimale systemløsninger, regulering og lokal energiproduksjon kan vurdere eget arbeid i forhold til regelverk og standarder som angir hvordan VVS-tekniske anlegg skal prosjekteres har bransjekunnskap om behovet for tverrfaglig koordinering mellom egne fag samt mellom egne fag og andre fag i byggeprosjekter har innsikt i behovet for kontinuerlig informasjonsutveksling mellom aktørene i et prosjekteringsoppdrag har innsikt i bygningsinformasjonsmodellering (BIM) har kunnskap om krav til prosjektmaterialet har innsikt i tilgjengelighet og bruk av nøkkeltall for priskalkyler av VVS-tekniske anlegg kan oppdatere sin yrkesfaglige kunnskap om VVS-prosjektering kjenner til VVS-bransjens historie, egenart og plass i samfunnet",
        "skills": "Ferdigheter Studenten kan gjøre rede for sine faglige valg vedr. systemløsninger innen VVS- og energitekniske anlegg for forskjellige typer bygg/bruksområder kan gjøre rede for sine faglige valg i arbeidet med krav til energi, effekt, inneklima og øvrige relevante forskriftskrav. kan gjøre rede for sine faglige valg ved bruk av verktøy, materialer, teknikker og uttrykksformer innen design, dimensjonering og dokumentasjon av VVS-tekniske anlegg innenfor tiltaksklasse 2 etter plan- og bygningsloven. kan anvende relevante VVS-relaterte modelleringsprogrammer som verktøy for design, dimensjonering og andre relevante beregninger kan reflektere over egne faglige valg innenfor VVS- og energitekniske løsninger kan gjøre rede for sine faglige valg i utarbeidelse av VVS-tegninger for montasje og anbudsberegning i henhold til Norsk Standard. kan gjøre rede for sine faglige valg ved bruk av systemskjemaer for VVS- og energitekniske anlegg, samt ved utarbeidelse av funksjons- og reguleringsbeskrivelser. kan anvende relevante faglige verktøy for fremstilling av utsparingstegninger for sine anlegg kan gjøre rede for sine faglige valg ved utarbeidelse av VVS-tekniske beskrivelser for anbudsberegning i samsvar med Norsk Standard. kan kartlegge en situasjon og vurdere og identifisere behov for iverksetting av tiltak i tråd med bedriftens kvalitetssikringssystem gjennom prosjekteringsprosessen kan reflektere over egen faglig utøvelse innen VVS-prosjektering og justere denne under veiledning i tråd med bedriftens retningslinjer kan finne informasjon og fagstoff som er relevant for enkle kostnadskalkyler av prosjekterte anlegg basert på nøkkeltall fra bransjen",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre arbeidsoppgaver innen prosjektering, kalkulasjon og gjennomføring av VVS-tekniske installasjoner alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan utføre kvalifisert VVS-arbeid for alle bygg, innbefattet klima, energi og miljø, etter samfunnets behov har forståelse for yrkes- og bransjeetiske prinsipper ved representasjon av sitt firma i korrespondanse og møter med andre aktører i prosjekter, med fokus på gjennomgang, avklaring og justering av egne og andres forslag til løsninger kan bygge relasjoner med fagfeller innen VVS-prosjektering og systemforståelse og på tvers av fag med involverte aktører kan utveksle synspunkter med andre med bakgrunn innenfor VVS-prosjektering og systemforståelse og delta i diskusjoner om utvikling av god praksis, med mål om optimal samkjøring av alle installasjoner som påvirker inneklimaet"
      }
    },
    {
      "id": "01TB03F EITKKEK H25",
      "title": "Styring og automatisering av bygningstekniske installasjoner",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB03F-EITKKEK-H25/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om aktuelle elektriske anlegg, reguleringsteknikk-, strategier og utstyr (automatikk) inkludert sentral driftskontroll (SD-anlegg) i VVS-tekniske installasjoner har kunnskap om sammenheng mellom regulering av hydrauliske systemer, elektrisk utstyr, automatikkskjema og databuss- systemer som inngår i automatikkanlegg i de klimatekniske anleggene i bygg har innsikt i aktuelt regelverk for elektriske anlegg, herunder hvilke arbeider som kan utføres av andre enn elektroforetak registrert i el. virksomhetsregisteret hos Direktoratet for samfunnssikkerhet og beredskap (DSB) har kunnskap om tverrfaglig systemforståelse for de klimatekniske anleggene i bygg har kunnskap om elektrotekniske skjemaer med utgangspunkt i funksjonsbeskrivelser har innsikt i tekniske krav til elektriske anlegg, avhengig av hvilken type spenningssystem og driftsspenning det elektriske anlegget er tilkoblet, med hensyn til blant annet risiko ved betjening av utstyr i fordelingstavler har kunnskap om bus-systemer og protokoller brukt i SD-anlegg og automasjon for VVS- og klimatekniske anlegg. har innsikt i ulike typer vern i elektriske installasjoner, startstrømmer og metoder for mykstart og turtallsregulering av motorer samt regulering av annet effektkrevende utstyr (eks varmebatteri), for å oppnå optimal driftssituasjon og vurdere risiko ved betjening av disse har kunnskap om maskindirektivets forskrifter som gjelder bygging av maskiner og CE merking kan vurdere eget arbeid i forhold til gjeldende normer og krav innen elektroteknikk, reguleringsteknikk, automatisering, SD-anlegg og teknisk integrasjon, med fokus på funksjon, sikkerhet og samspill mellom ulike bygningsinstallasjoner. Kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet, og forstår hvordan utviklingen av ITB-løsninger, automatisering og tekniske grensesnitt har påvirket moderne byggteknikk og tverrfaglig samarbeid.",
        "skills": "Ferdigheter Studenten kan gjøre rede for sine faglige valg ved kartlegging av situasjoner og vurdering av risiko i planlegging av arbeider og målinger på elektriske anlegg, samt begrunne hvilke autoriserte aktører som lovlig kan utføre utbedring og feilretting. kan gjøre rede for sine faglige valg i forbindelse med tegning av enkle elektrotekniske skjemaer med utgangspunkt i funksjonsbeskrivelser kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling, samt foreslå forbedringstiltak basert på faglige vurderinger. kan anvende krav til fordelingstavler og styreredskap med hensyn til om disse er konstruert for sakkyndig eller usakkyndig betjening kan anvende virksomhetens internkontrollsystem i forhold til rutiner og prosedyrer kan gjøre rede for sine faglige valg ved kartlegging av situasjoner og vurdering av tiltak som reduserer risiko for personskade under drift, vedlikehold og reparasjon av VVS-teknisk automatikk og styringssystemer. kan anvende relevante forskrifter med hjemmel i El-tilsynsloven, herunder konsekvensene ved å bryte forskriftene kan gjøre rede for sine faglige valg ved utarbeidelse av funksjonsbeskrivelser som sikrer at automatikken i VVS- og klimatekniske anlegg fungerer etter hensikten.",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre et anlegg innen elektro og automatisering, som automatikkanlegg inkludert SD-anlegget, som deltaker eller leder av gruppe og i tråd med etiske krav og retningslinjer kan planlegge og gjennomføre et prosjekt med grensesnitthåndtering mellom ulike fag som inngår i VVS- og klimateknisk entreprise (teknisk integrator - ITB) alene og som deltaker i gruppe i tråd med krav til godt inneklima, redusert energibruk og reduserte driftskostnader i bygget kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer, ved å gjennomføre prosjekter i henhold til kundens ønsker og myndigheters krav, og kontrollere at arbeidet er utført i tråd med bestilling. kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver ved å utarbeide behovsspesifikasjoner for automatikkanlegg, inkludert SD-anlegg, samt planlegge og bestille enkle arbeider. kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver ved å tegne elektrotekniske skjemaer. kan utføre aktuelle elektriske målinger på klimatekniske anlegg på en risikofri og sikker måte og gjøre rede for måleresultatene for aktuelle oppdragsgivere kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver ved å gjennomføre visuelt ettersyn og kontroll av elektriske installasjoner, automatikk og styringssystemer før oppstart, ved igangkjøring, overlevering og under drift. kan bygge relasjoner med fagfeller innen elektro og automatisering og på tvers av fag med involverte aktører kan utveksle synspunkter med andre med bakgrunn innenfor elektro og automatisering og delta i diskusjoner om utvikling av god praksis, med mål om optimal samkjøring av alle installasjoner som påvirker inneklimaet"
      }
    },
    {
      "id": "01TB03G EITKKEK H25",
      "title": "VVS og klimatekniske installasjoner",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB03G-EITKKEK-H25/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har innsikt i aktuelle lover, forskrifter, vedtekter og standarder innen emnet har kunnskap om entrepriseformer, kontrahering og kontraktsformer har kunnskap om prosesser knyttet til anbud og kontraktsinngåelse har innsikt i aktuelle krav til godkjennings-, sertifiserings- og kontrollordninger har kunnskap om kvalitetsstyring og HMS som en viktig del av all prosjektering, planlegging og utførelse har innsikt i fysiske, organisatoriske og psykososiale arbeidsmiljøfaktorer har kunnskap om metodikk for styring, gjennomføring, ledelse og oppfølging av klima, energi og miljøtekniske installasjoner har kunnskap om ferdigstillelse, prøvedrift, overlevering og sluttdokumentasjon har kunnskap om innhold i rutiner for opplæring av driftspersonell har kunnskap om aktuelle bransjen kan vurdere eget arbeid i forhold til gjeldende normer og krav innen miljøsertifisering, LCC og bærekraft, samt i forbindelse med ferdigstilling, prøvedrift, overtakelse, sluttdokumentasjon og FDVU-oppgaver. kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet, og forstår hvordan digitale verktøy som 3D-DAK og BIM har påvirket utviklingen av bærekraftige løsninger og effektiv forvaltning, drift og vedlikehold i byggenæringen.",
        "skills": "Ferdigheter Studenten kan finne informasjon i akkordtariff, bedriftens lønnssystem samt materialpriser i forbindelse med kalkulasjon og kostnadsberegning av rør- og ventilasjonstekniske installasjoner kan gjøre rede for sine faglige valg ved bruk av aktuelle standarder for anbud, tilbud og kontrakter i relevante prosjekter. kan finne og henvise til informasjon om KS/SHA/HMS-plan etter godkjennings-, sertifiserings- og kontrollordninger kan kartlegge en situasjon og vurdere og identifisere behov for tiltak i forhold til avvik fra KS/SHA/HMS-plan herunder rutiner for avvikshandtering og dokumentasjon reflektere over egen og andres sikkerhet på en bygge/anleggsplass kan anvende IT-baserte kalkulasjons og prosjektstyringsverktøy som hjelp i planlegging og oppfølging av aktiviteter, ressurser, kostnader og tidsforbruk i bransje-relaterte prosjekter",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre søknader for tillatelser i aktuelle tiltaksklasser i henhold til lover, forskrifter og veiledninger relatert til bransje herunder krav til innhold i søknad om tillatelse til tiltak og erklæring om ansvarsrett kan utføre kalkulasjon og kostnadsberegning av rør- og ventilasjonstekniske installasjoner for private og profesjonelle oppdragsgivere, herunder utarbeidelse av anbud og tilbud kan planlegge og følge opp anbud, tilbud, kontrakter, HMS/KS-krav i en byggesak alene og som deltaker i gruppe i tråd med etiske krav og retningslinjer for å ivareta kontraktsmessige forpliktelser og rettigheter kan planlegge og gjennomføre implementering av en KS/SHA/HMS-plan etter godkjennings-, sertifiserings- og kontrollordninger kan utføre arbeidet etter kunders behov og myndigheters krav i en byggesak kan bygge relasjoner med fagfeller innen bygg- og anleggsbransjen og på tvers av fag, samt med byggherrer og myndigheter for å utvide egen kunnskap angående byggesaker kan utveksle synspunkter med andre med bakgrunn innenfor bygg- og anleggsbransjen og delta i diskusjoner om utfordringer i byggesaker kan bidra til kultur og organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00H",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H/2028-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om hvordan man skriver en prosjektrapport har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt har kunnskap om sammenhengen mellom teori og praksis kan vurdere eget prosjekt i forhold til gjeldende normer og krav kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av tema for hovedprosjekt kan identifisere, kartlegge og vurdere en faglig problemstilling kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat kan skrive en prosjektrapport kan drøfte sammenhengen mellom teori og praksis kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    },
    {
      "id": "01TX00A",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om realfag som redskap innen sitt fagområde. har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes kan utføre beregninger, overslag og problemløsning relevant for dimensjoneringer og andre problemstillinger innen studieretningen kan vurdere eget arbeid i henhold til matematiske og fysiske lover kan utvide sine kunnskaper og har innsikt i egne utviklingsmuligheter innen realfag. kjenner til matematikkens og fysikkens egenart og plass i samfunnet",
        "skills": "Ferdigheter Studenten: kan gjøre rede for valg av regnemetode som anvendes for å løse faglige problemer kan gjøre rede for valg av digitale verktøy som anvendes til problemløsning innen realfaglige tema kan anvende digitale hjelpemidler til å løse matematiske problemer kan vurdere resultater av beregninger, samt reflektere over egen faglig utøvelse og justere denne under veiledning kan finne og henvise til relevant informasjon og fagstoff i formelsamlinger, tabeller og fagbøker kan kartlegge en situasjon og identifisere realfaglige problemstillinger har kjennskap til og kan anvende grunnleggende fysiske lover og fysikkens metodikk kan tolke og anvende modeller som benyttes innen matematikk og fysikk",
        "competence": "Generell kompetanse Studenten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger har innsikt i rekkevidde og begrensninger for de metoder som anvendes kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om grunnleggende kommunikasjonsteori kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde har kunnskap om sentrale retoriske begreper og virkemidler har kunnskap om kildebruk og referanseteknikk etter standard for høyere utdanning kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter har kjennskap til hvordan man organiserer og produserer tekst har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne har kunnskap om språket som verktøy for god kommunikasjon og kjenner til norsk og engelsk fagterminologi innen sitt fagområde har kunnskap om grammatikk, sjangerforståelse samt språklige, stilistiske og grafiske virkemidler i tekst.",
        "skills": "Ferdigheter Kandidaten: kan reflektere over møter mellom forskjellige arbeidslivskulturer kan bruke relevante begreper for å analysere egen og andres tekst kan reflektere over og revidere tekster kan reflektere over hvordan retorikk benyttes kan bygge opp saklig argumentasjon og bruke retoriske virkemiddel kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig kan reflektere over egen kommunikasjon i profesjonell sammenheng kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og tekstbinding kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse Kandidaten: kan kommunisere hensiktsmessig for å bidra til en inkluderende og bærekraftig organisasjonskultur kan tilpasse språk og argumentasjon etter mål og mottaker kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting behersker relevante kommunikasjonsverktøy kan kommunisere gjennom relevante tekster og kanaler kan samarbeide om tekstproduksjon kan utvise etikk og gode holdninger i arbeidslivet kan reflektere over ulike verdier og tenkemåter i samfunnet"
      }
    },
    {
      "id": "01TX00C",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak har kunnskap om lønnskostnader har kunnskaper om mål, tiltak og handlingsplaner kjenner til emnets aktuelle lover og avtaler har erfaringsbasert kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer.",
        "skills": "Ferdigheter Kandidaten: kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler kan vurdere bedriftens betalingsevne og kapitalbehov kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler kan foreta en helhetlig prisvurdering og utarbeide kalkyler kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel kan identifisere, analysere og utvikle medarbeidernes kompetanse kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse Kandidaten kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid kan kommunisere internt og eksternt og benytte digitale verktøy til dette. kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "25TB03J EITKKEK H25",
      "title": "Byggesaken for tekniske installasjoner",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TB03J-EITKKEK-H25/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har innsikt i aktuelle lover, forskrifter, vedtekter og standarder innen emnet har innsikt i aktuelle krav til godkjennings-, sertifiserings- og kontrollordninger har kunnskap om kvalitet og HMS som en viktig del av all prosjektering, planlegging og utførelse har innsikt i fysiske, organisatoriske og psykososiale arbeidsmiljøfaktorer har kunnskap om prosesser knyttet til anbud og kontraktsinngåelse har kunnskap om entrepriseformer, kontrahering og kontraktsformer har kunnskap om metodikk for styring, gjennomføring, ledelse og oppfølging av klima, energi og miljøtekniske installasjoner har kunnskap om ferdigstillelse, overlevering og sluttdokumentasjon kan vurdere eget arbeid i forhold til gjeldende normer og krav kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet",
        "skills": "Ferdigheter Studenten kan finne informasjon i akkordtariff, bedriftens lønnssystem samt materialpriser i forbindelse med kalkulasjon og kostnadsberegning av rør- og ventilasjonstekniske installasjoner kan anvende aktuelle standarder for anbud og tilbud samt kontrakter for aktuelle prosjekter kan finne og henvise til informasjon om KS/SHA/HMS-plan etter godkjennings-, sertifiserings- og kontrollordninger kan kartlegge en situasjon og vurdere og identifisere behov for tiltak i forhold til avvik fra KS/SHA/HMS-plan reflektere over egen og andres sikkerhet på en bygge/anleggsplass kan anvende IT-baserte prosjektstyringsverktøy som hjelp i planlegging og oppfølging av aktiviteter, ressurser, kostnader og tidsforbruk i bransje-relaterte prosjekter kan gjøre rede for sine faglige valg i prosjektgjennomføring og ledelse, inkludert bruk av prosjektstyringsverktøy, produksjonsplanlegging, etikk, HMS, søknadsprosedyrer, anbudsprosesser og kalkulasjon i tråd med gjeldende lover, forskrifter og standarder.",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre søknad for tillatelser i aktuelle tiltaksklasser iht. lover, forskrifter og veiledninger relatert til bransje kan utføre kalkulasjon og kostnadsberegning av rør- og ventilasjonstekniske installasjoner for private og profesjonelle oppdragsgivere, herunder utarbeidelse av anbud og tilbud kan planlegge og følge opp anbud, tilbud, kontrakter, HMS/KS-krav i en byggesak alene og som deltaker i gruppe i tråd med etiske krav og retningslinjer for å ivareta kontraktsmessige forpliktelser og rettigheter kan planlegge og gjennomføre implementering av en KS/SHA/HMS-plan etter godkjennings-, sertifiserings- og kontrollordninger kan utføre arbeidet etter kunders behov og myndigheters krav i en byggesak kan bygge relasjoner med fagfeller innen bygg- og anleggsbransjen og på tvers av fag, samt med byggherrer og myndigheter for å utvide egen kunnskap angående byggesaker kan utveksle synspunkter med andre med bakgrunn innenfor bygg- og anleggsbransjen og delta i diskusjoner om utfordringer i byggesaker kan bidra til organisasjonsutvikling ved å følge med på nye krav og retningslinjer i byggesaker"
      }
    },
    {
      "id": "25TB03K EITKKEK H25",
      "title": "Energi og miljø i bygg",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25TB03K-EITKKEK-H25/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om energieffektive bygningskonsepter med lav miljøbelastning og godt inneklima har kunnskap om inneklima, byggkonstruksjoner, byggematerialer og VVS-tekniske installasjoner i bygg har kunnskap om rett energibruk i bygg og om hva som må til for å skape et godt inneklima har kunnskap om termodynamikk og energi- og klimatekniske beregninger har kunnskap om energimerking, metoder for energivurdering, måletekniske metoder og utstyr som benyttes i VVS-fagene har innsikt i prinsipper for energi- og miljøledelse og energioppfølgingssystemer har kunnskap om samkjøring av de tekniske anleggene slik at det sikres optimal drifts-økonomi og et godt inneklima har innsikt i gjeldende regelverk, tekniske standarder, avtaler og krav til kvalitet som gjelder innen VVS-fagene, og kan vurdere eget arbeid i forhold til regelverket Kan vurdere eget arbeid i forhold til gjeldende normer og krav innen energi- og miljøeffektive bygg, inneklima, byggkonstruksjoner og bygningstekniske installasjoner, samt bruke dokumentasjonsverktøy og DAK på en faglig forsvarlig måte. Kjenner til bransjens og yrkets historie, tradisjoner, egenart og plass i samfunnet, og forstår hvordan disse påvirker utviklingen av bærekraftige byggeløsninger, tekniske installasjoner og bruk av digitale verktøy i planlegging og dokumentasjon.",
        "skills": "Ferdigheter Studenten kan kartlegge en situasjon, vurdere, identifisere, planlegge og iverksette tiltak som optimaliserer energibruk, reduserer miljøbelastning og sikrer tilfredsstillende inneklima i bygninger kan finne fram og henvise til relevant fagstoff og utføre VVS-tekniske målinger og grunnleggende energitekniske beregninger i samsvar med gjeldende regelverk kan anvende bygg-, og VVS-tekniske tegninger kan anvende relevant IT verktøy, herunder bransjerelevant DAK-verktøy kan anvende metoder for energi- og miljøledelse og energioppfølgingssystemer kan reflektere over brann, fukt og lydtekniske forhold i byggverk samt prosjektenes innvirkning på miljø og samfunn kan gjøre rede for sine faglige valg innen de aktuelle disiplinene kan reflektere over egen faglig utøvelse og justere denne under veiledning i tråd med bedriftens retningslinjer",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre et prosjekt med tanke på energi og miljø i bygg, som deltaker eller leder av gruppe og i tråd med etiske krav og retningslinjer kan utføre arbeidet med utarbeidelse av enkle bransjerelaterte tegninger ved hjelp av et relevant DAK-verktøy kan utføre et prosjekt etter kunders ønske og myndigheters krav kan bygge relasjoner med fagfeller innen energi og miljø av bygg og på tvers av fag med involverte aktører kan utveksle synspunkter med andre med bakgrunn innenfor energi og miljø av bygg og delta i diskusjoner om nasjonale og globale klimautfordringer og stadig skjerpede krav til energieffektive tekniske installasjoner i bygg, uten at strenge energikrav skal gå utover funksjon og inneklima kan bidra til organisasjonsutvikling gjennom å formidle energiteknisk kompetanse"
      }
    },
    {
      "id": "00TB03K EITKKEK H25",
      "title": "VVS-prosjektering og systemforståelse",
      "credits": 25,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00TB03K-EITKKEK-H25/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om prosjektering av sanitæranlegg, varmeanlegg, brannslokkeanlegg, kuldesystemer og varmepumper, luftbehandling og komfortkjøling har kunnskap om VVS-teknisk prosjektering av energioptimale systemløsninger, regulering og lokal energiproduksjon kan vurdere eget arbeid i forhold til regelverk og standarder som angir hvordan VVS-tekniske anlegg skal prosjekteres har bransjekunnskap om behovet for tverrfaglig koordinering mellom egne fag samt mellom egne fag og andre fag i byggeprosjekter har innsikt i behovet for kontinuerlig informasjonsutveksling mellom aktørene i et prosjekteringsoppdrag har innsikt i bygningsinformasjonsmodellering (BIM) har kunnskap om krav til prosjektmaterialet har innsikt i tilgjengelighet og bruk av nøkkeltall for priskalkyler av VVS-tekniske anlegg kan oppdatere sin yrkesfaglige kunnskap om VVS-prosjektering kjenner til VVS-bransjens historie, egenart og plass i samfunnet",
        "skills": "Ferdigheter Studenten kan gjøre rede for sine faglige valg vedr. systemløsninger innen VVS- og energitekniske anlegg for forskjellige typer bygg/bruksområder kan gjøre rede for sine faglige valg i arbeidet med krav til energi, effekt, inneklima og øvrige relevante forskriftskrav. kan gjøre rede for sine faglige valg ved bruk av verktøy, materialer, teknikker og uttrykksformer innen design, dimensjonering og dokumentasjon av VVS-tekniske anlegg innenfor tiltaksklasse 2 etter plan- og bygningsloven. kan anvende relevante VVS-relaterte modelleringsprogrammer som verktøy for design, dimensjonering og andre relevante beregninger kan reflektere over egne faglige valg innenfor VVS- og energitekniske løsninger kan gjøre rede for sine faglige valg i utarbeidelse av VVS-tegninger for montasje og anbudsberegning i henhold til Norsk Standard. kan gjøre rede for sine faglige valg ved bruk av systemskjemaer for VVS- og energitekniske anlegg, samt ved utarbeidelse av funksjons- og reguleringsbeskrivelser. kan anvende relevante faglige verktøy for fremstilling av utsparingstegninger for sine anlegg kan gjøre rede for sine faglige valg ved utarbeidelse av VVS-tekniske beskrivelser for anbudsberegning i samsvar med Norsk Standard. kan kartlegge en situasjon og vurdere og identifisere behov for iverksetting av tiltak i tråd med bedriftens kvalitetssikringssystem gjennom prosjekteringsprosessen kan reflektere over egen faglig utøvelse innen VVS-prosjektering og justere denne under veiledning i tråd med bedriftens retningslinjer kan finne informasjon og fagstoff som er relevant for enkle kostnadskalkyler av prosjekterte anlegg basert på nøkkeltall fra bransjen",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre arbeidsoppgaver innen prosjektering, kalkulasjon og gjennomføring av VVS-tekniske installasjoner alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan utføre kvalifisert VVS-arbeid for alle bygg, innbefattet klima, energi og miljø, etter samfunnets behov har forståelse for yrkes- og bransjeetiske prinsipper ved representasjon av sitt firma i korrespondanse og møter med andre aktører i prosjekter, med fokus på gjennomgang, avklaring og justering av egne og andres forslag til løsninger kan bygge relasjoner med fagfeller innen VVS-prosjektering og systemforståelse og på tvers av fag med involverte aktører kan utveksle synspunkter med andre med bakgrunn innenfor VVS-prosjektering og systemforståelse og delta i diskusjoner om utvikling av god praksis, med mål om optimal samkjøring av alle installasjoner som påvirker inneklimaet"
      }
    },
    {
      "id": "01TB03F EITKKEK H25",
      "title": "Styring og automatisering av bygningstekniske installasjoner",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB03F-EITKKEK-H25/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om aktuelle elektriske anlegg, reguleringsteknikk-, strategier og utstyr (automatikk) inkludert sentral driftskontroll (SD-anlegg) i VVS-tekniske installasjoner har kunnskap om sammenheng mellom regulering av hydrauliske systemer, elektrisk utstyr, automatikkskjema og databuss- systemer som inngår i automatikkanlegg i de klimatekniske anleggene i bygg har innsikt i aktuelt regelverk for elektriske anlegg, herunder hvilke arbeider som kan utføres av andre enn elektroforetak registrert i el. virksomhetsregisteret hos Direktoratet for samfunnssikkerhet og beredskap (DSB) har kunnskap om tverrfaglig systemforståelse for de klimatekniske anleggene i bygg har kunnskap om elektrotekniske skjemaer med utgangspunkt i funksjonsbeskrivelser har innsikt i tekniske krav til elektriske anlegg, avhengig av hvilken type spenningssystem og driftsspenning det elektriske anlegget er tilkoblet, med hensyn til blant annet risiko ved betjening av utstyr i fordelingstavler har kunnskap om bus-systemer og protokoller brukt i SD-anlegg og automasjon for VVS- og klimatekniske anlegg. har innsikt i ulike typer vern i elektriske installasjoner, startstrømmer og metoder for mykstart og turtallsregulering av motorer samt regulering av annet effektkrevende utstyr (eks varmebatteri), for å oppnå optimal driftssituasjon og vurdere risiko ved betjening av disse har kunnskap om maskindirektivets forskrifter som gjelder bygging av maskiner og CE merking kan vurdere eget arbeid i forhold til gjeldende normer og krav innen elektroteknikk, reguleringsteknikk, automatisering, SD-anlegg og teknisk integrasjon, med fokus på funksjon, sikkerhet og samspill mellom ulike bygningsinstallasjoner. Kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet, og forstår hvordan utviklingen av ITB-løsninger, automatisering og tekniske grensesnitt har påvirket moderne byggteknikk og tverrfaglig samarbeid.",
        "skills": "Ferdigheter Studenten kan gjøre rede for sine faglige valg ved kartlegging av situasjoner og vurdering av risiko i planlegging av arbeider og målinger på elektriske anlegg, samt begrunne hvilke autoriserte aktører som lovlig kan utføre utbedring og feilretting. kan gjøre rede for sine faglige valg i forbindelse med tegning av enkle elektrotekniske skjemaer med utgangspunkt i funksjonsbeskrivelser kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling, samt foreslå forbedringstiltak basert på faglige vurderinger. kan anvende krav til fordelingstavler og styreredskap med hensyn til om disse er konstruert for sakkyndig eller usakkyndig betjening kan anvende virksomhetens internkontrollsystem i forhold til rutiner og prosedyrer kan gjøre rede for sine faglige valg ved kartlegging av situasjoner og vurdering av tiltak som reduserer risiko for personskade under drift, vedlikehold og reparasjon av VVS-teknisk automatikk og styringssystemer. kan anvende relevante forskrifter med hjemmel i El-tilsynsloven, herunder konsekvensene ved å bryte forskriftene kan gjøre rede for sine faglige valg ved utarbeidelse av funksjonsbeskrivelser som sikrer at automatikken i VVS- og klimatekniske anlegg fungerer etter hensikten.",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre et anlegg innen elektro og automatisering, som automatikkanlegg inkludert SD-anlegget, som deltaker eller leder av gruppe og i tråd med etiske krav og retningslinjer kan planlegge og gjennomføre et prosjekt med grensesnitthåndtering mellom ulike fag som inngår i VVS- og klimateknisk entreprise (teknisk integrator - ITB) alene og som deltaker i gruppe i tråd med krav til godt inneklima, redusert energibruk og reduserte driftskostnader i bygget kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer, ved å gjennomføre prosjekter i henhold til kundens ønsker og myndigheters krav, og kontrollere at arbeidet er utført i tråd med bestilling. kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver ved å utarbeide behovsspesifikasjoner for automatikkanlegg, inkludert SD-anlegg, samt planlegge og bestille enkle arbeider. kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver ved å tegne elektrotekniske skjemaer. kan utføre aktuelle elektriske målinger på klimatekniske anlegg på en risikofri og sikker måte og gjøre rede for måleresultatene for aktuelle oppdragsgivere kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver ved å gjennomføre visuelt ettersyn og kontroll av elektriske installasjoner, automatikk og styringssystemer før oppstart, ved igangkjøring, overlevering og under drift. kan bygge relasjoner med fagfeller innen elektro og automatisering og på tvers av fag med involverte aktører kan utveksle synspunkter med andre med bakgrunn innenfor elektro og automatisering og delta i diskusjoner om utvikling av god praksis, med mål om optimal samkjøring av alle installasjoner som påvirker inneklimaet"
      }
    },
    {
      "id": "01TB03G EITKKEK H25",
      "title": "VVS og klimatekniske installasjoner",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TB03G-EITKKEK-H25/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har innsikt i aktuelle lover, forskrifter, vedtekter og standarder innen emnet har kunnskap om entrepriseformer, kontrahering og kontraktsformer har kunnskap om prosesser knyttet til anbud og kontraktsinngåelse har innsikt i aktuelle krav til godkjennings-, sertifiserings- og kontrollordninger har kunnskap om kvalitetsstyring og HMS som en viktig del av all prosjektering, planlegging og utførelse har innsikt i fysiske, organisatoriske og psykososiale arbeidsmiljøfaktorer har kunnskap om metodikk for styring, gjennomføring, ledelse og oppfølging av klima, energi og miljøtekniske installasjoner har kunnskap om ferdigstillelse, prøvedrift, overlevering og sluttdokumentasjon har kunnskap om innhold i rutiner for opplæring av driftspersonell har kunnskap om aktuelle bransjen kan vurdere eget arbeid i forhold til gjeldende normer og krav innen miljøsertifisering, LCC og bærekraft, samt i forbindelse med ferdigstilling, prøvedrift, overtakelse, sluttdokumentasjon og FDVU-oppgaver. kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet, og forstår hvordan digitale verktøy som 3D-DAK og BIM har påvirket utviklingen av bærekraftige løsninger og effektiv forvaltning, drift og vedlikehold i byggenæringen.",
        "skills": "Ferdigheter Studenten kan finne informasjon i akkordtariff, bedriftens lønnssystem samt materialpriser i forbindelse med kalkulasjon og kostnadsberegning av rør- og ventilasjonstekniske installasjoner kan gjøre rede for sine faglige valg ved bruk av aktuelle standarder for anbud, tilbud og kontrakter i relevante prosjekter. kan finne og henvise til informasjon om KS/SHA/HMS-plan etter godkjennings-, sertifiserings- og kontrollordninger kan kartlegge en situasjon og vurdere og identifisere behov for tiltak i forhold til avvik fra KS/SHA/HMS-plan herunder rutiner for avvikshandtering og dokumentasjon reflektere over egen og andres sikkerhet på en bygge/anleggsplass kan anvende IT-baserte kalkulasjons og prosjektstyringsverktøy som hjelp i planlegging og oppfølging av aktiviteter, ressurser, kostnader og tidsforbruk i bransje-relaterte prosjekter",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre søknader for tillatelser i aktuelle tiltaksklasser i henhold til lover, forskrifter og veiledninger relatert til bransje herunder krav til innhold i søknad om tillatelse til tiltak og erklæring om ansvarsrett kan utføre kalkulasjon og kostnadsberegning av rør- og ventilasjonstekniske installasjoner for private og profesjonelle oppdragsgivere, herunder utarbeidelse av anbud og tilbud kan planlegge og følge opp anbud, tilbud, kontrakter, HMS/KS-krav i en byggesak alene og som deltaker i gruppe i tråd med etiske krav og retningslinjer for å ivareta kontraktsmessige forpliktelser og rettigheter kan planlegge og gjennomføre implementering av en KS/SHA/HMS-plan etter godkjennings-, sertifiserings- og kontrollordninger kan utføre arbeidet etter kunders behov og myndigheters krav i en byggesak kan bygge relasjoner med fagfeller innen bygg- og anleggsbransjen og på tvers av fag, samt med byggherrer og myndigheter for å utvide egen kunnskap angående byggesaker kan utveksle synspunkter med andre med bakgrunn innenfor bygg- og anleggsbransjen og delta i diskusjoner om utfordringer i byggesaker kan bidra til kultur og organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00H",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H/2028-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om hvordan man skriver en prosjektrapport har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt har kunnskap om sammenhengen mellom teori og praksis kan vurdere eget prosjekt i forhold til gjeldende normer og krav kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av tema for hovedprosjekt kan identifisere, kartlegge og vurdere en faglig problemstilling kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat kan skrive en prosjektrapport kan drøfte sammenhengen mellom teori og praksis kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    }
  ]
}