{
  "study_programs": [
    {
      "id": "Klinisk helsearbeid - 60",
      "title": "Klinisk helsearbeid",
      "description": "Klinisk helsearbeid er en fleksibel fagskoleutdanning for helsefagarbeidere som ønsker faglig utvikling tett knyttet til arbeid i helsetjenestene. Studiet gir deg mulighet til å bygge kompetanse gjennom valgbare emner og utvikle en fagskolegrad tilpasset egne interesser og behov i helsetjenestene.",
      "study_category": "Helse",
      "study_location": {
        "1": "Fredrikstad",
        "3": "Indre Østfold"
      },
      "study_type": {
        "8": "Samlingsbasert 2 år"
      },
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "I helse- og omsorgstjenestene står helsefagarbeidere ofte i krevende situasjoner med stort ansvar. Pasientene har sammensatte behov, tempoet er høyt, og forventningene er mange – også når du er alene på vakt og må ta viktige vurderinger selv.\nKlinisk helsearbeid er utviklet for deg som ønsker å føle deg tryggere i rollen din. Studiet gir deg oppdatert faglig kompetanse og bedre forståelse for det du allerede gjør i arbeidshverdagen, slik at du kan stå stødigere i møte med ansvar, krav og faglige vurderinger.\nUtdanningen bygger på erfaringene dine og gir deg mulighet til å utvikle kompetanse som er direkte relevant for arbeid i helsetjenestene. Målet er ikke å gjøre deg til noe annet – men å gi deg trygghet i at du er faglig rustet, oppdatert og god nok i jobben du allerede gjør.",
      "what_learn": "I Klinisk helsearbeid bygger du kompetanse som styrker deg i pasientnært arbeid og faglige vurderinger i helsetjenestene. Studiet gir deg bedre forståelse for observasjon, dokumentasjon, samhandling og pasientsikkerhet – med utgangspunkt i situasjoner du møter i arbeidshverdagen.\nUtdanningen er bygget opp av både | obligatoriske og valgbare emner à 10 studiepoeng | . De obligatoriske emnene gir et felles faglig grunnlag, mens de valgbare emnene gir deg mulighet til å fordype deg i områder som er relevante for deg og jobben du står i.\nDu trenger ikke å ha en ferdig plan når du starter. | For å oppnå | fagskolegrad i Klinisk helsearbeid på 60 studiepoeng | må du gjennomføre | to obligatoriske og fire valgbare emner | . | Minst ett av de valgbare emnene må gjennomføres som nettbasert undervisning med fysiske samlinger.\nDet er også mulig å ta | enkeltemner à 10 studiepoeng | uten å fullføre hele utdanningsløpet. Mange starter med ett eller flere emner og bygger videre over tid, dersom behov og ønske endrer seg.\nNedenfor kan du klikke på emnene for å lese mer om innhold og oppbygning.\nInformasjon om søkbare emner, gjennomføring og søknadsfrist publiseres her når dette er avklart. Ved opptak starter studiet med det første obligatoriske emnet. Informasjon om hvor du søker, kommer senere.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Informasjon om søkbare emner, gjennomføring og søknadsfrist publiseres her når dette er avklart. Ved opptak starter studiet med det første obligatoriske emnet. Informasjon om hvor du søker, kommer senere. Undervisning og samlinger Studiet gjennomføres som nettbasert deltidsutdanning. De ulike emnene kan ha forskjellig gjennomføringsform, tilpasset faglig innhold og læringsmål. Emnene gjennomføres enten som nettbasert undervisning med fysiske samlinger, nettbasert undervisning med digitale samlinger, eller som nettbaserte emner uten felles samlingspunkter. Der emnene har samlinger, holdes disse vanligvis flere ganger per semester og varer to til tre dager. Endelig plan for gjennomføring, samlinger og undervisning publiseres på studentsiden før oppstart. Obligatorisk oppmøte Det kan være krav til oppmøte i emner som gjennomføres med fysiske samlinger. For å få sluttvurdering i emnene må eventuelle oppmøtekrav være oppfylt. Nærmere informasjon om oppmøtekrav og konsekvenser ved fravær finner du i studieplanen for det enkelte emnet.",
      "police_certificate": null,
      "career_opportunities": "Videreutdanningen i klinisk helsearbeid styrker rollen din i direkte pasientarbeid, særlig i situasjoner der du må gjøre gode vurderinger, følge med på endringer hos pasienten og ta ansvar for helheten i helsehjelpen. Kompetansen brukes i samarbeid med annet helsepersonell, der du bidrar med faglige vurderinger, tydelig dokumentasjon og trygg kommunikasjon. Dette bidrar til bedre samhandling, mer sammenhengende pasientforløp og økt kvalitet i tjenestene. Klinisk helsearbeid er relevant i sykehus, helsehus, hjemmebaserte tjenester, sykehjem og andre deler av helsetjenesten, og gir et solid grunnlag for videre faglig utvikling, økt ansvar og fordypning i yrkesrollen.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/helse/klinisk-helsearbeid"
    }
  ],
  "courses": []
}