{
  "study_programs": [
    {
      "id": "Ledelse og økonomi for industrien - 10",
      "title": "Ledelse og økonomi for industrien",
      "description": "Ledelse og økonomi for industrien er studiet for deg som vil ta et tydeligere ansvar for økonomi, mennesker og resultater i industribedriften din. Du lærer å forstå tallene bak driften, lede medarbeidere på en trygg og motiverende måte og bruke markedsinnsikt til å ta bedre beslutninger i hverdagen.",
      "study_location": "Kongsberg (Samlingsbasert ca. 14 uker)",
      "credits": 10,
      "language": "Norsk",
      "level": "Enkeltemne",
      "why_choose": "Industrien er i stadig endring – med krav til effektiv drift, lønnsomhet, bærekraft og samtidig et godt arbeidsmiljø. Mange fagarbeidere og mellomledere får mer ansvar for folk, budsjett og prosjekter, uten å alltid ha formell leder- eller økonomiutdanning i ryggen.\nMed | Ledelse og økonomi for industrien | får du et praktisk rettet påfyll som er utviklet for din arbeidshverdag. Du jobber med eksempler, tall og situasjoner fra industrien, og trener på å se sammenhengen mellom produksjon, kostnader, lønnsomhet og menneskene som skal få jobben gjort.\nStudiet gir deg verktøyene du trenger for å delta i – og lede – forbedringsarbeid, følge opp budsjett og økonomi, og bidra til et trygt og profesjonelt arbeidsmiljø. Du står sterkere når du skal argumentere for tiltak, prioritere ressurser og følge opp både kollegaer og resultater.\nDette studiet er en del av | Industrifagskolen | .",
      "what_learn": "I dette studiet får du en samlet innføring i økonomi, organisasjon og markedsføring – spesielt tilpasset industrien. Du lærer å lese og forstå tallene i bedriften, se hva som påvirker kostnader og inntekter, og bruke budsjett, kalkyler og enkle analyser som støtte i beslutninger.\nDu jobber også med ledelse og organisasjon: hvordan motivere medarbeidere, følge opp arbeidsmiljøet, håndtere endringer og bidra til en kultur der folk både trives og leverer. Her knyttes teori tett til egne erfaringer fra arbeidshverdagen.\nI markedsføringsdelen får du innblikk i hvordan bedrifter planlegger markedstiltak, jobber med kunder og posisjonerer seg i markedet. Du lærer å tenke helhetlig rundt kundereiser, pris, produkter og salgsarbeid – også der du selv ikke jobber direkte med salg i dag.\nStudiet har et omfang på 10 studiepoeng. Du søker opptak til modulstudiet | Ledelse og økonomi for industrien | , og etter fullført og bestått emne får du karakterutskrift og kompetansebevis ved behov. | Klikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger | Studiet gjennomføres som et | nettbasert studium med samlinger | , tilpasset deg som kombinerer utdanning med jobb i industrien. Undervisningen legges vanligvis til ettermiddag eller kveld, slik at du kan delta ved siden av turnus eller dagtid. | Du deltar i nettundervisning med faglige gjennomganger, oppgaveløsning og dialog, kombinert med enkelte fysiske samlinger ved studiested Kongsberg. På samlingene jobber dere mer praktisk og i grupper med case fra industri og egen arbeidshverdag. | Mellom samlingene arbeider du med oppgaver, refleksjon og forberedelser i eget tempo. Læringsarbeidet støttes av digital læringsplattform, der du finner planer, oppgaver og beskjeder fra faglærer. | Plan for undervisning vår 2026: | Oppstart: | Uke 5, tirsdag 27.januar | Nettundervisning: | Tirsdager kl 18:25 - 21:00. | Fysisk samling: | Uke 7 (mandag - onsdag kl 08:15 - 15:45) og uke 16 (mandag - onsdag kl 08:15 - 15:45). | Obligatorisk oppmøte | Enkelte aktiviteter/samlinger kan ha obligatoriske arbeidskrav eller oppmøteplikt. Se emne-/studieplan for detaljer. Ved fravær må du selv ta igjen tapt læring.",
      "police_certificate": null,
      "career_opportunities": "Dette emnet gir deg økt trygghet i rollen som nøkkelperson i industrien – enten du allerede har personalansvar, jobber som fagarbeider med ekstra ansvar eller er på vei inn i en lederrolle. | Du utvikler kompetanse til å forstå og følge opp økonomi, planlegge og vurdere investeringer, og bidra aktivt i budsjett- og forbedringsarbeid. Samtidig styrker du evnen til å lede, motivere og utvikle medarbeidere, og til å bygge et godt arbeidsmiljø der både effektivitet og trivsel blir ivaretatt. | Kompetansen er særlig relevant for arbeid som | teamleder, formann, skiftleder, produksjonsleder, prosjektleder, driftsleder eller mellomleder i industribedrifter | . Studiet gir også et godt grunnlag for deg som ønsker å starte eller videreutvikle egen virksomhet innen industri- og produksjonsrelaterte tjenester.",
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Utdanningsleder: | Jøran Bergerud – e-post: | joranbe@afk.no | Studiekoordinator: | Helene Eikefjord – e-post: | heleneeik@afk.no | Du kan også | melde din interesse i dette skjemaet | , så vil vi ta kontakt med deg.",
      "study_url": "https://fagskolen-viken.no/studier/ledelse/ledelse-og-okonomi-industrien"
    }
  ],
  "courses": []
}