{
  "study_programs": [
    {
      "id": "Logistikk og service i helsetjenesten - 60",
      "title": "Logistikk og service i helsetjenesten",
      "description": "Logistikk og service i helsetjenesten er videreutdanningen for deg som vil bidra til tryggere pasientforløp og mer effektiv drift i helsetjenestene. Du bygger kompetanse i logistikk, smittevern, kvalitet og service – og lærer å se sammenhengen mellom mennesker, systemer og flyt i et moderne helsevesen.",
      "study_location": "Kjeller (Samlingsbasert 2 år)",
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Helsetjenesten er avhengig av at utstyr, varer, tjenester og informasjon flyter riktig – til riktig tid og på riktig sted. Når logistikken svikter, kan det påvirke både pasientsikkerhet, arbeidsflyt og ressursbruk. Samtidig er det stor knapphet på arbeidskraft, og behovet for smartere organisering og bedre oppgaveløsning øker.\nDette studiet er utviklet i samarbeid med Sykehuset Østfold og gir deg en praksisnær og helhetlig forståelse av hvordan logistikk og service støtter opp under god pasientbehandling. Du får innsikt i helsesektorens rammer og krav, og bygger kompetanse som gjør deg til en viktig ressurs i tverrfaglig samarbeid på tvers av avdelinger og funksjoner.\nFor dette studiet er det krav om | politiattest | .",
      "what_learn": "Studiet gir deg en bred og yrkesrettet kompetanse i logistikk og service i helsetjenesten. Du får en felles forståelse av helsesektoren og hvordan kvalitet, etikk, kommunikasjon og samhandling påvirker arbeidsflyt og pasientsikkerhet. Du bygger også kunnskap om hygiene og smittevern, og hvordan gode rutiner og korrekt praksis bidrar til å forebygge og begrense infeksjoner i helsetjenesten.\nVidere arbeider du med logistikkprinsipper, logistikkprosesser og bruk av relevante digitale verktøy i arbeid med vare-, utstyr- og pasientlogistikk. Du får også innføring i helseøkonomi, service og kundebehandling i en logistisk kjede, og hvordan prosessforståelse henger sammen med pasientforløp og drift. Mot slutten gjennomfører du en fordypningsoppgave med et praksisrettet tema, og du knytter teori og praksis sammen gjennom en obligatorisk praksisperiode.\nStudiet består av fem emner og gir totalt 60 studiepoeng. Du søker opptak til hele utdanningen.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger | Studiet gjennomføres som nettbasert deltidsutdanning med samlinger ved studiested Kjeller. | Undervisningen kombinerer nettundervisning, veiledning og samlinger, og veksler mellom forelesninger, arbeid med oppgaver og case, refleksjon, gruppearbeid og prosjektarbeid. Mellom samlingene følger du nettundervisning etter oppsatt plan, og arbeider med læringsaktiviteter og arbeidskrav i læringsplattformen. | Endelig plan for samlinger og undervisning publiseres på | studentsiden for Kjeller | før oppstart. | Praksis | Praksis er en obligatorisk del av studiet og har et omfang på 10 uker (300 timer). Praksis kan gjennomføres på to måter: | som praksis på annet arbeidssted enn der du er ansatt, eller | som utviklingsarbeid på egen arbeidsplass, dersom det er relevant for fagområdet og gjennomføres etter skolens retningslinjer. | Du må være til stede minimum | 90 % av planlagt praksistid | . Fravær utover dette må tas igjen etter avtale. Det er satt av tid til en studiedag per uke i praksisperioden. | Obligatorisk oppmøte | Studiet kan ha obligatorisk oppmøte på samlinger og obligatoriske arbeidskrav i emnene. Krav til oppmøte og gjennomføring fremgår av emnebeskrivelsene. Ved fravær er du selv ansvarlig for å ta igjen tapt læring og levere arbeidskrav innen frister. | Politiattest | Dette studiet krever | gyldig politiattest | før studiestart. Søk om politiattest når du har akseptert studieplassen. Les vår | veiledning til hvordan du søker politiattest | før du går videre til | politiets nettsider | for å sende søknaden.",
      "police_certificate": "Sjekk opptakskrav",
      "career_opportunities": "Denne fagskoleutdanningen gir deg økt kompetanse og trygghet i fagutøvelsen i helsetjenesten. | Kompetansen brukes til å planlegge, organisere og forbedre logistikk og service på en faglig og etisk bevisst måte, med vekt på pasientsikkerhet, kvalitet og effektiv ressursbruk. Utdanningen styrker handlingskompetansen din slik at du kan ta større ansvar i drift, koordinering, dokumentasjon og tverrfaglig samarbeid – og bidra til bedre flyt i pasientforløp og støttefunksjoner. | Kompetansen er særlig relevant i sykehus, helsehus, kommunale helse- og omsorgstjenester, klinikker og andre helseinstitusjoner der vare-, utstyr- og tjenestelogistikk er kritisk for kvalitet og pasientsikkerhet.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/helse/logistikk-og-service-i-helsetjenesten"
    }
  ],
  "courses": []
}