{
  "study_programs": [
    {
      "id": "Logistikk og sporbarhet i produksjonen - 10",
      "title": "Logistikk og sporbarhet i produksjonen",
      "description": "Logistikk og sporbarhet i produksjon er emnet for deg som vil bruke produksjonsdata, styringsprinsipper og digitale verktøy til bedre flyt, kortere ledetid og høyere kvalitet. Du lærer å planlegge og styre produksjon på en måte som gir presise leveranser, dokumentert sporbarhet og mer bærekraftige prosesser.",
      "study_location": "Kongsberg (Samlingsbasert ca. 12 uker)",
      "credits": 10,
      "language": "Norsk",
      "level": "Enkeltemne",
      "why_choose": "Kundekrav og leveransehastighet øker – samtidig som kvalitet og bærekraft skal dokumenteres. Dette emnet gir deg en praksisnær metodikk for å forbedre flyt og kapasitet, styre innsatsfaktorer og følge produktene gjennom hele verdikjeden. Du får innsikt i moderne styrings- og forretningsmodeller, og lærer å omsette dem til konkrete forbedringer i egen virksomhet.",
      "what_learn": "Emnet kombinerer nettundervisning, veiledning og samlingsdager. Du jobber med realistiske case fra produksjonsmiljøer og trener på å se sammenhengen mellom plan, innkjøp, produksjon, kvalitet og distribusjon. Underveis lærer du å vurdere hvilken styringsform som passer ulike produksjonstyper, bruke digitale informasjonssystemer til operativ planlegging og avviksoppfølging, og dokumentere sporbarhet på en måte som støtter kvalitet, sikkerhet og sirkulærøkonomi. Læringsprosessen er bygget rundt forbedringsarbeid i praksis, slik at du kan ta i bruk verktøy og begreper i arbeidshverdagen fra første uke.\nKlikk på et tema for å lese mer om innholdet i studiet i emneplanen.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger | Emnet gjennomføres som nettbasert deltidsstudium med samlinger ved Kongsberg over en emneperiode på om lag 12 uker. Samlingene holdes vanligvis flere ganger i emneperioden og kan ha en varighet på inntil en arbeidsuke. Her jobber du praksisnært med planlegging, styring, sporbarhet og digital støtte. Endelig undervisnings- og samlingsplan publiseres på studentsiden før oppstart. | Oppstart: | Uke 10, mandag 02.mars | Nettundervisning: | Mandager kl 17:30 - 20:05 | Fysisk samling: | Uke 17 (mandag - fredag, kl 08:15 - 15:45)",
      "police_certificate": null,
      "career_opportunities": "Kompetansen gjør deg bedre i roller som | planlegger, koordinator eller fagspesialist | innen produksjon og logistikk – i | industribedrifter, grossistvirksomheter og offentlig/privat sektor | . I praksis betyr det tryggere kapasitet og leveranser, tydeligere beslutningsgrunnlag, færre avvik og dokumentert sporbarhet som støtter kvalitet, sikkerhet og bærekraft.",
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Utdanningsleder: | Jøran Bergerud – e-post: | joranbe@afk.no | Studiekoordinator: | Helene Eikefjord – e-post: | heleneeik@afk.no | Du kan også | melde din interesse i dette skjemaet | for en uforpliktende prat om dine muligheter.",
      "study_url": "https://fagskolen-viken.no/studier/teknologi-og-industri/logistikk-og-sporbarhet-i-produksjonen"
    }
  ],
  "courses": []
}