{
  "study_programs": [
    {
      "id": "Matteknikk - 120",
      "title": "Matteknikk",
      "description": "Matteknikk er for deg som vil sikre trygg matproduksjon fra råvare til ferdig produkt – med ansvar for kvalitet, prosess og forbedring i hele verdikjeden.",
      "study_location": "Fredrikstad (Samlingsbasert 3 år)",
      "credits": 120,
      "language": "Norsk",
      "level": "Høyere fagskolegrad",
      "why_choose": "Matindustrien står midt i en tid med store endringer – der teknologi, bærekraft og matsikkerhet blir stadig viktigere. For å sikre trygg og effektiv matproduksjon trengs det fagfolk som forstår både råvarene, prosessene og menneskene bak produktene.\nMed videreutdanning i matteknikk får du den tekniske og faglige kompetansen som gjør deg i stand til å lede og utvikle produksjon på en trygg, bærekraftig og lønnsom måte. Du lærer hvordan kvalitet, hygiene, teknologi og miljø henger sammen, og hvordan du kan bruke kunnskapen til å forbedre både produksjonsprosesser og arbeidsmiljø.\nStudiet gir deg trygghet til å ta ansvar i en bransje som er i rask utvikling – der digitalisering og nye krav til bærekraft åpner for spennende muligheter. Du får en tverrfaglig forståelse av matproduksjon fra råvare til ferdig produkt, og styrker din rolle som en kompetent fagperson som bidrar til trygg mat og grønn vekst.\nStudiet gir deg grunnlag for å søke om mesterbrev. Det betyr at du etter fullført utdanning kan oppnå tittelen mester – en beskyttet tittel som dokumenterer både faglig tyngde og lederkompetanse.\nMesterbrevet styrker din posisjon i arbeidslivet og kan åpne dører til nye karrieremuligheter, enten du vil starte egen virksomhet eller ta større ansvar i en etablert bedrift. | Les mer om veien til mesterbrev på mesterbrev.no",
      "what_learn": "I dette studiet lærer du å forstå hele prosessen fra råvare til ferdig produkt – og hvordan du kan sikre trygg, effektiv og bærekraftig matproduksjon. Du får innsikt i råstoffkunnskap, kjemi, mikrobiologi, prosess- og kvalitetssystemer, og lærer å bruke denne kunnskapen til å forbedre produksjon og produktkvalitet.\nGjennom arbeidet med praktiske oppgaver og prosjekter utvikler du ferdigheter i å analysere og optimalisere prosesser, håndtere utfordringer knyttet til hygiene, mattrygghet og bærekraft, og bruke faglig skjønn i tekniske og ledelsesmessige beslutninger.\nDu får også kompetanse innen økonomi, ledelse og prosjektstyring – slik at du kan ta ansvar for drift, utvikling og faglig kvalitet i matproduksjon, laboratoriearbeid eller teknisk prosessledelse.\nStudiet består av tolv emner fordelt over tre år, inkludert et hovedprosjekt. Du søker opptak til hele utdanningen og oppnår høyere fagskolegrad når du har fullført.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres med fysiske samlinger ved studiested Fredrikstad. Samlingene kombinerer undervisning, veiledning og praktiske øvelser i laboratorier, og legger til rette for samarbeid mellom studenter og faglærere. Samlingene holdes vanligvis flere ganger per semester og varer to til tre dager. Mellom samlingene foregår undervisningen digitalt, med nettmøter og fleksible læringsressurser. Du får tett oppfølging og veiledning i læringsplattformen, og kan kombinere studiet med jobb. Endelig plan publiseres på studentsiden for Fredrikstad før oppstart. Obligatorisk oppmøte Du må delta på minst 80 % av de fysiske samlingene for å få vurdert eksamen. Manglende oppmøte kan føre til at du ikke får fullført emnet.",
      "police_certificate": null,
      "career_opportunities": "Som fagskoleingeniør i matteknikk får du en etterspurt kompetanse som kombinerer produksjonsforståelse, teknisk innsikt og kvalitetssikring. Du kan arbeide i hele verdikjeden for matproduksjon – fra råvarebehandling til ferdig produkt – og bidra til trygg, effektiv og bærekraftig produksjon . Mange jobber i næringsmiddelindustrien , enten i laboratorier , med produktutvikling, kvalitetssystemer, HMS eller som faglig leder i produksjon . Du kan også arbeide innen teknisk service, salg av prosess- og næringsmiddelutstyr , eller i offentlige tilsynsorganer som kontrollerer og veileder matindustrien. Kompetansen gjør deg rustet til å lede prosesser, utvikle nye produkter og drive forbedringsarbeid i en bransje som stadig blir mer digital og teknologisk avansert. Utdanningen gir også et godt grunnlag for videre karriere innen undervisning, yrkesfaglærerutdanning eller mesterbrev .",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/mat-og-drikke/matteknikk"
    }
  ],
  "courses": [
    {
      "id": "01TX00A EITKFRE",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A-EITKFRE/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om realfag som redskap innen sitt fagområde har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes for å utføre nødvendige beregninger, dimensjoneringer, overslag og annen problemløsning med utgangspunkt i relevante praktiske situasjoner og problemstillinger innen fagretningen. har kunnskap om matematiske og fysiske lover, formler og symboler som er relevante for fagretningen kan vurdere eget arbeid i forhold til matematiske og fysiske lover har bransjekunnskap og kjennskap til yrkesfeltet en har valgt og om hvilken betydning realfaglige redskap har for fagretningen kan oppdatere sine kunnskaper innen realfag kjenner til matematikkens og fysikkens historie, tradisjoner, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter innen realfag",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av regneoperasjoner som anvendes for fagspesifikke problemstillinger kan gjøre rede for digitale verktøy som anvendes til problemløsninger innen realfaglige tema kan reflektere over egen faglig utøvelse og vurdere resultater av beregninger og justere denne under veiledning kan finne og henvise til informasjon og fagstoff i formelsamlinger og fagbøker og vurdere relevansen for en realfaglig problemstilling",
        "competence": "Generell kompetanse Studenten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger har innsikt i rekkevidde og begrensninger for de metoder som anvendes kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B EITKFRE",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B-EITKFRE/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om grunnleggende kommunikasjonsteori kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde har kunnskap om sentrale retoriske begreper og virkemidler har kunnskap om kildebruk etter standard for høyere utdanning kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter har kjennskap til prinsipper for tekstorganisering og -produksjon har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne",
        "skills": "Ferdigheter Studenten kan reflektere over møter mellom forskjellige arbeidslivskulturer kan bruke relevante begreper for å analysere egen og andres tekst kan reflektere over og revidere tekster kan reflektere over hvordan retorikk benyttes kan bygge opp saklig argumentasjon og bruke retoriske apellformer kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig kan reflektere over egen kommunikasjon i profesjonell sammenheng kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og god tekstbinding kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse Studenten kan kommunisere hensiktsmessig for å bidra til en inkluderende organisasjonskultur kan tilpasse språk og argumentasjon etter mål og mottaker kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting behersker relevante kommunikasjonsverktøy kan kommunisere gjennom relevante tekster og kanaler kan samarbeide om tekstproduksjon"
      }
    },
    {
      "id": "01TX00C EITKFRE",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C-EITKFRE/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak har kunnskap om lønnskostnader har kunnskaper om mål, tiltak og handlingsplaner • kjenner til emnets aktuelle lover og avtaler",
        "skills": "Ferdigheter Studenten kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler kan vurdere bedriftens betalingsevne og kapitalbehov kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler kan foreta en helhetlig prisvurdering og utarbeide kalkyler kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel kan identifisere, analysere og utvikle medarbeidernes kompetanse • kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse Studenten kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid kan kommunisere internt og eksternt og benytte digitale verktøy til dette. kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TK02C EITKKMFH24",
      "title": "Kjemi",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK02C-EITKKMFH24/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om atomteori, ulike grunnstoffer og kjemiske bindinger har kunnskap om det periodiske system og IUPACs navnsettingsregler har kunnskap om ulike kjemiske reaksjoner og reaksjonslikninger inkludert energiforandringer ved reaksjoner har kunnskap om relevante kjemiske beregninger har kunnskap om reaksjonsfart, kjemisk likevekt og faktorer som påvirker disse har grunnleggende kunnskap innen termodynamikk (entalpi og entropi) og kinetikk har kunnskap om klassifisering av organiske forbindelser har kunnskap om pH-begrepet, titrering og løselighet har kunnskap om teorien bak syre og base reaksjoner samt redoksreaksjoner kjenner til miljøkjemi",
        "skills": "Ferdigheter Studenten kan gjøre rede for reaksjonslikninger og utføre aktuelle beregninger kan gjøre rede for periodesystemet og benytte kjemiske tabeller som verktøy for å forklare egenskapene til grunnstoffer og deres forbindelser kan gjøre rede for miljømessige forhold ved bruk og avhending av kjemiske stoffer kan grunnleggende laboratorieteknikker, kan planlegge og utføre enkle forsøk og bruke journal som dokumentasjonsverktøy kan finne, henvise til og reflektere over fagstoff rundt en kjemisk problemstilling kan anvende kjemikalier i henhold til sikkerhetsdatablad, samt håndtere sikkerhet på laboratoriet",
        "competence": "Generell kompetanse Studenten kan planlegge, gjennomføre og dokumentere arbeid på et kjemilaboratorium alene og som deltaker i gruppe på en sikkerhetsmessig og miljømessig måte i tråd med etiske krav og retningslinjer innenfor laboratoriearbeid kan utveksle synspunkter, samt diskutere kjemiske problemstillinger i forbindelse med grunnleggende laboratoriearbeid og teknikker kan bidra med sin kjemikompetanse i møte med grunnleggende kjemiske problemstillinger"
      }
    },
    {
      "id": "01TK02D EITKKMFH24",
      "title": "Prosessteknologi",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK02D-EITKKMFH24/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kjennskap til grunnleggende prinsipper for trykk, strømning og energi i prosessanlegg, samt miljøbelastning i forbindelse med energi har kunnskap til prinsippene bak ulike prosessoperasjoner (ekstraksjon, separasjon, destillasjon og tørking) har kunnskap om symbolbruk og prosesseringskjeden i prosessflytskjema og kjennskap til teknisk flytskjema har kunnskap om prosessutstyr og prosessanlegg benyttet i matindustrien og aktuelle beregningsmetoder har kjennskap til styrings og kommunikasjonssystemer, målemetoder, analyseverktøy og teknisk utstyr som anvendes i automatiserte anlegg i matbransjen har kjennskap til oppbygning, egenskaper og miljøbelastning for de mest aktuelle materialer anvendt i matindustrien har kunnskap om grunnleggende elektrokjemi som basis for å forstå korrosjon, korrosjonsteori, årsakene til korrosjon og korrosjonsbeskyttelse har kjennskap til vedlikeholds teori og praktisk vedlikehold innen matindustrien",
        "skills": "Ferdigheter Studenten kan anvende kunnskap til å utføre relevante beregninger på væskestrøm, varmeoverføring og prosesser kan gjøre rede for valg av ulike prosessoperasjoner og regulere parametere ved behov kan anvende kunnskap om symbolbruk og prosessregulering til å lese og designe prosessflytskjema, samt tolke teknisk skjema kan gjøre rede for valg av materialer utfra materialers egenskaper og bruksområder for ulike prosesser i matindustrien kan anvende kunnskap om vedlikehold og gjennomføre enkelt vedlikehold på sentrale maskiner eller linjer anvendt i matproduksjon alene eller i samarbeid med andre kan finne og henvise til informasjon og fagstoff innen kjemiprosess og vurdere relevansen for en faglig problemstilling",
        "competence": "Generell kompetanse Studenten kan planlegge, gjennomføre og dokumentere arbeidsoppgaver innen drift av ulike prosesser i matbransjen alene og som deltager i prosessen i tråd med gjeldende lovverk kan anvende kunnskap om prosessutstyr, prosess styring og prosessovervåking i en normal driftssituasjon og kunne iverksette tiltak ved behov under produksjon alene eller i samarbeid med andre kan bidra og gjennomføre arbeidsoppgaver inne vedlikehold alene eller i samarbeid med andre har kjennskap til teknologisk utvikling i prosessindustrien som har betydning for matproduksjon og kan bidra innenfor eget ansvars- og kompetanseområde kan utveksle synspunkter og diskutere relevante prosessteknologiske problemstillinger"
      }
    },
    {
      "id": "01TK02E EITKKMFH24",
      "title": "Mikrobiologi og hygiene",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK02E-EITKKMFH24/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kjennskap om generell systematisering av mikroorganismer og mikrobiologisk terminologi har kunnskap om ulike typer mikroorganismers oppbygging, egenskaper og livsbetingelser og hvordan disse kan styres for kontroll av matproduksjon har kunnskap om de viktigste mikroorganismer som er forbundet med mat -og vannbåren sykdom har kunnskap om terminologi innen hygiene og forhold som sikrer eller truer mattryggheten har kunnskap om de grunnleggende prinsippene for god hygienepraksis og produksjonspraksis (grunnforutsetninger) har kunnskap om vannets rolle ved renhold, vannkvaliteter, lover og forskrifter i forhold til vann og matproduksjon har kunnskap om aktuelle analyseteknikker innen mikrobiologi og hygiene kan vurdere eget arbeid i forhold til lover og forskrifter innenfor området hygiene kjenner til matbransjens fokus på mattrygghet og kan se sammenhengen mellom hygiene og mikrobiologi i oppnåelse av dette har innsikt i lover og forskrifter knyttet til trygg matproduksjon og kan oppdatere sin kunnskap innen fagfeltet",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av aktuelle analyseteknikker for påvisning av enkelte mikroorganismer i matvarer og tolke resultat om matvarens kvalitet og trygghet kan gjøre rede for valg av metoder for kontroll på grunnforutsetninger kan reflektere over hygienefaktorer som påvirker matvarer og drøfte i samråd med andre hvilke kvalitetsforandringer dette kan medføre kan vurdere mikrobiologiske resultater og hygienefaktorer i en produksjonsprosess og treffe hensiktsmessige og begrunnede valg i henhold til lovverket innen matproduksjon kan finne relevant litteratur og holde seg oppdatert på lover og forskrifter i forhold til mikrobiologi og hygiene",
        "competence": "Generell kompetanse Studenten kan planlegge, gjennomføre og dokumentere laboratoriearbeid alene og som deltaker i gruppe i tråd med etiske krav og regelverk kan planlegge og gjennomføre kontroll på grunnforutsetninger kan utveksle synspunkter, samt diskutere hygiene og mikrobiologiske problemstillinger i forbindelse med trygg matproduksjon har utviklet forståelse for sammenhengen mellom hygiene og mikrobiologi forhold til forebyggende kvalitetsarbeid i bedriften for bevaring av trygge matvarer"
      }
    },
    {
      "id": "01TK02M EITKKMFH24",
      "title": "Matkjemi",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK02M-EITKKMFH24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om struktur, funksjon og egenskaper til vann og makro- næringsstoffer (proteiner, lipider, karbohydrater) i mat har kjennskap til struktur og funksjon til mikronæringsstoffer (vitaminer og mineraler) har kunnskap om funksjonelle grupper og klassifisering av organiske forbindelser som inngår i makro næringsstoffer har kunnskap om isomeri i relevante organiske forbindelser har kjennskap til oppbygningen av viktige bindingstyper i lipider, karbohydrater, proteiner og vann har kunnskap om de typiske kjemiske reaksjoner som har betydning for dannelse og nedbrytning av proteiner, lipider, karbohydrater og vitaminer kjenne til sentrale tilsetningsstoffer i næringsmidler, klassifisering og regelverk for bruk har kunnskap om næringsstoffenes betydning utfra et ernæringsperspektiv har kunnskap om analyseteknikker innen matkjemi kan navngi og tegne grunnleggende organiske og matkjemiske strukturer",
        "skills": "Ferdigheter Studenten kan anvende kunnskap om makro og-mikronæringsstoffer til å forklare hvordan de påvirker tekstur og kvalitet i mat kan anvende og gjøre rede for valg av analyseteknikker innen analyse av næringsstoffer, vann, salt og nedbrytningsprodukter i matvarer, samt kunne tolke resultater kan finne aktuelle kjemikalier i et stoffkartotek, samt anvende kjemikalier i henhold til sikkerhetsdatablad kan foreta beregninger i forhold til tilsetningsstoffer kan reflektere over analysearbeid innen analyser av råstoff og ferdig prosesserte produkter og drøfte i samråd med andre kan finne, vurdere og henvise til fagstoff innen matkjemi",
        "competence": "Generell kompetanse Studenten kan planlegge, gjennomføre og dokumentere laboratoriearbeid innen matkjemi, alene og som deltaker av gruppe i tråd med etiske krav og retningslinjer innenfor laboratoriearbeid kan delta i diskusjoner om utvikling av næringsmidler og om betydningen av prosessering for matens kjemiske sammensetning og næringsverdi har tilegnet seg et fundament for å kunne forstå kjemiske prosesser i mat og kan bidra til tolkning av kvalitetsanalyser kan forklare problemstillinger rundt matkjemi og egne funn til andre i en organisasjon"
      }
    },
    {
      "id": "01TK02J EITKKMFH24",
      "title": "Kvalitetsstyring og HMS",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK02J-EITKKMFH24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om kvalitetsledelse og styringssystemer for mattrygghet og HMS har kunnskap om internkontrollforskriftene IK-MAT og IK-HMS har grunnleggende kunnskap om HMS-arbeidet for å sikre trygt arbeidsmiljø har kunnskap om kvalitetsstyring av verdikjeden fra råvare til produkt og kjennskap til relevante analyseverktøy og digitale verktøy som anvendes kan vurdere og sikre at alle trinn i matproduksjonsprosessen utføres i henhold til lover, forskrifter og standarder som gjelder for matindustrien Har innsikt i lover og forskrifter knyttet til trygg matproduksjon og kan oppdatere sin kunnskap innen fagfeltet har kjennskap til ledelsessystemer for miljø",
        "skills": "Ferdigheter Studenten kan anvende regelverket og påse at matproduksjonen er innenfor bestemmelser for trygg produktkvalitet kan reflektere over HMS arbeidet i bedriften og anvende regelverket for å sørge for et trygt arbeidsmiljø kan delta aktivt i bedriftens forbedringsarbeid og beredskapsarbeid kan utarbeide, oppdatere og følge opp KS/HMS-systemer basert på gjeldende standarder og forskrifter, samt ved hjelp av relevante digitale verktøy kan finne og henvise til lovverket og vurdere relevansen for matfaglige problemstillinger",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre IK-mat og IK-HMS alene, som deltaker eller leder i gruppe i tråd med lovverket kan utveksle synspunkter med aktører i matbransjen og delta i diskusjoner om utvikling og utøvelse av kvalitetsstyringssystem i tråd med lovverket kan anvende kunnskap om kvalitetsledelse og styringssystemer for mattrygghet, HMS og miljø for å bidra til utvikling av kvalitet i alle ledd i matproduksjon"
      }
    },
    {
      "id": "01TK02N EITKKMFH24",
      "title": "Teknisk analyse",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK02N-EITKKMFH24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten Har kunnskap om ulike kromatografiske prinsipper og analysemetoder Har kunnskap om ulike spektroskopiske prinsipper og analysemetoder Har kunnskap om ulike elektrokjemiske analysemetoder Har kunnskap om analyseinstrumenter som utnytter egenskaper ved lysstråling Har kunnskap om begreper innen radioaktiv stråling Har kunnskap om sporbarhet i analyser Har kjennskap til ordningen med akkreditering av laboratorier i Norge Har kunnskap om begreper innen statistikk Har kunnskap om grafisk presentasjon av statistisk behandlet tallmateriell",
        "skills": "Ferdigheter Studenten ​ Kan gjøre rede for prinsipper ved ulike kjemiske analyser Kan utføre analyser med ulike analyseinstrumenter Kan behandle og rapportere resultater fra kjemiske analyser Kan dokumentere laboratoriearbeid og resultater med rapportskriving Kan reflektere over egen faglig utøvelse Kan bruke et stoffkartotek og gjøre rede for faremomenter ved behandling av organiske stoffer Kan bruke Excel for å gjennomføre enkle statistiske analyser",
        "competence": "Generell kompetanse Studenten Kan planlegge, gjennomføre og dokumentere en kjemisk analyse på en sikkerhetsmessig riktig måte Kan vurdere analyseresultater og sporbarheten i en kjemisk analyse Kan forklare hensikten med å kalibrere analyseinstrumenter Kan planlegge, gjennomføre og analysere et forsøk på en statistisk riktig måte Kan vurdere reproduserbarhet i målingene i en kvantitativ analyse"
      }
    },
    {
      "id": "01TK02K EITKKMFH24",
      "title": "Matkunnskap - kjøtt og fisk",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK02K-EITKKMFH24/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om anatomi, kjemisk sammensetning og råvareegenskaper i råstoffene fisk, kjøtt og egg har kunnskap om avlivning, primær- og sekundærprosessering av fisk og kjøtt har kunnskap om autolytisk- og mikrobiologisk nedbrytning av kjøtt og fisk har kunnskap om råvaretilstand og produktkvalitet, samt faktorer som påvirker kvalitet på sluttproduktet har kunnskap innen konserverings -og emballasjeteknologi, samt krav til merking som gjelder innen kjøtt og fiskebransjen kan vurdere hvordan behandling av råstoffet og prosesseringsbetingelser kan påvirke produktkvalitet har kunnskap om bærekraftig matproduksjon og hvordan behandling av råstoff, prosessbetingelser, emballering og logistikk kan optimaliseres for å senke sluttproduktets miljøbelastning har kunnskap om lovverket i forbindelse med råvarer og prosessering kjenner til norsk egg, kjøtt- og fiskebransje mattradisjoner og framtidige utviklingsmuligheter kan oppdatere sin kunnskap innen fagfeltet",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av konserveringsmetoder og emballasje kan anvende relevante lover, forskrifter og standarder som gjelder ved merking av næringsmidler kan anvende kunnskap om råvareegenskaper og produksjonsprosesser for å praktisere prosessforbedringer og produktutvikling kan identifisere relevante bærekraftutfordringer knyttet til ulike steg i verdikjeden for kjøtt og fiskeprodukter kan anvende kunnskap om produktkvalitet og kvalitetsavvik, hvilke toleransegrenser som er fastsatt i en bedrift og hvilke prosedyrer som gjelder for godkjenning og avvisning av råvarer i henhold til lovverket",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre prosjekter for prosessering av råvarer alene eller i samarbeid med andre i tråd med etiske krav og regelverk kan se sammenhengen mellom råvare -og ferdigvarekvalitet av kjøtt og fisk og vurdere produksjonsmetoder som bør anvendes kan kommunisere om fisk- og kjøttfaglige problemstillinger med andre i bransjen og delta i diskusjon om utvikling av produksjon og prosessforbedringer har utviklet forståelse omkring betydning av bærekraftig matproduksjon og kan bidra til bærekraftig drift og produksjon"
      }
    },
    {
      "id": "01TK02L EITKKMFH24",
      "title": "Matkunnskap - melk og vegetabilier",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK02L-EITKKMFH24/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om råstoffene som inngår i melk -og vegetabil produkter har kunnskap om videreforedlingsmetoder, lagringsbetingelser og emballering som inngår i melk- og vegetabilier har kunnskap om produktkvalitet samt forståelse for hvordan fremstilling og behandling av råstoffet påvirker sluttproduktets kvalitet og holdbarhet har kunnskap om beregning ved matproduksjon har kunnskap om prosesser og konserveringsmetoder anvendt ved fremstilling av melk- og vegetabilske produkter har kunnskap om sensorikk og sensoriske analyser anvendt i bedømmelse av matkvalitet kan vurdere hvordan prosesseringsbetingelser kan påvirke produktkvalitet har kjennskap til norsk melk-, og vegetabilbransjes mattradisjoner og framtidige utviklingsmuligheter har innsikt i bærekraftig produksjon gjennom hele verdikjeden fra fremstilling av råstoff til produkt og kunne tilegne seg oppdatert kunnskap",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av ulike prosesstrinn, prosesslinjer og konserveringsmetoder anvendt ved fremstilling av ulike melke -og vegetabilske produkter kan vurdere ulike videreforedlingsmetoder, emballerings -og oppbevaringsmetoder med tanke på produktkvalitet, holdbarhet og bærekraft kan utføre beregninger ved produksjon kan anvende kunnskap om råvareegenskaper og produksjonsprosesser for å praktisere prosessforbedringer og produktutvikling kan anvende kunnskap om råvare -og ferdigvarekvalitet av melk og vegetabilier oppimot lovverket og vurdere hvilke tiltak som gjennomføres i en produksjonsprosess kan planlegge, gjennomføre og vurdere en enkel sensorisk analyse, samt evaluere og formidle resultater av analysen kan oppdatere sin kunnskap innen melk og vegetabilier kan reflektere over bærekrafts utfordringer knyttet til melk og vegetabilier",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre prosjekter for prosessering av råvarer alene eller i samarbeid med andre i tråd med etiske krav og regelverk kan se sammenhengen mellom råvare -og ferdigvarekvalitet av melk og vegetabilier og vurdere produksjonsmetoder som bør anvendes kan kommunisere om melk- og vegetabilfaglige problemstillinger med andre i bransjen og delta i diskusjon om utvikling av produksjon og prosessforbedringer kan bidra til å utvikle produksjonsprosesser innen melk og vegetabil produksjoner som bidrar til en bærekraftig verdiskapning"
      }
    },
    {
      "id": "01TK02P EITKKMFH24",
      "title": "Prosjektsstyring og hovedprosjekt",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK02P-EITKKMFH24/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om ideutvikling og problemformulering i initieringsfase av et prosjekt har kunnskap om grunnleggende prosjektledelse for praktisering av prosjektstyring og prosjektorganisering har kunnskap om styringssløyfa og andre begreper innen prosjektstyring, samt IT-baserte prosjektstyringsverktøy har kunnskap om hvordan man utformer en vitenskapelig rapport har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor matteknikk har kunnskap om hvordan og hvor man innhenter relevant informasjon på en kildekritisk måte over et selvvalgt tema kan vurdere eget prosjektarbeid i forhold til gjeldende lovverk, normer og krav",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av tema for hovedprosjektet kan utvikle ideer og formulere problemstilling og prosjektmål kan bruke IT-baserte prosjektstyringsverktøy i planlegging og oppfølging av aktiviteter, ressurser, kostnader, tidsbruk og nettverksplanlegging kan planlegge, gjennomføre, dokumentere og evaluere et prosjekt i samarbeid med andre kan anvende teori og praksis erfaring i gjennomføring av prosjektet, samt drøfte sammenhengen mellom teori og praksis kan jobbe strukturert, målrettet og vise evne til refleksjon kan kommunisere og presentere et prosjekt kan finne og henvise til informasjon og fagstoff for å vurdere kritisk relevansen til prosjektet",
        "competence": "Generell kompetanse Studenten kan initiere, planlegge og gjennomføre et faglig prosjekt ved hjelp at IT-basert prosjektstyringsverktøy og utarbeide relevant dokumentasjon kan utveksle synspunkter med andre og delta i diskusjoner om styring av et prosjekt kan som deltaker i prosjektarbeid fordype seg i tema som danner grunnlag for prosjektet, bidra med egen kompetanse, samt tenke kreativt og nyskapende kan drøfte betydningen av en bedrifts konkurranseevne og verdiskaping i forbindelse med prosjektarbeid, samt i et bærekraftperspektiv"
      }
    }
  ]
}