{
  "study_programs": [
    {
      "id": "Mekatronikk - 120",
      "title": "Mekatronikk",
      "description": "Moderne produktutvikling og produksjonsteknikk trenger fagfolk som jobber tverrfaglig for å løse komplekse arbeidsoppgaver. Mekatronikk kombinerer mekanikk, elektronikk og datateknikk og rekrutterer fra både elektro-, automasjons- og maskinfagene.",
      "study_location": "Kongsberg (Samlingsbasert 4 år) | Kongsberg (Heltid 2 år) | Fredrikstad (Deltid 3 år)",
      "credits": 120,
      "language": "Norsk",
      "level": "Høyere fagskolegrad",
      "why_choose": "Utstyr og produkter som tidligere var helt mekaniske, utnytter i dag de mulighetene som et samspill av elektronikk, datateknikk, mekanikk, maskinlæring og kunstig intelligens åpner for. Mekatronikk er en flerfaglig utdanning som kombinerer alle disse fagområdene, og som skal gi en flerfaglig forståelse. Studiet rekrutterer fra både elektro-, automasjons- og maskinfagene.",
      "what_learn": "I denne nettbaserte deltidsutdanningen lærer du å planlegge, bygge og vedlikeholde automatiserte systemer som kombinerer mekanikk, elektro og datateknologi. Du får innsikt i hvordan moderne produksjon kan styres og optimaliseres gjennom digitale løsninger og robotteknologi.\nUndervisningen kombinerer teori og erfaringsbasert læring. Du bruker egne yrkeserfaringer i oppgaver, refleksjon og samarbeid med andre studenter.\nStudiet består av 14 emner som dekker fagområdene mekanikk, elektro, automasjon, digital styring, prosjektledelse og bærekraft. Når du fullfører alle emner, oppnår du høyere fagskolegrad i mekatronikk.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger | Studiet kombinerer nettundervisning med fysiske samlinger ved studiested Kongsberg. Samlingene holdes vanligvis fire ganger i året og varer inntil en arbeidsuke. Mellom samlingene deltar du i nettundervisning to kvelder i uken, med forelesninger, oppgaver og veiledning. | Undervisningen veksler mellom teori, laboratoriearbeid, prosjekt og gruppearbeid, og legger stor vekt på praktisk anvendelse. | Endelig plan for samlinger og undervisningstider publiseres på | studentsiden for Kongsberg | før oppstart.",
      "police_certificate": null,
      "career_opportunities": "Utdanningen kvalifiserer til stillinger som leder i bedrifter med arbeidsoppgaver innenfor produksjonsledelse, vedlikehold, kvalitetssikring, logistikk, produktutvikling, forbedringsarbeid, innkjøp av varer og tjenester og etablering av egen virksomhet innen mekatronikk og produksjon.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/teknologi-og-industri/mekatronikk"
    }
  ],
  "courses": [
    {
      "id": "01TX00A",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om realfag som redskap innen sitt fagområde. | har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes | kan utføre beregninger, overslag og problemløsning relevant for dimensjoneringer og andre problemstillinger innen studieretningen | kan vurdere eget arbeid i henhold til matematiske og fysiske lover | kan utvide sine kunnskaper og har innsikt i egne utviklingsmuligheter innen realfag. | kjenner til matematikkens og fysikkens egenart og plass i samfunnet",
        "skills": "Ferdigheter | Studenten: | kan gjøre rede for valg av regnemetode som anvendes for å løse faglige problemer | kan gjøre rede for valg av digitale verktøy som anvendes til problemløsning innen realfaglige tema | kan anvende digitale hjelpemidler til å løse matematiske problemer | kan vurdere resultater av beregninger, samt reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til relevant informasjon og fagstoff i formelsamlinger, tabeller og fagbøker | kan kartlegge en situasjon og identifisere realfaglige problemstillinger | har kjennskap til og kan anvende grunnleggende fysiske lover og fysikkens metodikk | kan tolke og anvende modeller som benyttes innen matematikk og fysikk",
        "competence": "Generell kompetanse | Studenten: | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov | har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger | har innsikt i rekkevidde og begrensninger for de metoder som anvendes | kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om grunnleggende kommunikasjonsteori | kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen | har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde | har kunnskap om sentrale retoriske begreper og virkemidler | har kunnskap om kildebruk og referanseteknikk etter standard for høyere utdanning | kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter | har kjennskap til hvordan man organiserer og produserer tekst | har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne | har kunnskap om språket som verktøy for god kommunikasjon og kjenner til norsk og engelsk fagterminologi innen sitt fagområde | har kunnskap om grammatikk, sjangerforståelse samt språklige, stilistiske og grafiske virkemidler i tekst.",
        "skills": "Ferdigheter | Kandidaten: | kan reflektere over møter mellom forskjellige arbeidslivskulturer | kan bruke relevante begreper for å analysere egen og andres tekst | kan reflektere over og revidere tekster | kan reflektere over hvordan retorikk benyttes | kan bygge opp saklig argumentasjon og bruke retoriske virkemiddel | kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig | kan reflektere over egen kommunikasjon i profesjonell sammenheng | kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker | kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng | kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og tekstbinding | kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse | Kandidaten: | kan kommunisere hensiktsmessig for å bidra til en inkluderende og bærekraftig organisasjonskultur | kan tilpasse språk og argumentasjon etter mål og mottaker | kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting | behersker relevante kommunikasjonsverktøy | kan kommunisere gjennom relevante tekster og kanaler | kan samarbeide om tekstproduksjon | kan utvise etikk og gode holdninger i arbeidslivet | kan reflektere over ulike verdier og tenkemåter i samfunnet"
      }
    },
    {
      "id": "01TX00C",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak | har kunnskap om lønnskostnader | har kunnskaper om mål, tiltak og handlingsplaner | kjenner til emnets aktuelle lover og avtaler | har erfaringsbasert kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer.",
        "skills": "Ferdigheter | Kandidaten: | kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser | kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler | kan vurdere bedriftens betalingsevne og kapitalbehov | kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik | kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering | kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler | kan foreta en helhetlig prisvurdering og utarbeide kalkyler | kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten | kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel | kan identifisere, analysere og utvikle medarbeidernes kompetanse | kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon | kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse | kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier | kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes | kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse | Kandidaten | kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter | kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar | har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid | kan kommunisere internt og eksternt og benytte digitale verktøy til dette. | kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner | kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TT00A",
      "title": "HMS-, prosjekt- og kvalitetsledelse",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00A/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om grunnleggende HMS-, prosjekt- og kvalitetsledelse | har kunnskap til å se sammenheng mellom fagenes historiske utvikling og kontinuerlig endring også i framtiden | har kunnskap om styringsverktøy for igangsetting, planlegging og gjennomføring av prosjekter | har kunnskap om kvalitetsbegreper | har kunnskap om utarbeidelse, bruk og vedlikehold av HMS-, IK-system og KS, i samsvar med lover, forskrifter og standarder | kan vurdere eget og andres HMS-, prosjekt-, og kvalitetsarbeid i forhold til gjeldende normer og krav | har innsikt i egne utviklingsmuligheter innen HMS-, prosjekt- og kvalitetsledelse",
        "skills": "Ferdigheter | Studenten | kan reflektere over et sikkert arbeidsmiljø og ut ifra dette, planlegge og iverksette systematiske tiltak for å forhindre skade på mennesker, materiell og miljø | kan gjøre rede for aktiviteter som sikrer kvalitet | kan gjøre rede for styringen av et prosjekt med hensyn til tid, kost og kvalitet | kan gjøre rede for sine faglige valg kvalitativt og kvantitativt | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for aktuelle problemstillinger knyttet til HMS- prosjekt og kvalitetsledelse | kan reflektere over egen faglig utøvelse og justere denne under veiledning",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre et prosjekt, samt utarbeide relevant dokumentasjon | kan utveksle synspunkter og delta i diskusjoner om hvordan  HMS-, prosjekt- og kvalitetsledelse kan utøves | kan bidra til et godt og sikkert fysisk og psykisk arbeidsmiljø med fokus på aktivt vernearbeid | kan bidra til organisasjonsutvikling innen HMS-, prosjekt- og kvalitetsarbeid"
      }
    },
    {
      "id": "01TT00B",
      "title": "Mekanikk",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00B/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om statikk og grunnleggende mekanikk | har kunnskap om materialers fasthetsegenskaper for dimensjoneringsanalyse | kan gjøre rede for hvordan identifisere og beregne krefter, momenter og deformasjoner i mekaniske konstruksjoner | kan vurdere design og konstruksjon av produkter i forhold til gjeldende normer og krav | har innsikt i egne utviklingsmuligheter innen konstruksjon og dokumentasjon",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for hvordan identifisere og beregne krefter, momenter og deformasjoner i mekaniske konstruksjoner | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre arbeidsoppgaver innen mekanisk konstruksjon | kan utføre arbeidet etter oppdragsgivers behov | kan utveksle synspunkter med fagfeller på tvers av fagområder | kan utveksle faglige synspunkter på problemstillinger og delta i diskusjoner"
      }
    },
    {
      "id": "01TT00C",
      "title": "Materialkunnskap",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00C/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om moderne konstruksjonsmaterialer, prosesser og verktøy for fremstilling av produkter | kan vurdere konstruksjonsmaterialer i henhold til produktstandarder | kan vurdere egne arbeid innen materialteknologi i henhold til gjeldende normer og standarder | har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for aktuelle konstruksjonsmaterialer | kan reflektere over materialtekniske valg og vurdere moderne og bærekraftige materialer | kan finne og henvise til normer og standarder og vurdere relevansen i forbindelse med materialvalg | kan gjøre rede for sine faglige valg med fokus på miljø og bærekraft",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre materialtekniske arbeidsoppgaver selvstendig, og som deltaker i et team i en bærekraftig utvikling | kan utveksle synspunkter med andre med bakgrunn innenfor bransjen/ yrket og delta i diskusjoner om utvikling av god praksis | kan bidra til organisasjonsutvikling | ​"
      }
    },
    {
      "id": "01TT00K",
      "title": "Elektroteknikk",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00K/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om aktuelle elektriske og elektroniske komponenter, koblingsskjemaer og relevant elektroteknisk dokumentasjon etter gjeldende standard | har kunnskap om sikkerhetsaspektet i eller nær spenningssatte anlegg i henhold til normer og krav | har kunnskap om strømarter, effekter og lavspente styringssystemer | kjenner til prinsipper rundt programmering innen automasjonssystemer | kan vurdere eget arbeid i forhold til gjeldende normer og krav | har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for sammenhengen mellom resistans, strøm, spenning og effekt | kan gjøre rede for komponenter og kretser | kan gjøre rede for programmer i automasjonssystemer | kan gjøre rede for koblingsskjemaer og feilsøking | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer | kan utveksle synspunkter med andre med bakgrunn innenfor bransjen/ yrket og delta i diskusjoner om utvikling av god praksis | kan bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TT00L",
      "title": "Teknisk dokumentasjon",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00L/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om DAK og aktuelle standarder, normer og krav som benyttes i tegningsproduksjon | har kunnskap om 2D- og 3D-modellering | kan vurdere eget arbeid i henhold til gjeldende standarder, normer og krav | har bransjekunnskap og kjennskap til yrkesfeltet | har innsikt i egne utviklingsmuligheter med designverktøy | har forståelse i tegningslesing innenfor andre disipliner",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for valg av designverktøy | kan gjøre rede for oppbygningen av teknisk dokumentasjon og revisjonshåndtering | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til standarder, normer og krav | kan anvende faglig kunnskap på praktiske og teoretiske problemstillinger",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre design- og konstruksjonsdokumentasjon | kan utveksle faglige synspunkter på problemstillinger og delta i diskusjoner | kan redegjøre for egen og bransjens struktur i lagring og arkivering av dokumentasjon"
      }
    },
    {
      "id": "01TT00R",
      "title": "Energiteknikk",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00R/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om termodynamikkens grunnbegreper, samt oppbygningen og virkemåten til aktuelle energisystemer | har kunnskap om norsk energiforsyning, produksjonsmetoder og distribusjon av elektrisk kraft | har kunnskap om forskjellige elektriske maskiner | har kunnskap om batteriteknologier og hva som preger ny utvikling | kan vurdere eget arbeid i henhold til HMS, lover, forskrifter, normer og standarder | har kunnskap om energiteknikk | kjenner til energiteknikkens historie, tradisjoner, egenart og plass i samfunnet | har innsikt i egne utviklingsmuligheter innen energiteknikk",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for termodynamikkens oppbygning og virkemåten til aktuelle energisystemer | kan gjøre rede for bruken av analyseverktøy | kan gjøre rede for prinsippene i norsk energiforsyning produksjonsmetoder og distribusjon | kan gjøre rede for aktuelle batteriteknologier og hva som preger ny utvikling | kan reflektere over eget arbeid i henhold til gjeldende HMS-regler, lover, forskrifter, normer og standarder | kan reflektere over energiteknikkens miljøpåvirkning og plass i samfunnet | kan reflektere over egne utviklingsmuligheter innen energiteknikk | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling | kan gjøre rede for oppbygging og virkemåte av elektriske maskiner og aktuelle energisystemer | kan gjøre rede for kjølemediers påvirkning på miljøet",
        "competence": "Generell kompetanse | Studenten | kan planlegge, prosjektere og iverksette løsninger for energiteknikk alene, eller som deltaker av en gruppe | kan utføre arbeid etter oppdragsgivers behov i tråd med etiske krav og retningslinjer | kan bidra med faglige synspunkter på problemstillinger og delta i diskusjoner | kan bidra til organisasjonsutvikling | kan bidra til at det utarbeides bruker- og servicedokumentasjon"
      }
    },
    {
      "id": "01TT00T",
      "title": "Digital automatisering 1",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00T/2028-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om relevante komponenter som brukes i moderne industrielle prosesser | har kunnskap om industrielle styresystemer | har kunnskap om design av brukergrensesnitt for operasjon av industrielle prosesser | har kunnskap om programmering av PLS og dokumentasjon av PLS programmer i en industriell sammenheng | har kunnskap om elektriske, pneumatiske og hydrauliske sensorer og aktuatorer som inngår i mekatronikksystemer | har kunnskap om sikkerhet og hvordan det gjennomføres i mekatronikksystemer | kan vurdere eget arbeid i forhold til gjeldende normer og krav, innen hydraulikk, pneumatikk, industrielle styringssystemer og PLS-programmering | kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet, og forstår hvordan utviklingen innen robotteknologi og automasjon har bidratt til effektivisering og teknologisk fremgang i industrien | har innsikt i egne utviklingsmuligheter gjennom arbeid med PLS-programmering, hydrauliske og pneumatiske systemer samt grunnleggende robotprogrammering",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for relevante komponenter som brukes i moderne industrielle sammenhenger | kan gjøre rede for prosjektering av aktuelle styresystemer | kan gjøre rede for kalibrering og justering av instrumenter innen styringssystemer | kan gjøre rede for brukergrensesnitt for operasjon av industrielle prosesser | kan reflektere over egen og andres faglige utførelse innen moderne industrielle sammenhenger og implementere endringer basert på erfaring | kan finne og henvise til teknisk informasjon og fagstoff for produkter og systemer, samt vurdere relevansen mot en yrkesfaglig problemstilling | kan gjøre rede for programmering av PLS og dokumentasjon av PLS programmer i en industriell sammenheng | kan gjøre rede for valg av elektriske, pneumatiske og hydrauliske sensorer og aktuatorer som benyttes i mekatronikksystemer | kan gjøre rede for sikkerhet og hvordan det gjennomføres i mekatronikksystemer",
        "competence": "Generell kompetanse | Studenten | kan i samarbeid med andre yrkesgrupper planlegge, prosjektere, dokumentere, implementere og drifte produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som gjelder innenfor moderne industrielle sammenhenger | kan utveksle synspunkter og henvise til teknisk og innovativ informasjon og fagstoff om moderne industrielle sammenhenger og produksjon for produkt og systemer | kan bidra til organisasjonsutvikling ved å anvende kunnskap om hydrauliske og pneumatiske systemer, robotteknologi og industriell automasjon med PLS, og ved å implementere løsninger og arbeidsmetoder som støtter digitalisering og teknologisk utvikling i virksomheten."
      }
    },
    {
      "id": "01TT06F EITKMEKH24",
      "title": "Digital automatisering 2",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT06F-EITKMEKH24/2029-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om styresystemer og mekanisk oppbygning av roboter som brukes i mekatronikksystemer | har kunnskap til ulike robot-teknologier og hvordan de anvendes i industrien | har kunnskap om sensorer, aktuatorer, robotsyn, gripere, kringutstyr og andre komponenter som benyttes i forbindelse med robotceller | har kunnskap om planlegging og dokumentasjon av mekatronikksystemer med robotceller | har kunnskap om sikkerhet og hvordan det gjennomføres i mekatronikksystemer med robotceller | har kunnskap om programmering av ulike robotsystemer | kan vurdere eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder | har innsikt i egne utviklingsmuligheter innen fagområdet | har kunnskap om bransjer som arbeider innen fagområdet | har kunnskap om relevante komponenter som brukes i moderne industrielle produksjonssystemer. | har kunnskap om industrielle produksjonssystemer. | har kunnskap om design og brukergrensesnitt av industrielle produksjonssystemer | har kunnskap om programmering av PLS og dokumentasjon av PLS programmer i en industriell sammenheng | har kunnskap om sikkerhet og hvordan det gjennomføres i mekatronikksystemer",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for relevante komponenter som brukes i moderne industrielle sammenhenger | Kan gjøre rede for prosjektering av aktuelle styresystemer. | kan gjøre rede for kalibrering og justering av instrumenter innen styringssystemer | kan gjøre rede for brukergrensesnitt for operasjon av industrielle prosesser. | kan reflektere over egen og andres faglige utførelse innen moderne industrielle sammenhenger og implementere endringer basert på erfaring | kan finne og henvise til teknisk informasjon og fagstoff for produkter og systemer, samt vurdere relevansen mot en yrkesfaglig problemstilling | kan gjøre rede for sikkerhet og hvordan det gjennomføres i industrielle produksjonssystemer",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver i tråd med etiske krav og retningslinjer for kvalitet og miljø | kan planlegge, prosjektere og iverksette løsninger for mekatronikksystemer med robotceller alene, eller som deltaker av en gruppe | kan utveksle synspunkter med andre med bakgrunn innenfor bransjen og delta i diskusjoner om utvikling av god praksis | kan bidra til at det utarbeides bruker- og servicedokumentasjon | kan utveksle synspunkter og henvise til teknisk og innovativ informasjon og fagstoff om moderne industrielle sammenhenger og produksjon for produkt og systemer"
      }
    },
    {
      "id": "01TT06E EITKMEKH24",
      "title": "Analog og digitalteknikk med PCB-design",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT06E-EITKMEKH24/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om bruken og funksjonen til analog- og digitalelektronikk | har kunnskap om mikroelektronikk og kretskortdesign | har kunnskap om programmering og virkemåten til programmerbare komponenter | har kunnskap om kraftelektronikk | har kunnskap om EMC og om hvordan elektrisk utstyr påvirker hverandre | kjenner til EMI | har kunnskap om programvare til konstruksjon og analyse av elektriske skjemaer | kan vurdere eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder | har innsikt i egne utviklingsmuligheter innen fagområdet | har kunnskap om bransjer som arbeider innen fagområde",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for bruk og funksjon av analog- og digitalelektronikk | kan gjøre rede for mikroelektronikk og kretskortdesign | kan gjøre rede for virkemåten til kraftelektronikk | kan gjøre rede for hvordan elektrisk utstyr påvirker hverandre (EMC) | kan gjøre rede for virkemåte og programmering av programmerbare komponenter | kan reflektere over eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig bakgrunn",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer | kan utveksle synspunkter med andre med bakgrunn innenfor bransjen/ yrket og delta i diskusjoner om utvikling av god praksis | kan bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TT06D EITKMEKH24",
      "title": "Teknisk design og dokumentasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT06D-EITKMEKH24/2027-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om DAK og standarder som benyttes i tegningsproduksjon | har kunnskap om hvordan simuleringer og analyser utføres med DAK | har kunnskap om bearbeidingsmetoder for å tilvirke 3D-modeller | har kunnskap om universell utforming | har kunnskap om innhold som inngår i sluttdokumentasjon til oppdragsgiver | har kunnskap om konfigurasjonsstyring, logistikk og sporbarhet | har kunnskap om de aktuelle direktivene og hva som inngår i en CE-merking | kan vurdere eget arbeid innen dokumentering av mekatronikksystemer i henhold til gjeldende lover, forskrifter, normer og standarder | har innsikt i egne utviklingsmuligheter innen fagområdet | har kunnskap om bransjer som arbeider innen fagområdet",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for konsept og design av produkter og systemer | kan gjøre rede for design-prinsipper i henhold til krav fra oppdragsgiver | kan gjøre rede for valg av tilvirkning av 3D-modeller | kan gjøre rede for universell utforming | kan gjøre rede for designprosessen ved utvikling og forbedring av produkter | kan gjøre rede for kravspesifikasjon med omfang, regelverk, miljøhensyn og andre rammebetingelser | kan gjøre rede for et mekatronikksystems tekniske dokumentasjon i henhold til bransjestandarder | kan finne og henvise til fagstoff om teknisk dokumentasjon og administrasjon | kan gjøre rede for aktuelle direktiv og CE-merking | kan reflektere over eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer | kan utveksle synspunkter med andre med bakgrunn innenfor bransjen/ yrket og delta i diskusjoner om utvikling av god praksis | kan bidra til organisasjonsutvikling | kan bidra til at det utarbeides bruker- og servicedokumentasjon"
      }
    },
    {
      "id": "01TX00H",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H/2028-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om hvordan man skriver en prosjektrapport | har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen | har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt | har kunnskap om sammenhengen mellom teori og praksis | kan vurdere eget prosjekt i forhold til gjeldende normer og krav | kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for valg av tema for hovedprosjekt | kan identifisere, kartlegge og vurdere en faglig problemstilling | kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat | kan skrive en prosjektrapport | kan drøfte sammenhengen mellom teori og praksis | kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk | kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer | har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende | kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov | kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    },
    {
      "id": "01TX00A",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om realfag som redskap innen sitt fagområde. | har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes | kan utføre beregninger, overslag og problemløsning relevant for dimensjoneringer og andre problemstillinger innen studieretningen | kan vurdere eget arbeid i henhold til matematiske og fysiske lover | kan utvide sine kunnskaper og har innsikt i egne utviklingsmuligheter innen realfag. | kjenner til matematikkens og fysikkens egenart og plass i samfunnet",
        "skills": "Ferdigheter | Studenten: | kan gjøre rede for valg av regnemetode som anvendes for å løse faglige problemer | kan gjøre rede for valg av digitale verktøy som anvendes til problemløsning innen realfaglige tema | kan anvende digitale hjelpemidler til å løse matematiske problemer | kan vurdere resultater av beregninger, samt reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til relevant informasjon og fagstoff i formelsamlinger, tabeller og fagbøker | kan kartlegge en situasjon og identifisere realfaglige problemstillinger | har kjennskap til og kan anvende grunnleggende fysiske lover og fysikkens metodikk | kan tolke og anvende modeller som benyttes innen matematikk og fysikk",
        "competence": "Generell kompetanse | Studenten: | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov | har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger | har innsikt i rekkevidde og begrensninger for de metoder som anvendes | kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om grunnleggende kommunikasjonsteori | kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen | har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde | har kunnskap om sentrale retoriske begreper og virkemidler | har kunnskap om kildebruk og referanseteknikk etter standard for høyere utdanning | kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter | har kjennskap til hvordan man organiserer og produserer tekst | har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne | har kunnskap om språket som verktøy for god kommunikasjon og kjenner til norsk og engelsk fagterminologi innen sitt fagområde | har kunnskap om grammatikk, sjangerforståelse samt språklige, stilistiske og grafiske virkemidler i tekst.",
        "skills": "Ferdigheter | Kandidaten: | kan reflektere over møter mellom forskjellige arbeidslivskulturer | kan bruke relevante begreper for å analysere egen og andres tekst | kan reflektere over og revidere tekster | kan reflektere over hvordan retorikk benyttes | kan bygge opp saklig argumentasjon og bruke retoriske virkemiddel | kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig | kan reflektere over egen kommunikasjon i profesjonell sammenheng | kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker | kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng | kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og tekstbinding | kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse | Kandidaten: | kan kommunisere hensiktsmessig for å bidra til en inkluderende og bærekraftig organisasjonskultur | kan tilpasse språk og argumentasjon etter mål og mottaker | kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting | behersker relevante kommunikasjonsverktøy | kan kommunisere gjennom relevante tekster og kanaler | kan samarbeide om tekstproduksjon | kan utvise etikk og gode holdninger i arbeidslivet | kan reflektere over ulike verdier og tenkemåter i samfunnet"
      }
    },
    {
      "id": "01TX00C",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak | har kunnskap om lønnskostnader | har kunnskaper om mål, tiltak og handlingsplaner | kjenner til emnets aktuelle lover og avtaler | har erfaringsbasert kunnskap om bransjens økonomiske utvikling og bransjens ledelsesutfordringer.",
        "skills": "Ferdigheter | Kandidaten: | kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser | kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler | kan vurdere bedriftens betalingsevne og kapitalbehov | kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik | kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering | kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler | kan foreta en helhetlig prisvurdering og utarbeide kalkyler | kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten | kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel | kan identifisere, analysere og utvikle medarbeidernes kompetanse | kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon | kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse | kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier | kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes | kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse | Kandidaten | kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter | kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar | har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid | kan kommunisere internt og eksternt og benytte digitale verktøy til dette. | kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner | kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TT00A",
      "title": "HMS-, prosjekt- og kvalitetsledelse",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om grunnleggende HMS-, prosjekt- og kvalitetsledelse | har kunnskap til å se sammenheng mellom fagenes historiske utvikling og kontinuerlig endring også i framtiden | har kunnskap om styringsverktøy for igangsetting, planlegging og gjennomføring av prosjekter | har kunnskap om kvalitetsbegreper | har kunnskap om utarbeidelse, bruk og vedlikehold av HMS-, IK-system og KS, i samsvar med lover, forskrifter og standarder | kan vurdere eget og andres HMS-, prosjekt-, og kvalitetsarbeid i forhold til gjeldende normer og krav | har innsikt i egne utviklingsmuligheter innen HMS-, prosjekt- og kvalitetsledelse",
        "skills": "Ferdigheter | Studenten | kan reflektere over et sikkert arbeidsmiljø og ut ifra dette, planlegge og iverksette systematiske tiltak for å forhindre skade på mennesker, materiell og miljø | kan gjøre rede for aktiviteter som sikrer kvalitet | kan gjøre rede for styringen av et prosjekt med hensyn til tid, kost og kvalitet | kan gjøre rede for sine faglige valg kvalitativt og kvantitativt | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for aktuelle problemstillinger knyttet til HMS- prosjekt og kvalitetsledelse | kan reflektere over egen faglig utøvelse og justere denne under veiledning",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre et prosjekt, samt utarbeide relevant dokumentasjon | kan utveksle synspunkter og delta i diskusjoner om hvordan  HMS-, prosjekt- og kvalitetsledelse kan utøves | kan bidra til et godt og sikkert fysisk og psykisk arbeidsmiljø med fokus på aktivt vernearbeid | kan bidra til organisasjonsutvikling innen HMS-, prosjekt- og kvalitetsarbeid"
      }
    },
    {
      "id": "01TT00B",
      "title": "Mekanikk",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00B/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om statikk og grunnleggende mekanikk | har kunnskap om materialers fasthetsegenskaper for dimensjoneringsanalyse | kan gjøre rede for hvordan identifisere og beregne krefter, momenter og deformasjoner i mekaniske konstruksjoner | kan vurdere design og konstruksjon av produkter i forhold til gjeldende normer og krav | har innsikt i egne utviklingsmuligheter innen konstruksjon og dokumentasjon",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for hvordan identifisere og beregne krefter, momenter og deformasjoner i mekaniske konstruksjoner | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre arbeidsoppgaver innen mekanisk konstruksjon | kan utføre arbeidet etter oppdragsgivers behov | kan utveksle synspunkter med fagfeller på tvers av fagområder | kan utveksle faglige synspunkter på problemstillinger og delta i diskusjoner"
      }
    },
    {
      "id": "01TT00C",
      "title": "Materialkunnskap",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00C/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om moderne konstruksjonsmaterialer, prosesser og verktøy for fremstilling av produkter | kan vurdere konstruksjonsmaterialer i henhold til produktstandarder | kan vurdere egne arbeid innen materialteknologi i henhold til gjeldende normer og standarder | har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for aktuelle konstruksjonsmaterialer | kan reflektere over materialtekniske valg og vurdere moderne og bærekraftige materialer | kan finne og henvise til normer og standarder og vurdere relevansen i forbindelse med materialvalg | kan gjøre rede for sine faglige valg med fokus på miljø og bærekraft",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre materialtekniske arbeidsoppgaver selvstendig, og som deltaker i et team i en bærekraftig utvikling | kan utveksle synspunkter med andre med bakgrunn innenfor bransjen/ yrket og delta i diskusjoner om utvikling av god praksis | kan bidra til organisasjonsutvikling | ​"
      }
    },
    {
      "id": "01TT00K",
      "title": "Elektroteknikk",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00K/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om aktuelle elektriske og elektroniske komponenter, koblingsskjemaer og relevant elektroteknisk dokumentasjon etter gjeldende standard | har kunnskap om sikkerhetsaspektet i eller nær spenningssatte anlegg i henhold til normer og krav | har kunnskap om strømarter, effekter og lavspente styringssystemer | kjenner til prinsipper rundt programmering innen automasjonssystemer | kan vurdere eget arbeid i forhold til gjeldende normer og krav | har innsikt i egne utviklingsmuligheter",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for sammenhengen mellom resistans, strøm, spenning og effekt | kan gjøre rede for komponenter og kretser | kan gjøre rede for programmer i automasjonssystemer | kan gjøre rede for koblingsskjemaer og feilsøking | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer | kan utveksle synspunkter med andre med bakgrunn innenfor bransjen/ yrket og delta i diskusjoner om utvikling av god praksis | kan bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TT00L",
      "title": "Teknisk dokumentasjon",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00L/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om DAK og aktuelle standarder, normer og krav som benyttes i tegningsproduksjon | har kunnskap om 2D- og 3D-modellering | kan vurdere eget arbeid i henhold til gjeldende standarder, normer og krav | har bransjekunnskap og kjennskap til yrkesfeltet | har innsikt i egne utviklingsmuligheter med designverktøy | har forståelse i tegningslesing innenfor andre disipliner",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for valg av designverktøy | kan gjøre rede for oppbygningen av teknisk dokumentasjon og revisjonshåndtering | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til standarder, normer og krav | kan anvende faglig kunnskap på praktiske og teoretiske problemstillinger",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre design- og konstruksjonsdokumentasjon | kan utveksle faglige synspunkter på problemstillinger og delta i diskusjoner | kan redegjøre for egen og bransjens struktur i lagring og arkivering av dokumentasjon"
      }
    },
    {
      "id": "01TT00R",
      "title": "Energiteknikk",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00R/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om termodynamikkens grunnbegreper, samt oppbygningen og virkemåten til aktuelle energisystemer | har kunnskap om norsk energiforsyning, produksjonsmetoder og distribusjon av elektrisk kraft | har kunnskap om forskjellige elektriske maskiner | har kunnskap om batteriteknologier og hva som preger ny utvikling | kan vurdere eget arbeid i henhold til HMS, lover, forskrifter, normer og standarder | har kunnskap om energiteknikk | kjenner til energiteknikkens historie, tradisjoner, egenart og plass i samfunnet | har innsikt i egne utviklingsmuligheter innen energiteknikk",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for termodynamikkens oppbygning og virkemåten til aktuelle energisystemer | kan gjøre rede for bruken av analyseverktøy | kan gjøre rede for prinsippene i norsk energiforsyning produksjonsmetoder og distribusjon | kan gjøre rede for aktuelle batteriteknologier og hva som preger ny utvikling | kan reflektere over eget arbeid i henhold til gjeldende HMS-regler, lover, forskrifter, normer og standarder | kan reflektere over energiteknikkens miljøpåvirkning og plass i samfunnet | kan reflektere over egne utviklingsmuligheter innen energiteknikk | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling | kan gjøre rede for oppbygging og virkemåte av elektriske maskiner og aktuelle energisystemer | kan gjøre rede for kjølemediers påvirkning på miljøet",
        "competence": "Generell kompetanse | Studenten | kan planlegge, prosjektere og iverksette løsninger for energiteknikk alene, eller som deltaker av en gruppe | kan utføre arbeid etter oppdragsgivers behov i tråd med etiske krav og retningslinjer | kan bidra med faglige synspunkter på problemstillinger og delta i diskusjoner | kan bidra til organisasjonsutvikling | kan bidra til at det utarbeides bruker- og servicedokumentasjon"
      }
    },
    {
      "id": "01TT00T",
      "title": "Digital automatisering 1",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00T/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om relevante komponenter som brukes i moderne industrielle prosesser | har kunnskap om industrielle styresystemer | har kunnskap om design av brukergrensesnitt for operasjon av industrielle prosesser | har kunnskap om programmering av PLS og dokumentasjon av PLS programmer i en industriell sammenheng | har kunnskap om elektriske, pneumatiske og hydrauliske sensorer og aktuatorer som inngår i mekatronikksystemer | har kunnskap om sikkerhet og hvordan det gjennomføres i mekatronikksystemer | kan vurdere eget arbeid i forhold til gjeldende normer og krav, innen hydraulikk, pneumatikk, industrielle styringssystemer og PLS-programmering | kjenner til bransjens/yrkets historie, tradisjoner, egenart og plass i samfunnet, og forstår hvordan utviklingen innen robotteknologi og automasjon har bidratt til effektivisering og teknologisk fremgang i industrien | har innsikt i egne utviklingsmuligheter gjennom arbeid med PLS-programmering, hydrauliske og pneumatiske systemer samt grunnleggende robotprogrammering",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for relevante komponenter som brukes i moderne industrielle sammenhenger | kan gjøre rede for prosjektering av aktuelle styresystemer | kan gjøre rede for kalibrering og justering av instrumenter innen styringssystemer | kan gjøre rede for brukergrensesnitt for operasjon av industrielle prosesser | kan reflektere over egen og andres faglige utførelse innen moderne industrielle sammenhenger og implementere endringer basert på erfaring | kan finne og henvise til teknisk informasjon og fagstoff for produkter og systemer, samt vurdere relevansen mot en yrkesfaglig problemstilling | kan gjøre rede for programmering av PLS og dokumentasjon av PLS programmer i en industriell sammenheng | kan gjøre rede for valg av elektriske, pneumatiske og hydrauliske sensorer og aktuatorer som benyttes i mekatronikksystemer | kan gjøre rede for sikkerhet og hvordan det gjennomføres i mekatronikksystemer",
        "competence": "Generell kompetanse | Studenten | kan i samarbeid med andre yrkesgrupper planlegge, prosjektere, dokumentere, implementere og drifte produksjonstekniske systemer, alene eller som deltaker i gruppe, i tråd med de etiske krav, standarder og lover som gjelder innenfor moderne industrielle sammenhenger | kan utveksle synspunkter og henvise til teknisk og innovativ informasjon og fagstoff om moderne industrielle sammenhenger og produksjon for produkt og systemer | kan bidra til organisasjonsutvikling ved å anvende kunnskap om hydrauliske og pneumatiske systemer, robotteknologi og industriell automasjon med PLS, og ved å implementere løsninger og arbeidsmetoder som støtter digitalisering og teknologisk utvikling i virksomheten."
      }
    },
    {
      "id": "01TT06F EITKMEKH24",
      "title": "Digital automatisering 2",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT06F-EITKMEKH24/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om styresystemer og mekanisk oppbygning av roboter som brukes i mekatronikksystemer | har kunnskap til ulike robot-teknologier og hvordan de anvendes i industrien | har kunnskap om sensorer, aktuatorer, robotsyn, gripere, kringutstyr og andre komponenter som benyttes i forbindelse med robotceller | har kunnskap om planlegging og dokumentasjon av mekatronikksystemer med robotceller | har kunnskap om sikkerhet og hvordan det gjennomføres i mekatronikksystemer med robotceller | har kunnskap om programmering av ulike robotsystemer | kan vurdere eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder | har innsikt i egne utviklingsmuligheter innen fagområdet | har kunnskap om bransjer som arbeider innen fagområdet | har kunnskap om relevante komponenter som brukes i moderne industrielle produksjonssystemer. | har kunnskap om industrielle produksjonssystemer. | har kunnskap om design og brukergrensesnitt av industrielle produksjonssystemer | har kunnskap om programmering av PLS og dokumentasjon av PLS programmer i en industriell sammenheng | har kunnskap om sikkerhet og hvordan det gjennomføres i mekatronikksystemer",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for relevante komponenter som brukes i moderne industrielle sammenhenger | Kan gjøre rede for prosjektering av aktuelle styresystemer. | kan gjøre rede for kalibrering og justering av instrumenter innen styringssystemer | kan gjøre rede for brukergrensesnitt for operasjon av industrielle prosesser. | kan reflektere over egen og andres faglige utførelse innen moderne industrielle sammenhenger og implementere endringer basert på erfaring | kan finne og henvise til teknisk informasjon og fagstoff for produkter og systemer, samt vurdere relevansen mot en yrkesfaglig problemstilling | kan gjøre rede for sikkerhet og hvordan det gjennomføres i industrielle produksjonssystemer",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver i tråd med etiske krav og retningslinjer for kvalitet og miljø | kan planlegge, prosjektere og iverksette løsninger for mekatronikksystemer med robotceller alene, eller som deltaker av en gruppe | kan utveksle synspunkter med andre med bakgrunn innenfor bransjen og delta i diskusjoner om utvikling av god praksis | kan bidra til at det utarbeides bruker- og servicedokumentasjon | kan utveksle synspunkter og henvise til teknisk og innovativ informasjon og fagstoff om moderne industrielle sammenhenger og produksjon for produkt og systemer"
      }
    },
    {
      "id": "01TT06E EITKMEKH24",
      "title": "Analog og digitalteknikk med PCB-design",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT06E-EITKMEKH24/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om bruken og funksjonen til analog- og digitalelektronikk | har kunnskap om mikroelektronikk og kretskortdesign | har kunnskap om programmering og virkemåten til programmerbare komponenter | har kunnskap om kraftelektronikk | har kunnskap om EMC og om hvordan elektrisk utstyr påvirker hverandre | kjenner til EMI | har kunnskap om programvare til konstruksjon og analyse av elektriske skjemaer | kan vurdere eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder | har innsikt i egne utviklingsmuligheter innen fagområdet | har kunnskap om bransjer som arbeider innen fagområde",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for bruk og funksjon av analog- og digitalelektronikk | kan gjøre rede for mikroelektronikk og kretskortdesign | kan gjøre rede for virkemåten til kraftelektronikk | kan gjøre rede for hvordan elektrisk utstyr påvirker hverandre (EMC) | kan gjøre rede for virkemåte og programmering av programmerbare komponenter | kan reflektere over eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig bakgrunn",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer | kan utveksle synspunkter med andre med bakgrunn innenfor bransjen/ yrket og delta i diskusjoner om utvikling av god praksis | kan bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TT06D EITKMEKH24",
      "title": "Teknisk design og dokumentasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT06D-EITKMEKH24/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om DAK og standarder som benyttes i tegningsproduksjon | har kunnskap om hvordan simuleringer og analyser utføres med DAK | har kunnskap om bearbeidingsmetoder for å tilvirke 3D-modeller | har kunnskap om universell utforming | har kunnskap om innhold som inngår i sluttdokumentasjon til oppdragsgiver | har kunnskap om konfigurasjonsstyring, logistikk og sporbarhet | har kunnskap om de aktuelle direktivene og hva som inngår i en CE-merking | kan vurdere eget arbeid innen dokumentering av mekatronikksystemer i henhold til gjeldende lover, forskrifter, normer og standarder | har innsikt i egne utviklingsmuligheter innen fagområdet | har kunnskap om bransjer som arbeider innen fagområdet",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for konsept og design av produkter og systemer | kan gjøre rede for design-prinsipper i henhold til krav fra oppdragsgiver | kan gjøre rede for valg av tilvirkning av 3D-modeller | kan gjøre rede for universell utforming | kan gjøre rede for designprosessen ved utvikling og forbedring av produkter | kan gjøre rede for kravspesifikasjon med omfang, regelverk, miljøhensyn og andre rammebetingelser | kan gjøre rede for et mekatronikksystems tekniske dokumentasjon i henhold til bransjestandarder | kan finne og henvise til fagstoff om teknisk dokumentasjon og administrasjon | kan gjøre rede for aktuelle direktiv og CE-merking | kan reflektere over eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer | kan utveksle synspunkter med andre med bakgrunn innenfor bransjen/ yrket og delta i diskusjoner om utvikling av god praksis | kan bidra til organisasjonsutvikling | kan bidra til at det utarbeides bruker- og servicedokumentasjon"
      }
    },
    {
      "id": "01TX00H",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Kandidaten: | har kunnskap om hvordan man skriver en prosjektrapport | har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen | har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt | har kunnskap om sammenhengen mellom teori og praksis | kan vurdere eget prosjekt i forhold til gjeldende normer og krav | kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for valg av tema for hovedprosjekt | kan identifisere, kartlegge og vurdere en faglig problemstilling | kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat | kan skrive en prosjektrapport | kan drøfte sammenhengen mellom teori og praksis | kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk | kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer | har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende | kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov | kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    },
    {
      "id": "01TX00A EITKFRE",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A-EITKFRE/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om realfag som redskap innen sitt fagområde | har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes for å utføre nødvendige beregninger, dimensjoneringer, overslag og annen problemløsning med utgangspunkt i relevante praktiske situasjoner og problemstillinger innen fagretningen. | har kunnskap om matematiske og fysiske lover, formler og symboler som er relevante for fagretningen | kan vurdere eget arbeid i forhold til matematiske og fysiske lover | har bransjekunnskap og kjennskap til yrkesfeltet en har valgt og om hvilken betydning realfaglige redskap har for fagretningen | kan oppdatere sine kunnskaper innen realfag | kjenner til matematikkens og fysikkens historie, tradisjoner, egenart og plass i samfunnet | har innsikt i egne utviklingsmuligheter innen realfag",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for valg av regneoperasjoner som anvendes for fagspesifikke problemstillinger | kan gjøre rede for digitale verktøy som anvendes til problemløsninger innen realfaglige tema | kan reflektere over egen faglig utøvelse og vurdere resultater av beregninger og justere denne under veiledning | kan finne og henvise til informasjon og fagstoff i formelsamlinger og fagbøker og vurdere relevansen for en realfaglig problemstilling",
        "competence": "Generell kompetanse | Studenten: | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov | har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger | har innsikt i rekkevidde og begrensninger for de metoder som anvendes | kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B EITKFRE",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B-EITKFRE/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om grunnleggende kommunikasjonsteori | kjenner til hvilken betydning kulturell identitet har for samarbeid og | kommunikasjon på arbeidsplassen | har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde | har kunnskap om sentrale retoriske begreper og virkemidler | har kunnskap om kildebruk etter standard for høyere utdanning | kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, | tekstproduksjon, deling, presentasjon og møter | har kjennskap til prinsipper for tekstorganisering og -produksjon | har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne",
        "skills": "Ferdigheter | Studenten | kan reflektere over møter mellom forskjellige arbeidslivskulturer | kan bruke relevante begreper for å analysere egen og andres tekst | kan reflektere over og revidere tekster | kan reflektere over hvordan retorikk benyttes | kan bygge opp saklig argumentasjon og bruke retoriske apellformer | kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig | kan reflektere over egen kommunikasjon i profesjonell sammenheng | kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker | kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng | kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og god tekstbinding | kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse | Studenten | kan kommunisere hensiktsmessig for å bidra til en inkluderende | organisasjonskultur | kan tilpasse språk og argumentasjon etter mål og mottaker | kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting | behersker relevante kommunikasjonsverktøy | kan kommunisere gjennom relevante tekster og kanaler | kan samarbeide om tekstproduksjon"
      }
    },
    {
      "id": "01TX00C EITKFRE",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C-EITKFRE/2025-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak | har kunnskap om lønnskostnader | har kunnskaper om mål, tiltak og handlingsplaner • kjenner til emnets aktuelle lover og avtaler",
        "skills": "Ferdigheter | Studenten | kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser | kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler | kan vurdere bedriftens betalingsevne og kapitalbehov | kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik | kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering | kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler | kan foreta en helhetlig prisvurdering og utarbeide kalkyler | kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten | kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel | kan identifisere, analysere og utvikle medarbeidernes kompetanse • kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon | kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse | kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier | kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes | kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse | Studenten | kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter | kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar | har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid | kan kommunisere internt og eksternt og benytte digitale verktøy til dette. | kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner | kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TT00C EITKFRE",
      "title": "Materialkunnskap",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00C-EITKFRE/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om materialteknologi og kan knytte denne opp mot ulike prosesser i konstruksjoner | har kunnskap om hvilken reell og mulig virkning på miljøet industrien og arbeidsplassen har | har kunnskap om aktuelle standarder knyttet til fagområdet",
        "skills": "Ferdigheter | Studenten | har forståelse for bruk av standarder og teknisk dokumentasjon og tolkning av disse | kan vurdere egne valg i henhold til offisielle standarder og kunne utøve disse på arbeidsplassen | kan ved hjelp av ferdighetene bidra til miljøvennlige alternativer som er innenfor akseptable rammer for kost og kvalitet",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre arbeidsoppgaver hvor valg og bruk av materialer brukes i tråd med etiske krav og retningslinjer | ​"
      }
    },
    {
      "id": "01TT00B EITKFRE",
      "title": "Mekanikk",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00B-EITKFRE/2025-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om grunnleggende mekanikk | kan vurdere egne beregninger i mekanikk i forhold til gjeldende normer og krav | har innsikt i egne utviklingsmuligheter innen konstruksjon og dokumentasjon | kan gjøre rede for hvordan identifisere og beregne krefter og momenter i mekaniske konstruksjoner | kan gjøre rede for hvordan identifisere og beregne spenninger og deformasjoner som opptrer i konstruksjoner",
        "skills": "Ferdigheter | Studenten | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan beskrive krefter som påvirker konstruksjoner | kan analysere spenningstilstanden i konstruksjoner",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre arbeidsoppgaver innen mekanikk alene, og som deltaker i gruppe, i tråd med etiske krav og retningslinjer | kan vurdere belastninger på konstruksjoner og delta i diskusjoner og vurderinger av konstruksjoner"
      }
    },
    {
      "id": "01TT00L EITKMEFH24",
      "title": "Teknisk dokumentasjon",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00L-EITKMEFH24/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om dataassistert konstruksjon og aktuelle ISO- og europeiske standarder som benyttes i tegningsproduksjon | har kunnskap om symbol- og formatbruk i teknisk dokumentasjon | kan knytte teknisk dokumentasjon opp mot digitale verktøy for distribusjon | har generell forståelse i tegningslesing innenfor andre disipliner, eksempelvis elektro, P&ID og så videre",
        "skills": "Ferdigheter | Studenten | kan anvende ulike dataverktøy for utarbeidelse av teknisk dokumentasjon | kan gjøre rede for teknisk dokumentasjon for sin bransje i henhold til aktuelle standarder | kan utarbeide dokumentasjon og tegninger i henhold til funksjonskrav",
        "competence": "Generell kompetanse | Studenten | kan sette seg inn i relevante standarder for utarbeidelse av teknisk dokumentasjon og utøve heretter | kan utarbeide dokumentasjon som tilfredsstiller funksjonskrav etter gjeldende standarder | kan redegjøre for egen og bransjens struktur i lagring og arkivering av dokumentasjon | kan reflektere over egen og bransjens effektivitet i utarbeidelse av dokumentasjon | kan kvalitetssikre og evaluere dokumentasjon før den offentliggjøres"
      }
    },
    {
      "id": "01TT00H",
      "title": "Elektro og automatisering",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00H/2025-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om aktuelle elektriske og elektroniske komponenter, koblingsskjemaer og relevant elektroteknisk dokumentasjon etter gjeldende standard | har kunnskap om sikkerhetsaspektet i eller nær spenningssatte anlegg i henhold til normer og krav | har kunnskap om strømarter, effekter og lavspente styringssystemer | kjenner til prinsipper rundt programmering innen automasjonssystemer",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for sammenhengen mellom resistans, strøm, spenning og effekt | kan gjøre rede for komponenter og kretser | kan gjøre rede for programmer i automasjonssystemer | kan gjøre rede for koblingsskjemaer og feilsøking",
        "competence": "Generell kompetanse | Studenten | kan korrespondere med fagkompetanse innen elektro og automasjon | kan lese tegninger og dokumentasjon som relateres til elektro og automasjon | kan utføre arbeid etter oppdragsgivers beskrivelse | kan utveksle faglige synspunkter på problemstillinger og delta i diskusjoner"
      }
    },
    {
      "id": "01TT00A EITKFRE",
      "title": "HMS-, prosjekt- og kvalitetsledelse",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00A-EITKFRE/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om grunnleggende HMS-, prosjekt- og kvalitetsledelse | kan se sammenheng mellom fagenes historiske utvikling og kontinuerlig endring også i framtiden | har kunnskap om styringsverktøy for igangsetting, planlegging og gjennomføring av prosjekter | har kunnskap om kvalitetsbegreper | har kunnskap om utarbeidelse, bruk og vedlikehold av HMS-, IK-system og KS, i samsvar med lover, forskrifter og standarder | kan vurdere eget og andres HMS-, prosjekt-, og kvalitetsarbeid i forhold til gjeldende normer og krav | har innsikt i egne utviklingsmuligheter innen HMS-, prosjekt- og kvalitetsledelse",
        "skills": "Ferdigheter | Studenten | kan reflektere over et sikkert arbeidsmiljø og ut ifra dette, planlegge og iverksette systematiske tiltak for å forhindre skade på mennesker, materiell og miljø | kan gjøre rede for aktiviteter som sikrer kvalitet | kan gjøre rede for styringen av et prosjekt med hensyn til tid, kost og kvalitet | kan gjøre rede for sine faglige valg kvalitativt og kvantitativt | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for aktuelle problemstillinger knyttet til HMS-, prosjekt- og kvalitetsledelse | kan reflektere over egen faglig utøvelse og justere denne under veiledning",
        "competence": "Generell kompetanse | Studenten | kan planlegge og gjennomføre et prosjekt, samt utarbeide relevant dokumentasjon | kan utveksle synspunkter og delta i diskusjoner om hvordan HMS-, prosjekt- og kvalitetsledelse kan utøves | kan bidra til et godt og sikkert fysisk og psykisk arbeidsmiljø med fokus på aktivt vernearbeid | kan bidra til organisasjonsutvikling innen HMS-, prosjekt- og kvalitetsarbeid"
      }
    },
    {
      "id": "01TT00R EITKMEFH24",
      "title": "Energiteknikk",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT00R-EITKMEFH24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om grunnleggende termodynamikk og oppbygningen og virkemåten til aktuelle energisystemer | har kunnskap om å beregne arbeid, energi og effektbehov, og ulike former for varmeoverføring og varmeveksling | har kunnskap om norsk energiforsyning, produksjonsmetoder og distribusjon av elektrisk kraft | har kunnskap om forskjellige elektriske maskiner | har kunnskap om batteriteknologier og hva som preger ny utvikling | kan vurdere eget arbeid i henhold til HMS, lover, forskrifter, normer og standarder | har kunnskap om energiteknikk | kan oppdatere sin kunnskap om energiteknikk | kjenner til energiteknikkens historie, tradisjoner, egenart og plass i samfunnet | har innsikt i egne utviklingsmuligheter innen energiteknikk",
        "skills": "Ferdigheter | Studenten | kan gjennomføre energianalyse, dimensjonere termiske prosesser, velge arbeidsmedium og beregne energiutnyttelse | kan gjøre rede for bruken av analyseverktøy | kan gjøre rede for prinsippene i norsk energiforsyning, produksjonsmetoder og distribusjon | kan gjøre rede for aktuelle batteriteknologier og hva som preger ny utvikling | kan reflektere over eget arbeid i henhold til gjeldende HMS-regler, lover, forskrifter, normer og standarder | kan reflektere over energiteknikkens miljøpåvirkning og plass i samfunnet | kan reflektere over egne utviklingsmuligheter innen energiteknikk | kan kartlegge en situasjon og identifisere faglige problemstillinger | kan gjøre rede for oppbygging og virkemåte av elektriske maskiner og aktuelle energisystemer | kan gjøre rede for kjølemediers påvirkning på miljøet",
        "competence": "Generell kompetanse | Studenten | kan arbeide i tråd med etiske krav og retningslinjer for kvalitet og miljø | kan planlegge, prosjektere og iverksette løsninger for energiteknikk alene, eller som deltaker av en gruppe | kan utføre arbeid etter oppdragsgivers behov | kan bygge relasjoner med fagfeller på tvers av fagområder | kan bidra med faglige synspunkter på problemstillinger og delta i diskusjoner | kan bidra til organisasjonsutvikling | Kan bidra utarbeide bruker- og servicedokumentasjon"
      }
    },
    {
      "id": "01TT06B EITKMEFH24",
      "title": "Mekatronikkstyring og produksjonssystemer",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT06B-EITKMEFH24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om grunnleggende prinsipper for styring og regulering | har kunnskap om metoder og verktøy for analyse og prosjektering av automatiserte systemer | har kunnskap om prinsipper for konstruksjon, programmering og dokumentasjon av automatiserte systemer | har kunnskap om utvikling av enkle sekvensielle og kombinatoriske program | har kunnskap om sikkerhet i automatiserte systemer | har kunnskap om generell sensorteknologi | har kjennskap til PLS sin funksjon, hensikt og virkemåte | har kjennskap til HMI (Human Machine Interface) grensesnitt | har kjennskap til hydraulikkens og pneumatikkens grunnprinsipper, komponentbeskrivelser, skjemalesing og systemforståelse | har innsikt i egne utviklingsmuligheter innen fagområdet | har kunnskap om bransjer som arbeider innen fagområdet",
        "skills": "Ferdigheter | Studenten | kan vurdere styringsmetoder for tilvirkning av produkter | kan utvikle og anvende enkle sekvensielle og kombinatoriske program | kan gjøre rede for valg av elektriske, pneumatiske og hydrauliske sensorer og aktuatorer som benyttes i mekatronikksystemer | kan forstå skjemalesing, systemforståelse og dimensjonering av hydrauliske og pneumatiske anlegg | kan prosjektere hydrauliske/pneumatiske anlegg | kan gjøre rede for sikkerhet i mekatronikksystemer | kan reflektere over valg av styresystem basert på kravspesifikasjon | kan ta hensiktsmessige og begrunnede valg basert på fagstoff og relevant informasjon | kan reflektere over faglig utførelse og justere denne under veiledning | kan vurdere eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder",
        "competence": "Generell kompetanse | Studenten | har kjennskap til aktuelle ISO-standarder innen fagområdet | kan beregne og drifte enkle hydrauliske/pneumatiske anlegg | kan anvende kunnskapen til å optimalisere energiproduksjon og effektivere energiforbruk | kan planlegge, prosjektere og iverksette løsninger for mekatronikksystemer alene, eller som deltaker av en gruppe | kan utføre arbeid etter oppdragsgivers behov og kravspesifikasjon | kan bygge relasjoner og kommunisere på tvers av fagområder, og ta del i faglige team og nettverk | kan bidra med faglige synspunkter på problemstillinger og delta i diskusjoner | kan utarbeide bruker- og servicedokumentasjon"
      }
    },
    {
      "id": "01TT06A EITKMEFH24",
      "title": "Analog og digitalteknikk",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT06A-EITKMEFH24/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om bruken og funksjonen til analog- og digitalelektronikk | har kunnskap om tallsystemer, digitale koder, sannhetstabeller, Boolsk algebra og Karnaugh-diagram | har kunnskap om mikroelektronikk og kretskortdesign | har kunnskap om programmering og virkemåten til programmerbare komponenter | har kunnskap om kraftelektronikk | har kunnskap om EMC og om hvordan elektrisk utstyr påvirker hverandre | har kunnskap om hvordan aktive og passive filtre benyttes for å redusere EMC-problematikk | kjenner til EMI | kjenner til forskjellige bus-systemer og lagringsmedier | har kunnskap om programvare til konstruksjon, simulering og analyse av elektriske skjemaer | kan vurdere eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder | har innsikt i egne utviklingsmuligheter innen fagområdet | har kunnskap om bransjer som arbeider innen fagområdet",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for bruk og funksjon av analog- og digitalelektronikk | kan gjøre rede for tallsystemer, digitale koder, sannhetstabeller, Boolsk algebra og Karnaugh-diagram | kan gjøre rede for mikroelektronikk og kretskortdesign | kan gjøre rede for virkemåten til kraftelektronikk | kan gjøre rede for hvordan elektrisk utstyr påvirker hverandre (EMC) | kan gjøre rede for hvordan aktive og passive filtre benyttes for å redusere EMC problematikk | kan gjøre rede for virkemåte og programmering av programmerbare komponenter | kan gjøre rede for forskjellige bus-systemer og lagringsmedier | kan anvende programvare til konstruksjon, simulering og analyse av elektriske skjemaer | kan reflektere over eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder | kan kartlegge en situasjon og identifisere faglige problemstillinger",
        "competence": "Generell kompetanse | Studenten | kan arbeide i tråd med etiske krav og retningslinjer for kvalitet og miljø | kan planlegge, prosjektere og iverksette løsninger for mekatronikksystemer med analoge og digitale kretser alene, eller som deltaker av en gruppe | kan utføre arbeid etter oppdragsgivers behov og kravspesifikasjon | kan bygge relasjoner og kommunisere på tvers av fagområder og delta i faglige team og nettverk | kan bidra med faglige synspunkter på problemstillinger og delta i diskusjoner | kan bidra til at det utarbeides bruker- og servicedokumentasjon"
      }
    },
    {
      "id": "01TT06C EITKMEFH24",
      "title": "Robotteknologi og reguleringsteknikk",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT06C-EITKMEFH24/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om styresystemer og mekanisk oppbygning av roboter som brukes i mekatronikksystemer | har kjennskap til ulike robot-teknologier og hvordan de anvendes i industrien | har kunnskap om sensorer, aktuatorer, robotsyn, gripere, kringutstyr og andre komponenter som benyttes i forbindelse med robotceller | har kunnskap om planlegging og dokumentasjon av mekatronikksystemer med robotceller | har kunnskap om sikkerhet og hvordan det gjennomføres i mekatronikksystemer med robotceller | har kunnskap om prinsipper for regulering og reguleringssløyfer | har kunnskap om de mest brukte reguleringsmetodene | har kunnskap om videreutvikling og design av reguleringssystemer | kan vurdere eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder | har innsikt i egne utviklingsmuligheter innen fagområdet | har kunnskap om bransjer som arbeider innen fagområdet",
        "skills": "Ferdigheter | Studenten | kan gjøre rede for styresystemer og mekanisk oppbygning av roboter som brukes i mekatronikksystemer | kan gjøre rede for ulike robotteknologier og hvordan de anvendes i industrien | kan gjøre rede for sensorer, aktuatorer, robotsyn, gripere, kringutstyr og andre komponenter som benyttes i forbindelse med robotceller | kan reflektere over faglig utførelse av planlegging og dokumentasjon av mekatronikksystemer med robotceller | kan gjøre rede for prinsippene ved regulering og reguleringssløyfer | kan gjøre rede for reguleringsmetoder og deres virkemåte på reguleringen | kan gjøre rede for sikkerhet og hvordan det kan gjennomføres i mekatronikksystemer med robotceller | kan gjøre rede for eget arbeid i henhold til gjeldende lover, forskrifter, normer og standarder | kan ta hensiktsmessige og begrunnede valg basert på fagstoff og relevant informasjon | kan reflektere over egen faglig utøvelse og justere denne under veiledning",
        "competence": "Generell kompetanse | Studenten | kan arbeide i tråd med etiske krav og retningslinjer for kvalitet og miljø | kan planlegge, prosjektere og iverksette løsninger for mekatronikksystemer med robotceller alene, eller som deltaker av en gruppe | kan utføre arbeid etter oppdragsgivers behov og kravspesifikasjon | kan bygge relasjoner og kommunisere på tvers av fagområder og delta i faglige team og nettverk | kan bidra med faglige synspunkter på problemstillinger og delta i diskusjoner | kan bidra til at det utarbeides bruker- og servicedokumentasjon"
      }
    },
    {
      "id": "01TT06D EITKMEFH24",
      "title": "Teknisk design og dokumentasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TT06D-EITKMEFH24/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om moderne 3D-konstruksjonsverktøy og prinsipper ved oppbyggingen av parter og sammenstillinger | har kunnskap om produksjon om 2D-tegninger i henhold til gjeldende regler og krav | har kunnskap om endring og modifisering av deler, sammenstillinger og tegninger | har kunnskap om statiske og dynamiske -analyser ved hjelp av datasystemer",
        "skills": "Ferdigheter | Studenten | kan benytte hensiktsmessige prinsipper ved oppbyggingen av parter og sammenstillinger | kan produsere 2D-tegninger i henhold til gjeldende regler og krav. | kan endre og modifisere parter, sammenstillinger og tegninger | kan anvende et dataverktøy til å utføre statiske og dynamiske analyser",
        "competence": "Generell kompetanse | Studenten | behersker DAK med vekt på geometrisk modellering, produktbeskrivelse og teknisk tegning | kan arbeide i tråd med etiske krav og retningslinjer for kvalitet og miljø | kan planlegge og gjennomføre arbeidsoppgaver innen teknisk dokumentasjon og administrasjon alene, eller som deltaker i en gruppe"
      }
    },
    {
      "id": "01TX00H EITKFRE",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H-EITKFRE/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om hvordan man skriver en prosjektrapport | har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen | har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt | har kunnskap om sammenhengen mellom teori og praksis | kan vurdere eget prosjekt i forhold til gjeldende normer og krav | kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter | Kandidaten: | kan gjøre rede for valg av tema for hovedprosjekt | kan identifisere, kartlegge og vurdere en faglig problemstilling | kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat | kan skrive en prosjektrapport | kan drøfte sammenhengen mellom teori og praksis | kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk | kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt | kan benytte IKT-verktøy for prosjektstyring, og innenfor temaer og problemstillinger der programvarebruk er relevant/påkrevd",
        "competence": "Generell kompetanse | Kandidaten: | kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer | har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende | kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov | kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    }
  ]
}