{
  "study_programs": [
    {
      "id": "Mountain Bike Trail Planning, Construction and Maintenance - 30",
      "title": "Mountain Bike Trail Planning, Construction and Maintenance",
      "description": "The Mountain Bike Trail Planning, Construction and Maintenance course is designed for professionals and enthusiasts who want to develop solid, practical skills in sustainable trail design and management. You learn to plan, build and maintain trails that balance user experience, safety, and environmental care — following international standards and modern sustainability principles.",
      "study_category": "Bygg og anlegg",
      "study_location": {
        "0": "Kongsberg"
      },
      "study_type": {
        "7": "Samlingsbasert 1 år"
      },
      "credits": 30,
      "language": "Engelsk",
      "level": "Vitnemålsgivende studie",
      "why_choose": "Mountain biking is growing rapidly worldwide, creating demand for professionals who can design and manage trails that are both exciting and sustainable. | This education gives you the insight and practical tools to work with nature, not against it. You learn how terrain, soil, drainage, and user flow shape good trail design — and how careful maintenance keeps trails safe, fun, and long-lasting.\nThe program combines field-based learning with technical understanding, so you gain confidence in taking responsibility for the entire process — from initial planning and stakeholder dialogue to final construction and maintenance routines. Whether you work in tourism, outdoor recreation, or land management, this course helps you build competence that contributes to better trail experiences and more sustainable outdoor environments.",
      "what_learn": "You learn the complete process of trail development:\nThe program includes both technical and practical field training. You’ll work with real projects, collaborate across disciplines, and gain hands-on experience with tools, machinery, and design principles.\nThe study consists of several modules, including trail design theory, environmental assessment, construction methods, maintenance planning and project evaluation.",
      "teaching_format": null,
      "mandatory_attendance": "Teaching and sessions This is a blended learning program , combining online instruction with on-site field sessions. You take part in lectures, digital supervision and group discussions between physical gatherings. Field sessions are arranged several times each semester and typically last two to three days , focusing on practical trail construction, terrain analysis and maintenance techniques. The final plan for teaching and field sessions will be published on the student page before the start of the semester. Attendance requirements Active participation is essential during the field sessions, which include mandatory activities and assessments. Details about attendance and practical requirements are specified in the course syllabus.",
      "police_certificate": null,
      "career_opportunities": "This program qualifies you to work in the growing field of outdoor recreation and sustainable tourism. You can work with trail planning, project management, construction supervision, or maintenance in public or private organizations — such as municipalities, tourism companies, or land management authorities. Many graduates use the competence to start or develop businesses in trail building, mountain biking facilities, and outdoor infrastructure. You gain the expertise to collaborate with engineers, environmental planners and local communities — ensuring that every project supports both recreation and sustainability. With this qualification, you become part of an international movement shaping the future of mountain biking and nature-based tourism.",
      "contact_info": "Har du noen spørsmål? | Do you think this study program sounds exciting, but are unsure how to get involved? We are happy to help you find the solution that suits you best. | Contact us by email: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/bygg-og-anlegg/mountain-bike-trail-planning-construction-and-maintenance"
    }
  ],
  "courses": []
}