{
  "study_programs": [
    {
      "id": "Nevrologi - 30",
      "title": "Nevrologi",
      "description": "Nevrologi er videreutdanningen for deg som jobber med pasienter med sykdom eller skade i nervesystemet og ønsker økt faglig trygghet i komplekse pasientsituasjoner. Du bygger kompetanse i observasjon, klinisk vurdering og ansvarlig oppfølging av pasienter med både akutte og langvarige nevrologiske tilstander.",
      "study_category": "Helse",
      "study_location": {
        "1": "Fredrikstad"
      },
      "study_type": {
        "7": "Samlingsbasert 1 år"
      },
      "credits": 30,
      "language": "Norsk",
      "level": "Vitnemålsgivende studie",
      "why_choose": "Pasienter med nevrologiske sykdommer har ofte sammensatte og varierende behov, og små endringer i funksjon eller symptombilde kan få store konsekvenser. Behovet for helsefagarbeidere med solid forståelse for nevrologiske tilstander, pasientforløp og tverrfaglig samarbeid er derfor økende.\nVidereutdanningen i nevrologi gir deg et tydeligere faglig ståsted i møte med denne pasientgruppen. Kompetansen er etterspurt i både kommune- og spesialisthelsetjenesten, og bidrar til økt kvalitet, pasientsikkerhet og helhetlig omsorg for pasienter i en sårbar livssituasjon.\nFor dette studiet er det krav om | politiattest | .",
      "what_learn": "Du bygger spesialisert kompetanse i nevrologi, slik at du kan observere, vurdere og følge opp pasienter med sykdom eller skade i nervesystemet på en trygg og faglig forsvarlig måte.\nStudiet gir deg innsikt i nevrologiske sykdommer og tilstander, pasientforløp og behandlings­tilnærminger, samt hvordan sykdom og behandling påvirker funksjon, mestring og livskvalitet. Du arbeider også med faglige verktøy for observasjon, dokumentasjon og strukturert kommunikasjon, og utvikler forståelse for etiske problemstillinger og samarbeid med pasient og pårørende.\nLæringen er praksisnær og tar utgangspunkt i situasjoner du møter i arbeidshverdagen. Studiet er på 30 studiepoeng og består av 3 emner. Du søker opptak til hele videreutdanningen.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres som nettbasert deltidsutdanning med fysiske samlinger ved studiested Fredrikstad. Undervisningen kombinerer digitale læringsaktiviteter og samlinger på campus, med vekt på faglig forståelse, praktisk anvendelse og erfaringsdeling. Samlingene holdes vanligvis flere ganger per semester og varer to til tre dager. Endelig plan for samlinger og undervisning publiseres på studentsiden for Fredrikstad før oppstart. Obligatorisk oppmøte Det er krav til oppmøte på fysiske samlinger. For å få sluttvurdering i emnene må du ha minimum 75 % oppmøte . Nærmere informasjon om oppmøtekrav og konsekvenser ved fravær finner du i studieplanen. Politiattest Dette studiet krever gyldig politiattest før studiestart. Søk om politiattest når du har akseptert studieplassen. Les vår veiledning til hvordan du søker politiattest før du går videre til politiets nettsider for å sende søknaden.",
      "police_certificate": "Sjekk opptakskrav",
      "career_opportunities": "Videreutdanningen i nevrologi styrker rollen din i oppfølging og behandling av pasienter med nevrologisk sykdom eller skade, særlig i situasjoner der gode observasjoner, faglige vurderinger og riktige tiltak er avgjørende. Kompetansen brukes i samarbeid med annet helsepersonell, der du bidrar med strukturert dokumentasjon, tydelig kommunikasjon og helhetlig forståelse av pasientens behov. Dette gir et tryggere grunnlag for beslutninger i komplekse pasientsituasjoner og bidrar til kvalitet og kontinuitet i tjenestene. Nevrologisk kompetanse er særlig relevant i spesialisthelsetjenesten, men også i helsehus, rehabilitering, hjemmebaserte tjenester og sykehjem, og gir et solid faglig grunnlag for videre utvikling og økt ansvar i yrkesrollen.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/helse/nevrologi"
    }
  ],
  "courses": []
}