{
  "study_programs": [
    {
      "id": "Norsk tradisjonsdrikke som reiselivsprodukt - 30",
      "title": "Norsk tradisjonsdrikke som reiselivsprodukt",
      "description": "Norsk tradisjonsdrikke som reiselivsprodukt er videreutdanningen for deg som vil gjøre lokal kultur, øl, mjød og sider om til minneverdige opplevelser for gjester. Du lærer å kombinere råvarekunnskap, produksjon og historiefortelling med opplevelsesdesign og markedsføring – slik at du kan utvikle autentiske, salgbare reiselivsprodukter.",
      "study_location": "Jessheim (Samlingsbasert 1 år)",
      "credits": 30,
      "language": "Norsk",
      "level": "Vitnemålsgivende studie",
      "why_choose": "Reiselivet etterspør ekte, lokale smaker og historier. Denne utdanningen gir deg verktøyene til å løfte norsk drikketradisjon inn i profesjonelle gjesteopplevelser – fra gårdsbesøk og smakinger til komplette produkter for destinasjoner og arrangementer.\nStudiet er praksisnært og bygger på bransjens delingskultur. Du lærer gjennom erfaringsutveksling og samarbeid med fagmiljøer, og får innsikt i hvordan natur, kultur og tradisjoner preger både drikkeproduksjon og gjesteopplevelse.\nMed fokus på bærekraft og lokal verdiskaping får du kompetanse til å utvikle konkurransedyktige produkter som gjenspeiler norsk kulturarv og treffer dagens reiselivsmarked.",
      "what_learn": "Du får kunnskap om råvarer, produksjonsprosesser og kvalitetssikring av øl, mjød og sider, og lærer hvordan du kan bruke denne kunnskapen til å skape unike opplevelser. Gjennom arbeidet med opplevelsesdesign lærer du å formidle historier, bygge merkevarer og utvikle reiselivsprodukter som gir gjestene en autentisk opplevelse av norsk tradisjon.\nUndervisningen kombinerer teori og praktiske oppgaver, inkludert utvalgte ekskursjoner og faglige samlinger med aktører i bransjen. Du lærer å planlegge og gjennomføre prosjekter som kan tas direkte i bruk i egen virksomhet.\nKlikk på et emne for å lese mer hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres som nettbasert deltidsstudium med samlinger ved studiested Jessheim. Samlingene varer vanligvis to til tre dager og kombinerer forelesninger, gruppearbeid og praktiske øvelser. Undervisningen foregår delvis digitalt mellom samlingene, som regel én fast ukedag. Det legges også opp til ekskursjoner til lokale produsenter og fagmiljøer i og rundt Akershus. Oppdatert plan for samlingsuker og undervisningstider publiseres på studentsiden for Jessheim før oppstart. Obligatorisk oppmøte Du må delta på minst 75 % av de fysiske samlingene for å få vurdert eksamen. Manglende oppmøte kan føre til at du ikke får fullført emnet.",
      "police_certificate": null,
      "career_opportunities": "Denne fagskoleutdanningen gir deg bred kompetanse til å utvikle, lede og formidle opplevelser med norsk tradisjonsdrikke som del av reiselivet. Du kan arbeide i reiselivsbedrifter, serveringssteder, gårdsturisme, festivaler og småskala mat- og drikkeproduksjon – eller bruke kompetansen til å bygge egen virksomhet. Du lærer å planlegge og gjennomføre aktiviteter som smakinger, omvisninger og formidling av lokal kultur og tradisjon – og blir en ressurs i utviklingen av bærekraftige, autentiske reiselivsopplevelser.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/reiseliv/norsk-tradisjonsdrikke-som-reiselivsprodukt"
    }
  ],
  "courses": [
    {
      "id": "01TK85A EIRLTRK",
      "title": "Produksjon og kvalitet",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK85A-EIRLTRK/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om produksjonsmetoder og produksjonsutstyr for produksjon av øl, mjød og sider har kunnskap om råvarer og råvareproduksjon, herunder kvalitetskriterier for disse har kunnskap om tekniske begreper knyttet til vurdering av kvalitet og produksjon av drikkevarer har innsikt i relevante lover og regler for produksjon av norsk drikke, samt hvordan de påvirker produksjonen har kunnskap om bærekraft i produksjon",
        "skills": "Ferdigheter Kandidaten: kan anvende faglig kunnskap om ulike råvarer, og hvordan de best mulig kan benyttes i produksjon kan finne informasjon om gjeldende lover, regler og standarder kan kartlegge hvilke faktorer som påvirker produktets kvalitet, og behov for eventuelle tiltak kan finne frem til aktuell lovgiving, og forstå dens relevans i produksjonen av norsk tradisjonsdrikke",
        "competence": "Generell kompetanse Kandidaten: har forståelse for produktutvikling av norsk tradisjonsdrikke, i tråd med de etiske krav, lover og standarder som gjelder. kan anvende fagkunnskap for å vurdere råvarenes kvalitet og hvordan de best kan brukes i produksjonen kan anvende relevante faglige verktøy for å vurdere produkter både teknisk og sensorisk, og foreslå nødvendige tiltak på bakgrunn av vurderingene"
      }
    },
    {
      "id": "01TK85B EIRLTRK",
      "title": "Markedsføring og produktutvikling",
      "credits": 7,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK85B-EIRLTRK/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om produktenes historiske og kulturelle kontekst, og kan bruke dette aktivt i markedsføring har innsikt i relevant regelverk og standarder og krav i henhold til omsetning og reklame for alkoholholdige drikker. har kunnskap om norsk drikke og dens betydning for det helhetlige reiselivsproduktet",
        "skills": "Ferdigheter Kandidaten: kan finne relevant informasjon og fagstoff om produktutvikling og markedsføring kan kartlegge ulike forhold og identifisere problemstillinger som påvirker markedsføringen av et produkt kan anvende ulike presentasjonsteknikker i markedsføringen av et produkt",
        "competence": "Generell kompetanse Kandidaten: kan utvikle produkter som fremmer norsk drikke som et reiselivsprodukt. Ha forståelse for de muligheter og begrensinger markedsføring av alkoholholdige produkter har i henhold til dagens lovgivning kan utvikle markedsstrategi for å nå nye markeder"
      }
    },
    {
      "id": "01TK85C EIRLTRK",
      "title": "Opplevelsesdesign og formidling",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK85C-EIRLTRK/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskap om hvordan historiefortelling kan danne grunnlag for opplevelsesutvikling har kunnskap om hvordan kulinariske tradisjoner, produkter og råvarer kan danne grunnlag for opplevelsesutvikling",
        "skills": "Ferdigheter Kandidaten: kan anvende historiefortelling i produksjonen av kulinariske opplevelser kan anvende opplevelsesdesign i utviklingen av norsk drikke som reiselivsprodukt kan finne relevant informasjon og fagstoff som danner grunnlaget for kulinariske opplevelser og reiselivsprodukter",
        "competence": "Generell kompetanse Kandidaten: kan utvikle kulinariske reiselivsprodukter kan planlegge og gjennomføre av kulinariske opplevelser, med fokus på drikkevarer kan bygge relasjoner og samhandle med leverandører av produkter og råvarer"
      }
    },
    {
      "id": "01TK85D EIRLTRK",
      "title": "Fordypningsoppgave",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK85D-EIRLTRK/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Kandidaten: har kunnskaper innenfor et selvvalgt fordypningstema innen studieretningen har kunnskap om hvordan man innhenter informasjon om temaet for fordypningsoppgaven har kunnskap om sammenhengen mellom teori og praksis innenfor det selvvalgte fordypningstemaet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av tema i fordypningsoppgaven kan formulere og vurdere en faglig problemstilling kan gjennomføre og dokumentere arbeidet med en selvvalgt fordypningsoppgave, samt presentere resultatet kan skrive en fordypningsoppgave som svarer på en problemstilling og anvender relevant faglig forankring kan drøfte sammenhengen mellom teori og praksis kan reflektere over egen oppgave og justere dette under veiledning av fagfolk kan finne og henvise til informasjon og fagstoff som er relevant for fordypningsoppgavens problemstilling",
        "competence": "Generell kompetanse Kandidaten: har forståelse for hvordan man skriver en faglig fordypningsoppgave og svarer på en problemstilling kan diskutere problemstilling og innhold i en faglig fordypningsoppgave med andre har utviklet en etisk grunnholdning i planleggingen og gjennomføringen av en fordypningsoppgave"
      }
    }
  ]
}