{
  "study_programs": [
    {
      "id": "Optometri for medhjelpere - 30",
      "title": "Optometri for medhjelpere",
      "description": "Optometri for medhjelpere er videreutdanningen for deg som jobber i en optisk bedrift og vil stå tryggere i møte med kunder og pasienter. Du får praktisk kompetanse i optikk, pre-tester og kundedialog – så du kan gi presise råd, sikre god kvalitet og støtte optikeren i syns- og øyehelseundersøkelser.",
      "study_location": "Kongsberg (Samlingsbasert 1 år)",
      "credits": 30,
      "language": "Norsk",
      "level": "Vitnemålsgivende studie",
      "why_choose": "Hverdagen i butikken krever mer enn godt salg. Du skal forstå glass og innfatninger, utføre tekniske målinger og veilede mennesker med ulike behov. Dette studiet gir deg en solid faglig plattform og rutine i pre-tester som autorefraksjon, keratometri, tonometri, synsfelt og digital avbildning. Du blir tryggere i produktvalg, tilpasning og reparasjoner – og lærer å bruke kommunikasjon som skaper tillit og gode kundeopplevelser. Kompetansen passer for deg som vil ta mer ansvar i butikken, bidra til effektiv drift og være en tydelig fagressurs i teamet.\nFor dette studiet er det krav om | politiattest | .",
      "what_learn": "Du bygger forståelse for geometrisk, oftalmisk og visuell optikk, og hvordan dette brukes i praksis i butikken. Du trener på målinger og kvalitetssikring før, under og etter synsprøven, og lærer å tilpasse, verifisere og reparere briller på en trygg og effektiv måte. Studiet vektlegger personorientert kommunikasjon, rådgivning og stilforståelse, samt bransjekunnskap om drift, digitalisering, bærekraft, lover og etikk. Praksis er integrert i alle emner slik at du kan koble læring direkte til egen arbeidsplass.\nStudiet består av tre emner med praksis i hvert emne. Du søker opptak til hele utdanningen og får 30 studiepoeng når du har fullført.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger | Studiet er nett- og samlingsbasert, noe som gjør det mulig å kombinere med jobb. Samlingene holdes vanligvis flere ganger per semester på | studiested Kongsberg | og varer to til tre dager. Mellom samlingene følger du nettundervisning etter fast plan. | Endelig plan med detaljerte undervisningstider og samlingsuker publiseres på | studentsiden for Kongsberg | før oppstart. | Obligatorisk oppmøte | Du må delta på minst | 75 % av de fysiske samlingene | for å få vurdert eksamen. Praksis har egne regler for oppmøte – se studieplanen for detaljer. Manglende oppmøte kan føre til at du ikke får fullført emnet. | Politiattest | Dette studiet krever gyldig | politiattest | før studiestart. Søk om politiattest når du har akseptert studieplassen. Les vår | veiledning til hvordan du søker politiattest | før du går videre til | politiets nettsider | for å sende søknaden. | Forkurs i optometri | Før studiestart anbefales du å ta | forkurset i optometri | . Kurset er digitalt og gir en trygg og faglig start på studiet. Du får innføring i studieteknikk og bruk av Teams, samt en oppfriskning i matematikk, fysikk og kommunikasjon. | Forkurset er frivillig, men en stor fordel for deg som vil stille godt forberedt til studiestart. Deltakeravgiften er | 1 000 kroner | , og informasjon om innbetaling sendes på e-post etter påmelding. Oppdatert informasjon om datoer og påmelding finner du her nærmere oppstart.",
      "police_certificate": "Sjekk opptakskrav",
      "career_opportunities": "Kompetansen brukes i optiske butikker og i optikerindustrien. Den er også relevant i øyelegepraksis og på sykehusenes øyeavdelinger. I rollen som medhjelper kan du ta mer ansvar for pre-tester, kundereisen og kvalitet i leveranser: fra målinger og produktvalg til montering, justering og reparasjoner. Du styrker butikkens faglige nivå, bidrar til effektiv drift og får et tydeligere faglig fotfeste for videre utvikling i bransjen.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/helse/optometri-medhjelpere"
    }
  ],
  "courses": [
    {
      "id": "25HH47A EIHOOMK",
      "title": "Optikk og optoteknikk",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25HH47A-EIHOOMK/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | har kunnskap om geometrisk og oftalmisk optikk | har kunnskap om begreper, prosesser og verktøy som anvendes innenfor optoteknikk | har kunnskap om relevant regelverk, standarder, og krav til kvalitet for tilvirkning, verifisering, justering, utlevering og reparasjon av briller",
        "skills": "Ferdigheter | Studenten | kan anvende faglig kunnskap for å tilvirke individuelt tilpassede briller | kan anvende prosesser og verktøy for å tilvirke, verifisere, justere, utlevere og reparere briller",
        "competence": "Generell kompetanse | Studenten | kan formidle kunnskap om optiske egenskaper for glass, innfatninger og håndtering av briller | kan tilvirke, verifisere, justere, utlevere og reparere briller"
      }
    },
    {
      "id": "25HH47B EIHOOMK",
      "title": "Optikk, syn og optometri",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25HH47B-EIHOOMK/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | har kunnskap om visuell optikk og hvordan synsapparatet virker | har kunnskap om kontaktlinser og kontaktlinsehåndtering | har kunnskap om person-orientert kommunikasjon | har kunnskap om sammenhengen mellom symptomer på brytningsfeil og synskorreksjon | har kunnskap om øyets anatomi og de mest vanlige øyesykdommene | har kunnskap om automatisk objektiv refraksjon, keratometri, måling av intraokulært trykk og synsfelt, og metoder for digital avbilding av øyet",
        "skills": "Ferdigheter | Studenten | kan anvende faglig kunnskap og person-orientert kommunikasjon i møte med kunder/pasienter | kan anvende autorefraktor, autokeratometer, tonometer og synsfeltscreener, og instrumenter for digital avbilding av øyet",
        "competence": "Generell kompetanse | Studenten | kan formidle kunnskap om hvordan synsapparatet virker | kan gi nødvendig informasjon og instruksjon ved gjennomføring av undersøkelser og kontaktlinseopplæring | kan gjennomføre automatisk objektiv refraksjon, keratometri, synsfeltundersøkelse og tonometri, og digital avbildning av øyet | kan gjennomføre kontaktlinseopplæring"
      }
    },
    {
      "id": "25HH47C EIHOOMK",
      "title": "Bransjekunnskap om optikk og optometri",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/25HH47C-EIHOOMK/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | har kjennskap til optometri som profesjon | forstår optikerbransjens historie og egenart, og betydning i et samfunns- og verdiskapingsperspektiv | har kunnskap om hvordan digitalisering og bærekraftperspektiver påvirker driftsmodeller for optiske forretninger | har kunnskap om kommunikasjon med kunder og kollegaer | har kunnskap om produkter, estetisk tilpasning og personlig stil | har innsikt i relevante lover, regelverk, og kvalitetsstandarder",
        "skills": "Ferdigheter | Studenten | kan oppdatere sin yrkesfaglige kunnskap | kan anvende grunnleggende prinsipper for kommunikasjon | kan tilby riktig produkt tilpasset kundens behov og personlige stil | kan finne informasjon og fagstoff som er relevant for drift, digitalisering og bærekraft i optikerforretning",
        "competence": "Generell kompetanse | Studenten | har forståelse for yrkes- og bransjeetiske prinsipper innen optikerbransjen | har utviklet en etisk grunnholdning i arbeidet som optotekniker | kan bygge relasjoner med kunder/pasienter og kollegaer i bransjen | kan kartlegge og identifisere faglige problemstillinger og behov for iverksetting av tiltak i optisk forretning | kan utvikle arbeidsmetoder, produkter og/eller tjenester av relevans i optisk forretning"
      }
    }
  ]
}