{
  "study_programs": [
    {
      "id": "Praktisk ombruk og sirkulærøkonomi - 5",
      "title": "Praktisk ombruk og sirkulærøkonomi",
      "description": "Ønsker du å styrke din kompetanse innen bærekraftig ombruk og sirkulær økonomi? Emnet Praktisk ombruk og sirkulærøkonomi gir deg innsikt og praktiske ferdigheter til å fremme grønn omstilling i bygg- og anleggsbransjen. Gjennom fleksibel, nettbasert undervisning med samlinger blir du i stand til å skape verdi gjennom mer bærekraftige løsninger.",
      "study_location": "Kongsberg (Samlingsbasert ca. 10 uker)",
      "credits": 5,
      "language": "Norsk",
      "level": "Enkeltemne",
      "why_choose": "Dette emnet gir deg nøkkelkompetanse i å forstå og anvende prinsippene for sirkulær økonomi i praksis. Du lærer å skille mellom lineær og sirkulær økonomi, bruke avfallspyramiden som verktøy, og vurdere materialbruk ut fra et bærekraftperspektiv. Kunnskapen du tilegner deg gjør deg i stand til å analysere og identifisere hvilke tiltak som kan redusere kostnader og styrke bedriftens miljøprofil.\nDette enkeltemnet er en del av utdanningsprogrammet | Bærekraft i byggenæringen | . | Utdanningen består av tre korte og fleksible emner som hver gir 5 studiepoeng, og du kan velge å ta ett, to eller alle tre. Emnene kombinerer faglig innsikt, praktiske verktøy og casearbeid utviklet i samarbeid med næringslivet. I søknadsskjemaet velger du hvilke emner du vil ta. Du kan velge mellom enkeltemnene:\nDette utdanningsprogrammet er en del av | Industrifagskolen.",
      "what_learn": "Ved å ta dette emnet blir du en drivkraft i overgangen mot grønne verdikjeder. Du får forståelse for etiske og strategiske aspekter ved materialbruk, og blir rustet til å støtte virksomheters bærekraftstrategier både faglig og praktisk. Gjennom studiet veksler du mellom nettbasert læring, veiledning og arbeid med oppgaver, og får tett oppfølging fra faglærere. Samlingen brukes til fordypning, praktiske øvelser og erfaringsutveksling.\nStudiet er strukturert som et kort modulfag på 5 studiepoeng over ca. 10 uker med nettbasert undervisning og fysiske samlinger på Kongsberg, noe som gir deg fleksibilitet til å kombinere utdanning med jobb. Studiet kombinerer nettundervisning med fysisk samling ved studiested Kongsberg. Undervisningen foregår vanligvis én kveld i uken på nett (2–3 timer), kombinert med én fysisk samling ved studiestedet.",
      "teaching_format": null,
      "mandatory_attendance": null,
      "police_certificate": null,
      "career_opportunities": "Med kompetanse innen ombruk og sirkulærøkonomi blir du en verdifull ressurs i en bransje som står midt i en grønn omstilling. Du kan jobbe med rådgivning, prosjektledelse eller implementering av bærekraftige løsninger i bygg- og anleggssektoren. Bedrifter etterspør fagpersoner som kan redusere avfall, optimalisere materialbruk og bidra til mer miljøvennlige prosesser. Mulighetene finnes både i entreprenør- og konsulentvirksomheter, hos eiendomsforvaltere og i offentlige prosjekter. Denne kompetansen gir deg også et fortrinn i virksomheter som ønsker å styrke sin miljøprofil og følge kravene til sirkulær økonomi.",
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Studiekoordinator: | Helene Eikefjord – e-post: | heleneeik@afk.no | Du kan også | melde din interesse i dette skjemaet | , så vil vi ta kontakt med deg.",
      "study_url": "https://fagskolen-viken.no/studier/bygg-og-anlegg/baerekraft-i-byggenaeringen/praktisk-ombruk-og-sirkulaerokonomi"
    }
  ],
  "courses": []
}