{
  "study_programs": [
    {
      "id": "Praktisk veiledning - 30",
      "title": "Praktisk veiledning",
      "description": "Praktisk veiledning er videreutdanningen for deg som ønsker trygghet og faglig forankring i rollen som veileder i helsetjenesten. Studiet gir kompetanse i veiledning, kommunikasjon og etisk refleksjon, og styrker din evne til å støtte læring, utvikling og kvalitet i praksis.",
      "study_location": "Kongsberg (Samlingsbasert 1 år) | Fredrikstad (Samlingsbasert 1 år) | Kjeller (Samlingsbasert 1 år)",
      "credits": 30,
      "language": "Norsk",
      "level": "Vitnemålsgivende studie",
      "why_choose": "Helsetjenesten har et økende behov for fagarbeidere og helsepersonell som kan bidra til kompetanseutvikling, kvalitet og trygg oppgavedeling i tjenestene. God veiledning er avgjørende for å sikre kunnskapsoverføring, støtte kolleger og nyansatte, og bidra til bærekraftige tjenester.\nMed Praktisk veiledning utvikler du en faglig trygg og bevisst veilederrolle. Studiet gir deg innsikt i hvordan veiledning kan brukes som verktøy for læring, refleksjon og utvikling – både individuelt og i grupper. Du styrker også din forståelse av etiske utfordringer, kommunikasjon og samhandling i komplekse arbeidshverdager.",
      "what_learn": "I dette studiet bygger du kompetanse i veiledning som er direkte relevant for arbeid i helsetjenesten. Du får kunnskap om veiledningsprosesser, metoder og modeller, og lærer å anvende disse i praksis på en strukturert og profesjonell måte.\nStudiet legger vekt på sammenhengen mellom teori og praksis. Du arbeider med kommunikasjon, relasjonskompetanse, etisk refleksjon og samarbeid, og utvikler ferdigheter i å planlegge, gjennomføre og evaluere veiledning av både enkeltpersoner og grupper.\nUtdanningen består av tre emner og gir totalt 30 studiepoeng. Du søker opptak til hele studiet samlet.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger | Studiet gjennomføres som nettbasert deltidsutdanning med fysiske samlinger, fordelt over to semestre. | Undervisningen kombinerer nettundervisning, veiledning og samlinger, og veksler mellom forelesninger, refleksjonsoppgaver, gruppearbeid og praktiske veiledningsøvelser. Mellom samlingene arbeider du med oppgaver og faglig refleksjon knyttet til egen praksis. | Endelig plan for samlinger, undervisning og veiledning publiseres på | studentsiden for Kongsberg | før oppstart. | Obligatorisk oppmøte | Du må delta på minst | 75 % av de fysiske samlingene | for å få sluttvurdering i emnene. Enkelte arbeidskrav er obligatoriske. Manglende oppmøte kan føre til at du ikke får fullført studiet.",
      "police_certificate": null,
      "career_opportunities": "Denne fagskoleutdanningen gir deg økt kompetanse og trygghet i rollen som veileder i helsetjenesten. | Du utvikler ferdigheter i å planlegge, gjennomføre og evaluere veiledningsprosesser på en faglig og etisk bevisst måte. Utdanningen styrker handlingskompetansen din og gjør deg bedre rustet til å ta ansvar for opplæring, veiledning og kompetansedeling i arbeidshverdagen. | Kompetansen er særlig relevant for arbeid i: | kommunale helse- og omsorgstjenester | sykehjem og hjemmetjenester | spesialisthelsetjenesten | opplærings- og veiledningsroller i praksisfeltet | Du får en bred veiledningskompetanse som gjør deg til en viktig ressurs der fag, kvalitet og samhandling møtes.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/helse/praktisk-veiledning"
    }
  ],
  "courses": []
}