{
  "study_programs": [
    {
      "id": "Programvareutvikling - 60",
      "title": "Programvareutvikling",
      "description": "Programvareutvikling er videreutdanningen for deg som vil jobbe med utvikling av apper, nettsider og systemer – eller som ønsker å styrke din tekniske kompetanse i en stadig mer digital arbeidshverdag. Studiet er praktisk rettet og gir deg et solid grunnlag i programmering og systemutvikling, tilpasset deg som har yrkesfaglig bakgrunn og vil bygge videre.",
      "study_location": "Kjeller (Samlingsbasert 2 år) | Kongsberg (Samlingsbasert 2 år) | Fredrikstad (Deltid 2 år)",
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Digitalisering påvirker stadig flere bransjer, og behovet for ansatte som forstår hvordan programvare utvikles, tilpasses og vedlikeholdes er økende. Mange virksomheter har behov for medarbeidere som kan bidra i utviklingsprosjekter, forbedre eksisterende systemer eller samarbeide tett med IT-miljøer.\nProgramvareutvikling er utviklet for deg som ønsker en praktisk vei inn i IT-faget, uten å måtte starte på nytt akademisk. Studiet gir deg forståelse for hvordan programvare bygges fra idé til ferdig løsning, og hvordan ulike teknologier spiller sammen i moderne systemer.\nGjennom utdanningen utvikler du både teknisk innsikt og praktiske ferdigheter som kan brukes direkte i arbeidslivet. Du lærer å jobbe strukturert med programmering, systemutvikling og samarbeid i utviklingsprosjekter – kompetanse som er relevant i mange typer virksomheter og roller.",
      "what_learn": "I Programvareutvikling bygger du bred og anvendbar kompetanse innen utvikling av programvare og digitale løsninger. Studiet gir deg forståelse for hvordan applikasjoner, databaser og systemer utvikles, testes og videreutvikles i praksis.\nDu arbeider med sentrale temaer som programmering, systemutvikling, databaser, web- og apputvikling, infrastruktur og samarbeid i utviklingsprosjekter. Læringen tar utgangspunkt i praktiske problemstillinger og arbeidsformer som ligner dem du møter i yrkeslivet.\nStudiet består av seks emner som samlet gir deg et helhetlig grunnlag innen programvareutvikling. Emnene bygger på hverandre og gir gradvis økt forståelse for både tekniske løsninger og utviklingsprosesser.\nNedenfor kan du klikke på emnene for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger | Studiet gjennomføres som nettbasert deltidsutdanning med samlinger. Undervisningen kombinerer digitale læringsaktiviteter, nettundervisning og fysiske samlinger ved studiested Kjeller. | Samlingene holdes vanligvis to ganger per semester, og gir rom for undervisning, veiledning, samarbeid og praktisk arbeid. Mellom samlingene arbeider du med oppgaver, øving og nettbasert undervisning i læringsplattformen. | Endelig plan for samlinger, undervisning og aktiviteter publiseres på | studentsiden for Kjeller | før oppstart. | Obligatorisk oppmøte | Studiet kan inneholde krav til obligatorisk deltakelse i samlinger, undervisning og læringsaktiviteter. Nærmere informasjon om oppmøtekrav og konsekvenser ved fravær fremgår av emnebeskrivelsene.",
      "police_certificate": null,
      "career_opportunities": "Kompetansen fra Programvareutvikling brukes i utvikling, drift og videreutvikling av digitale løsninger i både private og offentlige virksomheter. Studiet gir et faglig grunnlag for å delta i utviklingsprosjekter, samarbeide med IT-miljøer og bidra i tekniske team. | Utdanningen er relevant for roller som programvareutvikler, web- eller applikasjonsutvikler, teknisk ressurs i utviklingsprosjekter eller som del av virksomhetens IT- og digitaliseringsarbeid. Kompetansen kan også brukes i roller der teknisk forståelse kombineres med fag- eller bransjekunnskap. | Studiet gir et solid grunnlag for videre faglig utvikling innen IT og programvareutvikling.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/it-og-data/programvareutvikling"
    }
  ],
  "courses": [
    {
      "id": "02TD57A EITDPVU",
      "title": "Infrastruktur for programmering",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/02TD57A-EITDPVU/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | kjenner til utvikling av brukergrensesnitt | har kunnskap om grunnleggende programmeringsteknikker som variabeldeklarasjoner, kontrollstrukturer, løkker og funksjoner | kjenner til viktigheten av å ivareta sikkerheten av applikasjoner | har kunnskap om GDPR | har kjennskap til universell utforming",
        "skills": "Ferdigheter | Studenten: | kan utvikle et brukergrensesnitt ved hjelp av kode og utviklingsverktøy | kan skrive kode med variabeldeklarasjoner, kontrollstrukturer, løkker og funksjoner | kan lese og tolke kode | kan vedlikeholde og forbedre eksisterende applikasjoner | kan drøfte sikkerheten til en applikasjon | kan vurdere en applikasjon i forhold til kravene om universell utforming",
        "competence": "Generell kompetanse | Studenten: | kan planlegge, prosjektere, dokumentere, iverksette og drifte applikasjoner | kan vedlikeholde og utvikle sin egen kompetanse innenfor emnet | kan delta aktivt i prosjekter | kan utføre arbeid etter oppdragsgivers behov, etablere fagnettverk og samarbeide med mennesker på kryss av fagfelt | kan utveksle bransjerelaterte synspunkter og informasjon | kan bygge relasjoner, både internt, eksternt og på tvers av fagfelt"
      }
    },
    {
      "id": "01TD01A",
      "title": "Systemutvikling og samarbeid",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TD01A/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om relevante systemutviklingsmetoder og -verktøy for samarbeid med andre | har kunnskap om metoder og teknikker for kommunikasjon med sluttbruker under planlegging og utvikling av programvare | har kunnskap om planlegging og implementering av programvare som tar hensyn til brukervennlighet og universell utforming i henhold til Digdir sine krav og regler | vet hvordan man kan oppdatere sin faglige kunnskap innenfor programmering og systemutvikling",
        "skills": "Ferdigheter | Studenten | kan designe programvare i henhold til Digdir sine krav og regelverk til universell utforming | kan vurdere bedriftens eller prosjektets økonomiske situasjon, og på bakgrunn av dette ta hensiktsmessige og begrunnede valgt | kan finne frem til relevant fagstoff og dokumentasjon | kan reflektere over egen faglig utøvelse",
        "competence": "Generell kompetanse | Studenten | kan delta aktivt i prosjekter | kan utføre arbeid etter oppdragsgivers behov, etablere fagnettverk og samarbeide med mennesker på kryss av fagfelt | kan utveksle bransjerelaterte synspunkter og informasjon | kan bygge relasjoner, både internt, eksternt og på tvers av fagfelt | kan planlegge, prosjektere og gjennomføre systemutvikling og programmering alene eller som deltager eller leder i en gruppe"
      }
    },
    {
      "id": "01TD01B",
      "title": "Grunnleggende programmering",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TD01B/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | kjenner til utvikling av brukergrensesnitt | har kunnskap om grunnleggende programmeringsteknikker som variabeldeklarasjoner, kontrollstrukturer, løkker og funksjoner | kjenner til viktigheten av å ivareta sikkerheten av applikasjoner | har kunnskap om GDPR | har kjennskap til universell utforming",
        "skills": "Ferdigheter | Studenten | kan utvikle et brukergrensesnitt ved hjelp av kode og utviklingsverktøy | kan skrive kode med variabeldeklarasjoner, kontrollstrukturer, løkker og funksjoner | kan lese og tolke kode | kan vedlikeholde og forbedre eksisterende applikasjoner | kan drøfte sikkerheten til en applikasjon | kan vurdere en applikasjon i forhold til kravene om universell utforming | kan gjøre rede for sine faglige valg | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Studenten | kan planlegge, prosjektere, dokumentere, iverksette og drifte applikasjoner | kan vedlikeholde og utvikle sin egen kompetanse innenfor emnet | kan delta aktivt i prosjekter | kan utføre arbeid etter oppdragsgivers behov, etablere fagnettverk og samarbeide med mennesker på kryss av fagfelt | kan utveksle bransjerelaterte synspunkter og informasjon | kan bygge relasjoner, både internt, eksternt og på tvers av fagfelt"
      }
    },
    {
      "id": "01TD01C",
      "title": "Webutvikling",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TD01C/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om fagterminologi, utviklingsspråk og arbeidsprosesser som anvendes i utviklingen av nettsider ved bruk av HTML og CSS | har grunnleggende kunnskap om programmeringsspråket JavaScript og fagterminologi i utviklingen av nettsider og web-applikasjoner | har kunnskap om fagterminologi i et JavaScript-rammeverk og hvordan dette anvendes i utviklingen av nettsider og web-applikasjoner | har innsikt i relevant regelverk for universell utforming og standarder og krav til kvalitet i utviklingen av nettsider | har kunnskap om responsivt og adaptivt design tilpasset forskjellige enheter | forstår betydningen av universelt utformede nettsider for å sikre tilgjengelighet og gode brukeropplevelser for alle brukergrupper | kan oppdatere sin yrkesfaglige kunnskap ved å gå gjennom faglig relevant dokumentasjon av ulike verktøyer og systemer",
        "skills": "Ferdigheter | Studenten | kan anvende kunnskap om HTML og CSS til å utvikle nettsider | kan anvende kunnskap om JavaScript til å utvikle nettsider og web-applikasjoner | kan anvende kunnskap om responsivt og adaptivt design til utviklingen av nettsider som tilpasses ulike skjermoppløsninger | kan anvende kunnskap om kolleksjoner av data og eksterne data i utvikling av nettsider og web-applikasjoner | kan anvende aktuelle verktøy for testing og kvalitetssikring av et nettsted i forhold til gjeldende krav og regelverk | kan anvende kunnskap om et JavaScript-rammeverk og hvordan dette kan benyttes for å utvikle nettsider og web-applikasjoner kan kartlegge | kan gjøre rede for sine faglige valg | kan reflektere over egen faglig utøvelse og justere denne under veiledning | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Studenten | kan delta aktivt i prosjekter | kan utføre arbeid etter oppdragsgivers behov, etablere fagnettverk og samarbeide med mennesker på kryss av fagfelt | kan utveksle bransjerelaterte synspunkter og informasjon | kan bygge relasjoner, både internt, eksternt og på tvers av fagfelt | kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjektere alene og som deltaker i gruppe | kan bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TD01D",
      "title": "Apputvikling",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TD01D/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om hva en mobil applikasjon er, og hvordan den utvikles | har kunnskap om forskjellige modeller av datastrukturer som anvendes i apper | har kunnskap om grunnleggende programmering i valgt programmerings-språk og de verktøy som brukes i utviklingen av apper | har kunnskap om UX/UI-utvikling i en app | har kunnskap om programmering av funksjoner og objektorientert programmering | har innsikt i relevant regelverk og standarder om universell utforming, og hvilke følger det har for programmering av brukergrensesnitt. | har kunnskap om fagterminologi innenfor utforming, grensesnitt og arbeidsprosesser som anvendes i oppsett av apper | har kunnskap om metoder og verktøy for oppsett og analyse av brukertester for å vurdere eget arbeid innenfor personvern, datasikkerhet og universell utforming | kan oppdatere sin kunnskap om programmering og utvikling av apper gjennom faglitteratur og søk i relevante artikkel- og ressursdatabaser og gjennom faglige felleskap | kan finne informasjon og fagstoff i aktuelle ressursbiblioteker og faglige diskusjonsfora til løsninger av programmeringsoppgaver",
        "skills": "Ferdigheter | Studenten | kan ta i bruk metoder og verktøy for å utvikle innhold og datastrukturer til apper | kan anvende kunnskap om grunnleggende programmering og objektorientert programmering til å utvikle apper | kan anvende kunnskap om XML og brukergrensesnitt (UI) til å utvikle universelt utformede apper. | kan anvende relevante utviklingsverktøy til å bygge apper | kan reflektere over egen programmeringspraksis knyttet til personvern og datasikkerhet og justere denne under veiledning | kan gjøre rede for sine faglige valg",
        "competence": "Generell kompetanse | Studenten | kan delta aktivt i prosjekter | kan utføre arbeid etter oppdragsgivers behov, etablere fagnettverk og samarbeide med mennesker på kryss av fagfelt | kan utveksle bransjerelaterte synspunkter og informasjon | kan bygge relasjoner, både internt, eksternt og på tvers av fagfelt"
      }
    },
    {
      "id": "01TD01E",
      "title": "Datastrukturer og databaser",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TD01E/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om grunnleggende databaseteori | har kunnskap om prinsippene for skytjenester som dataprosessering, datalagring og programvaretjenester | har kunnskap om grunnleggende algoritmer og datastrukturer | har kunnskap om kompleksitet og effektiviteten til forskjellige algoritmer | har kunnskap om relevante regelverk vedrørende datalagring",
        "skills": "Ferdigheter | Studenten | kan utvikle datamodeller med nøkler, tabeller og relasjoner | kan opprette databaser på lokale servere og som skytjeneste | utvikle webapplikasjoner som lagrer og henter data fra en database | kan gjøre rede for prinsippene for tjenester i nettskyen som dataprosessering, datalagring og programvaretjenester på tjenere i eksterne tjenerparker tilknyttet internett | kan bruke algoritmisk tenkning til å effektivisere databehandling og spørringer | kan designe og bruke datastrukturer for effektiv datahåndtering og -prosessering | kan anvende kunnskap om skytjenester til å etablere et datalager | kan ta begrunnede valg vedrørende lagring av data, i henhold til gjeldende lover og regler | kan finne og henvise til informasjon og fagstoff og vurdere relevansen for en yrkesfaglig problemstilling",
        "competence": "Generell kompetanse | Studenten | kan planlegge, prosjektere, dokumentere, implementere og drifte applikasjoner der nettskybaserte tjenester inngår | kan vurdere og velge passende algoritmiske løsninger og datastrukturer for prosjekter som krever datahåndtering | kan tilpasse databaser og algoritmer etter prosjektets behov og krav til ytelse | kan planlegge, prosjektere, dokumentere, implementere og drifte applikasjoner der databaser inngår | kan delta aktivt i prosjekter | kan utføre arbeid etter oppdragsgivers behov, etablere fagnettverk og samarbeide med mennesker på kryss av fagfelt | kan utveksle bransjerelaterte synspunkter og informasjon | kan bygge relasjoner, både internt, eksternt og på tvers av fagfelt"
      }
    }
  ]
}