{
  "study_programs": [
    {
      "id": "Prosessteknikk - 120",
      "title": "Prosessteknikk",
      "description": "Prosessteknikk er for deg som vil ta et steg videre i prosessindustrien. Du bygger trygghet i drift og vedlikehold, lærer å styre kvalitet og HMS, og får verktøyene som trengs for å lede forbedringer i teknisk avanserte anlegg.",
      "study_category": "Teknologi og industri",
      "study_location": {
        "1": "Fredrikstad"
      },
      "study_type": {
        "9": "Samlingsbasert 3 år"
      },
      "credits": 120,
      "language": "Norsk",
      "level": "Høyere fagskolegrad",
      "why_choose": "Norsk prosessindustri digitaliseres raskt, med økt krav til sikkerhet, effektiv drift og bærekraft. Bedriftene trenger fagfolk som forstår både kjemi, prosess og mennesker – og som kan omsette data til bedre beslutninger i produksjon. I Prosessteknikk utvikler du praktisk lederkompetanse og teknisk dømmekraft. Du lærer å vurdere risiko, kvalitet og ressursbruk på en helhetlig måte, og du trener på å samarbeide på tvers av fag. Resultatet er en kompetanse som gjør deg verdifull i hverdagen på anlegget – og som åpner dører til mer ansvar.",
      "what_learn": "Du får en solid kombinasjon av realfag, prosessforståelse og ledelse. Studiet gir innsikt i kjemi og fysikk bak prosessene, teknisk systemforståelse med måling, styring og regulering, samt kvalitet, HMS og prosjektstyring.\nDu lærer å planlegge og dokumentere produksjon, tolke og bruke prosessdata, og vurdere miljø- og bærekrafthensyn i hele verdikjeden. Undervisningen kobler teori med praktiske caser og erfaringsdeling.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres med fysiske samlinger. Samlingene holdes vanligvis flere ganger per semester og varer to til tre dager. Mellom samlingene følges en fast plan for nettundervisning og veiledning. Endelig plan publiseres på studentsiden for Fredrikstad før oppstart. Obligatorisk oppmøte Du må delta på minst 80 % av de fysiske samlingene for å få vurdert eksamen. Manglende oppmøte kan føre til at du ikke får fullført emnet.",
      "police_certificate": null,
      "career_opportunities": "Prosessteknikk kvalifiserer for ansvar i drift, vedlikehold og forbedringsarbeid i prosessindustrien, næringsmiddelindustrien og olje- og gassindustrien – på land og offshore. Kompetansen brukes til å sikre trygge og stabile prosesser, lede skift og team, og utvikle kvalitet, HMS og produksjonseffektivitet. Typiske roller er mellomleder, førstefagretningsleder, arbeidsleder/skiftleder, teknisk assistent/driftsassistent og stillinger innen HMS og kvalitetssikringssystemer . Utdanningen gir også et solid grunnlag for salg og teknisk rådgivning av utstyr til prosessindustrien, samt for arbeid som faglærer i videregående opplæring og opplæringspersonell i virksomheter.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/teknologi-og-industri/prosessteknikk"
    }
  ],
  "courses": [
    {
      "id": "01TX00A EITKFRE",
      "title": "Realfaglige redskap",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00A-EITKFRE/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om realfag som redskap innen sitt fagområde har kunnskap om realfaglige begreper, teorier, analyser, strategier, prosesser og verktøy som anvendes for å utføre nødvendige beregninger, dimensjoneringer, overslag og annen problemløsning med utgangspunkt i relevante praktiske situasjoner og problemstillinger innen fagretningen. har kunnskap om matematiske og fysiske lover, formler og symboler som er relevante for fagretningen kan vurdere eget arbeid i forhold til matematiske og fysiske lover har bransjekunnskap og kjennskap til yrkesfeltet en har valgt og om hvilken betydning realfaglige redskap har for fagretningen kan oppdatere sine kunnskaper innen realfag kjenner til matematikkens og fysikkens historie, tradisjoner, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter innen realfag",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av regneoperasjoner som anvendes for fagspesifikke problemstillinger kan gjøre rede for digitale verktøy som anvendes til problemløsninger innen realfaglige tema kan reflektere over egen faglig utøvelse og vurdere resultater av beregninger og justere denne under veiledning kan finne og henvise til informasjon og fagstoff i formelsamlinger og fagbøker og vurdere relevansen for en realfaglig problemstilling",
        "competence": "Generell kompetanse Studenten: kan planlegge og gjennomføre yrkesrettede arbeidsoppgaver og prosjekter alene og som deltaker i gruppe ved å anvende realfag i tråd med etiske krav, retningslinjer og målgruppens behov har innsikt i hvilke forutsetninger og forenklinger man har gjort i sine beregninger har innsikt i rekkevidde og begrensninger for de metoder som anvendes kan utveksle synspunkter og samarbeide om fagspesifikke problemstillinger med realfag som tverrfaglig fundament med fagfeller og dermed bidra til organisasjonsutvikling"
      }
    },
    {
      "id": "01TX00B EITKFRE",
      "title": "Kommunikasjon",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00B-EITKFRE/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om grunnleggende kommunikasjonsteori kjenner til hvilken betydning kulturell identitet har for samarbeid og kommunikasjon på arbeidsplassen har kunnskap om engelske faguttrykk som anvendes innenfor eget fagområde har kunnskap om sentrale retoriske begreper og virkemidler har kunnskap om kildebruk etter standard for høyere utdanning kjenner til vanlige digitale verktøy for kildehenvisning, dokumentasjon, tekstproduksjon, deling, presentasjon og møter har kjennskap til prinsipper for tekstorganisering og -produksjon har kunnskap om hva som kjennetegner en problemstilling og hvordan svare på denne",
        "skills": "Ferdigheter Studenten kan reflektere over møter mellom forskjellige arbeidslivskulturer kan bruke relevante begreper for å analysere egen og andres tekst kan reflektere over og revidere tekster kan reflektere over hvordan retorikk benyttes kan bygge opp saklig argumentasjon og bruke retoriske apellformer kan innhente informasjon fra ulike kilder og bruke den kritisk, hensiktsmessig og etterrettelig kan reflektere over egen kommunikasjon i profesjonell sammenheng kan produsere tekster der form og innhold er tilpasset situasjon, mål og mottaker kan bruke digitale kommunikasjonsverktøy i profesjonell sammenheng kan uttrykke seg med nyansert ordvalg, variert setningsstruktur og god tekstbinding kan planlegge, strukturere og gjennomføre møter og presentasjoner",
        "competence": "Generell kompetanse Studenten kan kommunisere hensiktsmessig for å bidra til en inkluderende organisasjonskultur kan tilpasse språk og argumentasjon etter mål og mottaker kan produsere tekster med korrekt rettskriving, grammatikk og tegnsetting behersker relevante kommunikasjonsverktøy kan kommunisere gjennom relevante tekster og kanaler kan samarbeide om tekstproduksjon"
      }
    },
    {
      "id": "01TX00C EITKFRE",
      "title": "Ledelse, økonomi og markedsføring (LØM)",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00C-EITKFRE/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om sentrale begreper innen økonomi, organisasjon og markedsføring knyttet til ledelse av foretak har kunnskap om lønnskostnader har kunnskaper om mål, tiltak og handlingsplaner • kjenner til emnets aktuelle lover og avtaler",
        "skills": "Ferdigheter Studenten kan kartlegge eksterne og interne arbeidsbetingelser og utarbeide situasjonsanalyser kan gjøre rede for bedriftens økonomiske status ved å hente ut økonomiske data fra regnskapet og bruke dem i analyser og kalkyler kan vurdere bedriftens betalingsevne og kapitalbehov kan planlegge økonomiske milepæler ved å utarbeide budsjett og gjøre rede for økonomisk måloppnåelse ved å vurdere eventuelle avvik kan gjennomføre en investeringsanalyse og reflektere over lønnsomheten i en mulig fremtidig investering kan bruke regneark i arbeidet med regnskap, budsjett, analyser og kalkyler kan foreta en helhetlig prisvurdering og utarbeide kalkyler kan vurdere organisasjonsstruktur og -kultur samt arbeidsmiljø for å videreutvikle virksomheten kan kommunisere, lede og motivere personalet på måter som fremmer effektivitet og trivsel kan identifisere, analysere og utvikle medarbeidernes kompetanse • kan planlegge og gjennomføre gode rekrutteringsprosesser, fra behovsanalyse til introduksjon kan gjøre rede for kjøpsprosessen i ulike markeder og kan vurdere kundens kjøpsatferd i disse kan vurdere valg av markedskommunikasjonstiltak i aktuelle medier og kunne tilpasse budskap til utvalgte målgrupper i de aktuelle medier kan vurdere hvilke produkter bedriften bør satse på, i hvilke markeder satsningen bør skje og hvilke distribusjonskanaler som bør benyttes kan vurdere valg av virksomhets- og markedsstrategi",
        "competence": "Generell kompetanse Studenten kan innen gitte tidsfrister, alene og i samarbeid med andre, planlegge, gjennomføre, dokumentere og levere arbeidsoppgaver og prosjekter kan etablere, utvikle og lede en organisasjon på måter som fremmer både effektivitet, arbeidsmiljø, bærekraft og samfunnsansvar har digital kompetanse til å søke kunnskap og informasjon, og kan tolke og bruke informasjonen i videre arbeid kan kommunisere internt og eksternt og benytte digitale verktøy til dette. kan utarbeide relevante faglige dokumenter som for eksempel pristilbud, tiltak/handlingsplaner, arbeidsavtaler, møteinnkallinger med saksframlegg, forretningsplan og markedsplaner kan reflektere over samfunnsutvikling og kan relatere dette til bedriftens situasjon"
      }
    },
    {
      "id": "01TK01C EITKKPFH24",
      "title": "Innledende kjemi",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK01C-EITKKPFH24/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om atomteori, periodiske system og kjemiske bindinger har kjennskap til IUPACs navnsettingsregler har kunnskap om ulike kjemiske reaksjoner og reaksjonslikninger i uorganisk og organisk kjemi inkludert energiforandringer ved reaksjoner har kunnskap om relevante beregninger innen uorganisk og organisk kjemi har kunnskap om grunnleggende elektrokjemi har kunnskap om organiske forbindelser og deres egenskaper har kjennskap til fremstilling, anvendelse, og analyse- og separasjonsmetoder innen organiske kjemi kjenner til kjemifagets historie, tradisjon, egenart og plass i samfunnet har innsikt i egne utviklingsmuligheter innen fagretning kjemi",
        "skills": "Ferdigheter Studenten kan gjøre rede for periodesystemet og kjemiske tabeller som verktøy for å forklare egenskapene til grunnstoffer og deres forbindelser kan gjøre rede for reaksjonslikninger og utføre aktuelle beregninger innenfor uorganisk og organisk kjemi Kan utføre forsøk på en sikkerhetsmessig forsvarlig måte, samt kunne vurdere feilkilder, observere, tolke, reflektere og presentere resultater Kan redegjøre for egenskaper til organiske forbindelser samt fremstilling og anvendelse kan finne og henvise til informasjon fra stoffkartotek og aktuelle oppslagsverk og vurdere relevansen for en kjemisk problemstilling kan kartlegge en kjemisk reaksjon og identifisere faglige problemstillinger og behov for justeringer og tiltak",
        "competence": "Generell kompetanse Studenten kan vise god forståelse for kjemiske stoffer og reaksjoner kan planlegge, gjennomføre og dokumentere arbeid på et kjemilaboratorium alene og som deltaker i gruppe på en sikkerhetsmessig, miljømessig, effektiv og etisk riktig måte kan utveksle synspunkter og delta i faglige diskusjoner"
      }
    },
    {
      "id": "01TK01D EITKKPFH24",
      "title": "HMS og bærekraft",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK01D-EITKKPFH24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om grunnleggende HMS kan vurdere eget og andres HMS i forhold til gjeldende normer og krav har innsikt i egne utviklingsmuligheter innen HMS har kunnskap om lover og forskrifter som gjelder for HMS-arbeidet i en prosessbedrift har kunnskap om oppbygging av HMS-organisasjonen i arbeidslivet og om de vanligste prinsippene for kvalitets- og HMS-system har kunnskap om de vanligste eksponeringsfaktorene i arbeidslivet, risiko og risikovurdering, og kjenner de vanligste former for risikoreduserende tiltak har kunnskap om fornuftig ressursutnyttelse, avfallsbehandling og andre prinsipper for grønn kjemi kan vurdere betydningen av utslipp fra moderne industri og samfunnsliv i forhold til gjeldende normer og krav til forurensning av jord, luft og vann har kunnskap om økologi, energiformer og renere produksjon har kunnskap om fornybare og ikke-fornybare energikilder og miljømessige konsekvenser ved bruk av disse",
        "skills": "Ferdigheter Studenten kan reflektere over et sikkert arbeidsmiljø og ut ifra dette, planlegge og iverksette systematiske tiltak for å forhindre skade på mennesker, materiell og miljø kan gjøre rede for valg av HMS-tiltak knyttet til kjemitekniske prosesser kan finne og henvise til informasjon og fagstoff og vurdere relevansen for aktuelle problemstillinger knyttet til HMS kan gjøre rede for risikoanalyse, avviksregistrering og behandling av disse kan gjøre rede for miljømessige forhold ved fremstilling, bruk og avhending av kjemiske stoffer og toksikologiske effekter av kjemiske stoffer på levende organismer kan gjøre rede for faremomentene der prosessutstyr befinner seg i et eksplosjonsfarlig eller helsefarlig område kan gjøre rede for etiske og samfunnsmessige utfordringer ved en prosessbedrift",
        "competence": "Generell kompetanse Studenten kan bidra til et godt og sikkert fysisk og psykisk arbeidsmiljø med fokus på aktivt vernearbeid kan bidra til organisasjonsutvikling innen HMS og bærekraft kan planlegge og gjennomføre interne HMS-inspeksjoner, vernerunder og HMS-revisjoner alene og som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan utveksle synspunkter med andre med bakgrunn innenfor miljøkjemi og delta i diskusjoner om utvikling av god praksis for bærekraft- og ressursutnyttelse kan gjøre rede for miljømessige konsekvenser ved prosessindustri, herunder unngå utslipp av farlige stoffer"
      }
    },
    {
      "id": "01TK01E EITKKPFH24",
      "title": "Generell kjemiprosess",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK01E-EITKKPFH24/2024-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har generell kunnskap om prosesskjemiske- og tekniske installasjoner i et prosessanlegg har kunnskap om varmetransport gjennom ledning, konveksjon og stråling har generell kunnskap om strømning og strømningstyper har generell kunnskap om materialer som anvendes innen generelle kjemiprosesser, samt om deformasjon av materiale og varmebehandling har generell kunnskap om korrosjon og korrosjonsbeskyttelse",
        "skills": "Ferdigheter Studenten kan gjøre rede for varmeveksling og relevante beregninger av varmetransport/varmetap kan gjøre rede for relevante beregninger av væskestrøm og pumper kan gjøre rede for valg av pumper og ventiler i prosessindustrien med tanke på prosessapparater og materialer kan gjøre rede for valg av ulike apparat som brukes i prosessindustrien kan finne og henvise til informasjon og fagstoff innen kjemiprosess og vurdere relevansen for en faglig problemstilling kan gjøre rede for valg av metaller, ikke-metaller, plast og komposittmaterialer ut fra deres egenskaper, bruksområder og gjenbruk. kan gjøre rede for ulike typer korrosjon i ulike miljø",
        "competence": "Generell kompetanse Studenten kan planlegge, gjennomføre og dokumentere arbeid på en maskin/prosessutstyr som benyttes i en kjemiprosess alene og som deltaker i gruppe kan bygge relasjoner med fagfeller innen kjemiprosess kan utveksle synspunkter med andre med bakgrunn innenfor kjemiprosess og delta i diskusjoner kunne gjøre rede for de mest aktuelle materialer og deres egenskaper som brukes i prosessindustrien ha kunnskap om de vanligste korrosjonsproblemer, slitasjer og skader som kan oppstå på de forskjellige materialer i bruk"
      }
    },
    {
      "id": "01TK01J EITKKPFH24",
      "title": "Prosjekt og kvalitetsledelse",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK01J-EITKKPFH24/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om grunnleggende prosjekt- og kvalitetsledelse har kunnskap om styringsverktøy for igangsetting, planlegging og gjennomføring av prosjekter har kunnskap om kvalitetsbegreper har kunnskap om utarbeidelse, bruk og vedlikehold av IK-system og KS, i samsvar med lover, forskrifter og standarder kan vurdere eget og andres prosjekt-, og kvalitetsarbeid i forhold til gjeldende normer og krav har innsikt i egne utviklingsmuligheter innen prosjekt- og kvalitetsledelse",
        "skills": "Ferdigheter Studenten kan gjøre rede for aktiviteter som kontrollerer og sikrer kvalitet kan gjøre rede for styringen av et prosjekt med hensyn til tid, kost og kvalitet kan gjøre rede for sine faglige valg kan finne og henvise til informasjon og fagstoff og vurdere relevansen for aktuelle problemstillinger knyttet til prosjekt og kvalitetsledelse kan reflektere over egen faglig utøvelse og justere denne under veiledning",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre et prosjekt, samt utarbeide relevant dokumentasjon kan utveksle synspunkter og delta i diskusjoner om hvordan ledelse kan utøves kan bidra til organisasjonsutvikling innen prosjekt- og kvalitetsarbeid"
      }
    },
    {
      "id": "01TK01K EITKKPFH24",
      "title": "Kjemiteknisk prosess",
      "credits": 20,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK01K-EITKKPFH24/2025-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har generell kunnskap om beregning, dimensjonering, oppbygning og funksjon av forskjellig prosessteknisk utstyr med utgangspunkt i relevante og praktiske situasjoner. har kunnskap om separasjonsmetoder for væske, gass og fast stoff har kunnskap om entalpi- og entropidiagrammer for dampfremstilling og damputnyttelse og om trykk-entalpidiagram for beregning av effekt i kjøleanlegg og varmepumper har generell kunnskap om vedlikeholdsteori, -metoder og -filosofi, vedlikeholdsbegreper og nødvendige beregninger innenfor vedlikehold",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av prosessteknisk utstyr ut fra oppbygging, virkemåte og bruksområde kan gjøre rede for valg av termisk og mekanisk separasjonsutstyr for gasser, væsker og fast stoff med tanke på funksjon og virkemåte kan gjøre rede for valg av nødvendige prosesskjemiske og prosesstekniske installasjoner ut fra beregninger og dimensjoneringer. Kan reflektere over valg av metoder, begreper og resultater av statistiske beregninger innen vedlikehold kan finne og henvise til informasjon og fagstoff om kjemiteknisk prosess og vurdere relevansen for en yrkesfaglig problemstilling kan reflektere over resultatene etter reservedelsanalyser og beregnet reservedelsberedskap",
        "competence": "Generell kompetanse Studenten kan vurdere valg og bruk, samt kunne utføre beregninger av kjemiteknisk utstyr kan bygge relasjoner med fagfeller innen kjemiteknisk prosess og på tvers av fag, samt med eksterne målgrupper kan utveksle synspunkter med andre med bakgrunn innenfor kjemiteknisk prosess og delta i diskusjoner om utvikling kan være med å utarbeide planer for gjennomføring av vedlikeholdsarbeid, som deltaker i gruppe og i tråd med etiske krav og retningslinjer kan planlegge inspeksjon for å oppdage skader, feil og driftsforstyrrelser i enkeltkomponenter alene og som deltaker i gruppe kan utføre arbeidet etter kunders ønsker og myndigheters krav"
      }
    },
    {
      "id": "01TK01L EITKKPFH24",
      "title": "Teknisk systemforståelse",
      "credits": 15,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK01L-EITKKPFH24/2026-host",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har generell kunnskap om flytskjemaer, tegneregler og symboler som benyttes i et prosessanlegg. har kunnskap om ulike aktuelle målestørrelser som mengde, trykk, temperatur og nivå har kunnskap om ulike måle- og styre- og reguleringsprinsipper som er aktuelle i de forskjellige prosessene har kunnskap om DAK i sammenheng med planlegging, dokumentering og simulering",
        "skills": "Ferdigheter Studenten kan gjøre rede for valg av verktøy og metoder for planlegging, oppfølging og styring av et prosessanlegg kan gjøre rede for hvordan man benytter de ulike måle-, styre- og reguleringsprinsippene som er aktuelle for å oppnå best mulig prosess under drift. kan finne og henvise til informasjon og fagstoff om teknisk systemforståelse i et prosessanlegg og vurdere relevansen for en yrkesfaglig problemstilling kan kartlegge måle- eller styretekniske systemer og identifisere faglige problemstillinger og behov for iverksetting av tiltak for å optimalisere og sikre et prosessanlegg kan gjøre rede for valg av skjema og dokumenter som er nødvendig for å drive et prosessanlegg kan gjøre rede for bruk av DAK til å planlegge, dokumentere og simulere et prosessanlegg",
        "competence": "Generell kompetanse Studenten kan planlegge og drifte et prosessanlegg ved hjelp av måling, styremetode og reguleringsteknikk som leder eller deltaker i gruppe på en miljøvennlig, økonomisk og sikker måte kan utføre arbeidet etter kunders ønsker og myndigheters krav kan utveksle synspunkter med andre fagfeller og delta i diskusjoner om utvikling kan anvende flytskjema for arbeid og utvikling i et prosessanlegg"
      }
    },
    {
      "id": "01TK01M EITKKPFH24",
      "title": "Prosessteknologiske metoder",
      "credits": 5,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TK01M-EITKKPFH24/2026-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om variert laboratorieutstyr i prosessindustrien har kunnskap om analyseinstrumenter og –metoder",
        "skills": "Ferdigheter Studenten kan gjøre rede for prinsipper i anvendt utstyr kan utføre prosessteknisk laboratoriearbeid og utføre analyser med ulike analyseinstrumenter kan dokumenter og fremstille resultater ved rapportskriving kan gjøre rede for faremomenter ved behandling av kjemiske stoffer og bruk av prosessteknisk laboratorieutstyr kan observere data og mulige feilkilder, vurdere og justere innstillinger på laboratorieutstyr",
        "competence": "Generell kompetanse Studenten kan planlegge og gjennomføre et praktisk forsøk kan vurdere resultater, feilkilder samt sporbarheten i en kjemisk analyse kan forklare hensikten med å kalibrere analyseinstrumenter kunne se sammenheng mellom teori og utført prosessteknisk laboratoriearbeid kunne skrive en laboratorierapport slik at dataene er reproduserbare"
      }
    },
    {
      "id": "01TX00H EITKFRE",
      "title": "Hovedprosjekt",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01TX00H-EITKFRE/2027-var",
      "study_level": "Fagskole nivå 5.2",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten har kunnskap om hvordan man skriver en prosjektrapport har særskilte kunnskaper om et selvvalgt tema med en problemstilling innenfor fordypningen har kunnskap om hvordan man innhenter informasjon om tema for et hovedprosjekt har kunnskap om sammenhengen mellom teori og praksis kan vurdere eget prosjekt i forhold til gjeldende normer og krav kjenner til bransjen/yrker som er knyttet til tema i hovedprosjektet",
        "skills": "Ferdigheter Kandidaten: kan gjøre rede for valg av tema for hovedprosjekt kan identifisere, kartlegge og vurdere en faglig problemstilling kan delta i teamarbeid, planlegge, kommunisere og presentere prosjektarbeid og resultat kan skrive en prosjektrapport kan drøfte sammenhengen mellom teori og praksis kan reflektere over eget prosjekt og justere dette under veiledning av fagfolk kan finne og henvise til informasjon og fagstoff for å vurdere relevansen til en problemstilling i et prosjekt kan benytte IKT-verktøy for prosjektstyring, og innenfor temaer og problemstillinger der programvarebruk er relevant/påkrevd",
        "competence": "Generell kompetanse Kandidaten: kan planlegge og gjennomføre et prosjektarbeid alene og som deltaker i gruppe i tråd med formelle og etiske krav og retningslinjer har utviklet en bevissthet rundt prosjektarbeid og kan fordype seg i tema som danner grunnlag for prosjektet, samt tenke kreativt og nyskapende kan utføre et prosjektarbeid i tråd med bedrifters eller arbeidsgivers behov kan utveksle synspunkter med andre i team eller bedrift og delta i diskusjoner om utvikling av et prosjekt"
      }
    }
  ]
}