{
  "study_programs": [
    {
      "id": "Prosessindustri i grønt skifte - 15",
      "title": "Prosessindustri i grønt skifte",
      "description": "Er du fagarbeider i prosessindustrien og ønsker å bidra til det grønne skiftet? Studiet Prosessindustri i grønt skifte gir deg den nødvendige kompetansen for å møte fremtidens krav til bærekraft og digitalisering. Studiet er spesielt tilpasset deg som har fagbrev og erfaring fra industrien, og som ønsker å utvide din kunnskap og ansvar i en tid med store omstillinger.",
      "study_location": "Kongsberg (Samlingsbasert 7 måneder)",
      "credits": 15,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Modulstudiet Prosessindustri i grønt skifte er utviklet for å gi fagarbeidere i prosessindustrien en solid forståelse av hvordan bærekraft og digitalisering påvirker industriprosesser.\nStudiet passer for deg som er operatør, mellomleder eller har andre  arbeidsoppgaver knyttet til produksjon i prosessindustrien. Modulen er spesielt relevant for deg som ønsker å styrke din kompetanse innen bærekraft, HMS og digitalisering, og som ser verdien av en helhetlig forståelse av verdikjeder og virksomhetssystemer.\nProsessindustri i grønt skifte gjør deg godt rustet til å møte fremtidens utfordringer og bidra til en bærekraftig utvikling i prosessindustrien. Du får en erfaringsbasert praktisk tilnærming til system- og teknologiforståelse, som sammen med din yrkesfaglige bakgrunn, gjør deg til en nøkkelperson i overgangen til grønn industri.\nDette studiet er med i | Industrifagskolen | .",
      "what_learn": "Studiet har et omfang på 15 studiepoeng, fordelt på en fellesdel og en valgbar spesialisering innen enten karbon, elektrolyse eller støperi. Du vil få innsikt i konkrete problemstillinger og behov knyttet til produksjonsprosesser i egen bedrift. Studiet kombinerer teori og praksis på en spennende og relevant måte, og du vil arbeide både selvstendig og i grupper. Arbeidsformene i studiet omfatter forelesninger, praktiske oppgaver både individuelt og i grupper, problemorientert undervisning, samarbeidslæring, veiledning og tverrfaglige prosjekter i samarbeid med næringslivet.\nStudiet består av en fellesdel og en valgbar del:\nDet er ikke planlagt oppstart av dette studiet studieåret 2025/2026. Om du synes dette studiet virker interessant og ønsker å bli oppdatert om det blir nye oppstart, kan du | melde din interesse for dette studiet | .",
      "teaching_format": null,
      "mandatory_attendance": null,
      "police_certificate": null,
      "career_opportunities": "Dette studie gir deg en dypere forståelse av bærekraft og digitalisering i industriprosesser. Du vil lære om sirkulærøkonomi, verdikjeder, og ny teknologi som er avgjørende for det grønne skiftet. Med denne kompetansen kan du planlegge og gjennomføre arbeidsoppgaver relatert til vedlikehold, produksjonsprosesser, varestrøm, kvalitetssikring og prosjekter i prosessindustrien. Du vil være kvalifisert til å ta på deg større ansvar, enten som operatør, mellomleder eller prosjektleder, og bidra til forbedringsarbeid og innovasjon i din bedrift. Dette gjør deg til en verdifull ressurs i overgangen til en mer bærekraftig og digitalisert industri.",
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Studiekoordinator: | Helene Eikefjord – e-post: | heleneeik@afk.no | Du kan også | melde din interesse i dette skjemaet | , så vil vi ta kontakt med deg.",
      "study_url": "https://fagskolen-viken.no/studier/teknologi-og-industri/prosessindustri-i-gront-skifte"
    }
  ],
  "courses": []
}