{
  "study_programs": [
    {
      "id": "Prosjektledet innovasjon - 60",
      "title": "Prosjektledet innovasjon",
      "description": "Prosjektledet innovasjon er en videreutdanning for fagarbeidere og yrkesutøvere som ønsker å styrke sin rolle i utviklings- og forbedringsarbeid på arbeidsplassen. Studiet gir praktiske verktøy i innovasjon og prosjektarbeid, og kan tas ved siden av jobb.",
      "study_category": "Ledelse",
      "study_location": {
        "1": "Fredrikstad"
      },
      "study_type": {
        "8": "Samlingsbasert 2 år"
      },
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Prosjektledet innovasjon gjør deg mer trygg og relevant i jobben – særlig når det er krevende tider.\nI mange virksomheter stilles det høye krav til omstilling, effektiv ressursbruk og bærekraft, samtidig som tempoet er høyt og handlingsrommet ofte begrenset. Da er det behov for ansatte som kan jobbe strukturert med forbedringer og utvikling innenfor eksisterende rammer.\nStudiet er utviklet for fagarbeidere og yrkesutøvere som ønsker å styrke sin rolle i utviklings- og forbedringsarbeid på arbeidsplassen. Du får praktisk kompetanse i innovasjon, bærekraft og prosjektarbeid, med tydelig kobling til egen arbeidshverdag og eksisterende drift.\nKompetansen er relevant på tvers av bransjer og konjunkturer. Den gjør deg bedre rustet til å ta ansvar, samarbeide med andre og bidra konstruktivt i en arbeidshverdag preget av endring og krav til bærekraftige løsninger.",
      "what_learn": "I Prosjektledet innovasjon utvikler du kompetanse i å planlegge, gjennomføre og følge opp innovasjons- og forbedringsprosesser i eksisterende virksomheter. Studiet gir deg verktøy for å jobbe strukturert med endring, prosjektarbeid og bærekraft – med utgangspunkt i utfordringer du møter i arbeidshverdagen.\nDu arbeider med temaer som innovasjon i praksis, prosjektledelse, endringsarbeid, bærekraftige løsninger, økonomiforståelse, kvalitet og logistikk. Gjennom studiet lærer du å vurdere behov, prioritere tiltak og bidra til utvikling som er gjennomførbar innenfor virksomhetens rammer.\nLæringen er praksisnær og bygger på din faglige og praktiske erfaring. Du kobler ny kunnskap til egen arbeidssituasjon og utvikler ferdigheter i samarbeid, strukturert problemløsning og gjennomføring av prosjekter i samspill med kollegaer og ledelse.\nStudiet består av flere emner som samlet gir en helhetlig kompetanse innen prosjektledet innovasjon. Nedenfor kan du klikke på emnene for å lese mer om innhold og oppbygning.\nNedenfor kan du klikke på emnene for å lese mer om innhold og oppbygning.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres som nettbasert deltidsutdanning med fysiske samlinger. Undervisningen kombinerer digitale læringsaktiviteter, veiledning og samlinger knyttet til de enkelte emnene. Der emnene har samlinger, gjennomføres disse normalt én til to ganger per emne. Endelig plan for gjennomføring, samlinger og undervisning publiseres på studentsiden for Fredrikstad før oppstart.",
      "police_certificate": null,
      "career_opportunities": "Prosjektledet innovasjon gir kompetanse som brukes i utviklings- og forbedringsarbeid i eksisterende virksomheter. Studiet styrker evnen til å ta ansvar i prosjekt- og forbedringsprosesser, samarbeide på tvers av fag og bidra til bærekraftige endringer i drift og organisasjon. Kompetansen er relevant i roller der du deltar i eller har ansvar for utviklings- og forbedringsarbeid på arbeidsplassen. Studiet gir et faglig grunnlag for å bidra strukturert i prosjekter og endringsprosesser, enten som faglig ressurs, prosjektstøtte eller del av virksomhetens utviklingsarbeid.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/ledelse/prosjektledet-innovasjon"
    }
  ],
  "courses": []
}