{
  "study_programs": [
    {
      "id": "Psykisk helsearbeid og rusarbeid - 60",
      "title": "Psykisk helsearbeid og rusarbeid",
      "description": "Psykisk helsearbeid og rusarbeid er videreutdanningen for deg som vil gjøre en konkret forskjell for mennesker med sammensatte utfordringer. Du bruker relasjons- og miljøterapeutiske metoder, helsefremming og forebygging, og tverrfaglig samhandling for å gi trygg oppfølging – i hverdagen, i kriser og over tid.",
      "study_location": "Fredrikstad (Samlingsbasert 2 år) | Kjeller (Samlingsbasert 2 år) | Kongsberg (Samlingsbasert 2 år)",
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Helsesektoren trenger flere fagfolk med spisskompetanse på psykisk helse og rus. Utdanningen gjør deg bedre rustet til å planlegge, organisere og iverksette målrettede tiltak sammen med brukere, pårørende, kollegaer, frivillige og andre tjenester. Du blir tryggere i etiske dilemmaer, mer treffsikker i kartlegging og samhandling – og opplever større mestring i arbeidet. Målet er helhetlige tjenester som forebygger, behandler og koordinerer bedre, slik at hver bruker møtes med riktig hjelp til riktig tid.\nFor dette studiet er det krav om | politiattest | .\nSe filmen av vår tidligere student Monica Pettersen. Hun forteller om studiet og kompetansen du får ved å gå Psykisk helsearbeid og rusarbeid.",
      "what_learn": "I dette studiet lærer du å forstå og støtte mennesker som lever med psykiske lidelser eller rusutfordringer. Du utvikler trygghet i miljøterapeutisk arbeid, kommunikasjon og etisk refleksjon, og lærer å samarbeide med brukere, pårørende og ulike fagmiljøer for å skape helhetlige tjenester. Undervisningen kombinerer teori, simulering og refleksjon, med praksisfeltet som en sentral læringsarena.\nStudiet består av seks emner, inkludert praksis og en avsluttende fordypningsoppgave. Du søker opptak til hele utdanningen og oppnår fagskolegrad når du har fullført. | Klikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger Studiet kombinerer nettundervisning med fysiske samlinger ved studiested Fredrikstad. Samlingene holdes vanligvis to til tre ganger per semester og varer to til tre dager. Nettundervisning gjennomføres én fast dag i uken, og mellom samlingene får du veiledning individuelt eller i grupper. Studiet inneholder praksis i andre studieår. Praksisperioden går normalt over ti uker, og kan legges til egen arbeidsplass dersom arbeidsoppgavene er relevante, eller gjennomføres på praksisplass i regi av skolen. Oppdatert plan med detaljerte undervisningstider og samlingsuker for alle emner publiseres på studentsiden for Fredrikstad før oppstart. Obligatorisk oppmøte Du må delta på minst 75 % av de fysiske samlingene for å få vurdert eksamen. Praksis har egne regler for oppmøte – se studieplanen for detaljer. Manglende oppmøte kan føre til at du ikke får fullført emnet. Politiattest Dette studiet krever gyldig politiattest før studiestart. Søk om politiattest når du har akseptert studieplassen. Les vår veiledning til hvordan du søker politiattest før du går videre til politiets nettsider for å sende søknaden.",
      "police_certificate": "Sjekk opptakskrav",
      "career_opportunities": "Kompetansen er relevant i kommunale helse- og omsorgstjenester (bo- og omsorgstjenester, hjemmetjeneste, helsehus, aktivitetssentre), psykisk helse- og rustjenester, NAV-tiltak, oppvekst- og kultursektor (f.eks. skoler/SFO, ungdomsarenaer), samt i spesialisthelsetjenesten og tverrfaglige team. Utdanningen styrker rollen din i oppfølging, koordinering og miljøterapeutisk arbeid – og åpner for mer ansvar i brukerrettet arbeid, samhandling og kvalitetsutvikling på arbeidsplassen.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/helse/psykisk-helsearbeid-og-rusarbeid"
    }
  ],
  "courses": [
    {
      "id": "01HH00A EIHOPSF-H25",
      "title": "Etikk, samhandling og kommunikasjon",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00A-EIHOPSF-H25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: Har kunnskap om menneskesyn, menneskerettigheter, yrkesetiske prinsipper og retningslinjer, og etisk refleksjon knyttet til arbeid i helse- og omsorgssektoren Har innsikt i lover og forskrifter som regulerer pasient- og brukerrettigheter, helsepersonells ansvar og plikter, og kvaliteten på tjenestetilbud på kommunalt, regionalt og statlig nivå Har kunnskap om kommunikasjonsteori, -teknikker og -former, samhandling og konflikthåndtering knyttet til arbeid i helse- og omsorgssektoren Har kunnskap om samfunnets og velferdsstatens utvikling, og om helse- og sosialpolitiske prioriteringer Har kunnskap om begreper innen sosiologi og psykologi knyttet til enkeltindividet, familien og sosialt nettverk",
        "skills": "Ferdigheter Studenten: Kan anvende kunnskap om menneskesyn, menneskerettigheter, yrkesetiske prinsipper og retningslinjer, til etisk refleksjon rundt praktiske og teoretiske problemstillinger i helse- og omsorgssektoren Kan anvende kunnskap om kommunikasjonsteori, -teknikker og -former, til å samhandle profesjonelt med brukere, pårørende, frivillige og kollegaer, og til å forebygge og håndtere konflikter Kan anvende kunnskap om kvalitetssikring og internkontroll til å delta i kvalitetsarbeid på arbeidsplassen Kan anvende kunnskap innen sosiologi og psykologi til å motivere brukeren slik at han eller hun tar i bruk egne ressurser og opplever mestring Kan finne fagstoff og anvende kunnskap om læring, studieteknikk og arbeidsformer til å løse oppgaver i studiet",
        "competence": "Generell kompetanse Studenten Har forståelse for yrkesetiske retningslinjer som regulerer yrkesutøvelsen innenfor helse- og omsorgstjenesten Har utviklet en etisk grunnholdning som kommer til uttrykk gjennom refleksjon over egen atferd og kommunikasjon i situasjoner med brukere, pårørende og kollegaer Kan utføre arbeidet med utgangspunkt i brukerens perspektiv, i tråd med prinsipper om brukermedvirkning og respekt for enkeltindividets verdi og verdighet Kan bygge relasjoner basert på likeverdighet og respekt, slik at brukere og pårørende opplever trygghet og har tillit til tjenestetilbudet Kan utføre arbeidet etter arbeidsplassens HMS- rutiner for kvalitetssikring og internkontroll"
      }
    },
    {
      "id": "00HH14H EIHOPSF-H25",
      "title": "Helsefremmende og forebyggende arbeid",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14H-EIHOPSF-H25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: Har kunnskap om hva som fremmer og hemmer god helse i ulike livsfaser for mennesker med psykiske lidelser og ruslidelser. Har kunnskap om forebyggende arbeid blant barn og unge Har kunnskap om psykiske lidelser og ruslidelser i et helhets og samfunnsperspektiv",
        "skills": "Ferdigheter Studenten: Kan anvende ulike kommunikasjonsformer for å oppnå tillit, og brukermedvirkning, Kan anvende ulike kommunikasjonsformer og teknikker for å unngå krenkelser som tvang og maktbruk Kan anvende sin kunnskap i samarbeidet med bruker/pasient, pårørende og fagpersoner, Kan identifisere ressurser og problemer hos pasienten/ brukeren og i dennes miljø, Kan kartlegge, vurdere behov og iverksette tiltak for å fremme helse, forebygge problemutvikling, sykdom og funksjonsnedsettelse og behovet for meningsfull aktivitet for bruker/pasient.",
        "competence": "Generell kompetanse Studenten: Kan utføre sitt arbeid i tråd med yrkesetiske retningslinjer og lovverket innen psykisk helsevern og rusomsorgen Har utviklet en etisk grunnholdning og reflekterer over egne holdninger i utøvelsen av helsefremmende og forebyggende arbeid innen psykisk helsevern og rusomsorg Kan bygge relasjoner med fagfeller og pasienter/brukere og ivareta brukermedvirkning"
      }
    },
    {
      "id": "00HH14L EIHOPSF-H25",
      "title": "Praksis",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14L-EIHOPSF-H25/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: Setter teoretisk kunnskap fra utdanningen i sammenheng med praktiske ferdigheter i yrkespraksis og synliggjør egen kompetanse i forhold til andre rundt brukeren/beboeren/pasient/innsatt/pårørende/kollegaer/samarbeidspartnere Har kunnskap om faglige verktøy i arbeid med kartlegging av ressurser, behov, funksjonsnivå hos brukeren/beboeren/pasient/innsatt/pårørende/kollegaer/samarbeidspartnere Har kunnskap om verdier, målrettet kommunikasjon, og etiske prinsipper for å bygge gode relasjoner til brukeren/beboeren/pasient/innsatt/pårørende/kollegaer/samarbeidspartnere Har kunnskap om organisering av helsevesenet rundt brukeren/beboeren/pasient/innsatt/pårørende og kjennskap til ansvar og oppgaver for kollegaer og samarbeidspartnere rundt brukeren/beboeren/pasient/innsatt/pårørende",
        "skills": "Ferdigheter Studenten Kan anvende kunnskap om brukeren/beboeren/pasient/innsatt/pårørende, for å delta i behandling og oppfølging ut ifra deres individuelle behov og iverksette tiltak i samarbeid med andre fagpersoner i det tverrfaglige arbeidet Kan anvende observasjon for å delta i behandling og pleie til brukeren/beboeren/pasient/innsatt Kan anvende veiledning, undervisning og rådgivning i behandling av brukeren/beboeren/pasient/innsatt Kan anvende ulike kommunikasjonsformer, teknikker for å skape god samhandling og tillit, for å utvikle den andre og sin egen relasjons kompetanse Kan anvende ulike kommunikasjonsformer, teknikker for å informere og veilede ut ifra brukeren/beboeren/pasient/innsatte sitt kognitive nivå",
        "competence": "Generell kompetanse Studenten Har utviklet en etisk grunnholdning som kommer til uttrykk ved at studenten ivaretar brukermedvirkning, brukeren/beboeren/pasient/innsatte sin integritet, og kan reflektere over egen praksis og begrunne sine vurderinger faglig, etisk og juridisk Kan utføre behandling og omsorg til brukeren/ beboeren/ pasient/ innsatt/ (omsorg-pårørende) ut ifra den enkeltes individuelle behov i samarbeid med annet helsepersonell Kan bygge relasjoner med kollegaer og andre faggrupper, for å kvalitetssikre og videreutvikle sin kompetanse i praksis"
      }
    },
    {
      "id": "00HH14I EIHOPSF-H25",
      "title": "Fagspesifikk kunnskap om brukergrupper",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14I-EIHOPSF-H25/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten Har kunnskap om psykiske lidelser og ruslidelser og hvordan disse kan forebygges og behandles. Har innsikt i nasjonale planer, retningslinjer og anbefalinger knyttet til psykisk helsearbeid og rusarbeid. Har kunnskap om faglige verktøy for kartlegging av lidelser, skade, rapportering, behandling og tiltaksplaner. Har innsikt i prosedyrer og retningslinjer som er knyttet opp mot arbeid med den psykisk syke, rusavhengige og deres pårørende. Kan oppdatere sin kunnskap om behandlingsmetoder, hjelpemidler og tilpasning av omgivelser slik at den psykisk syke og rusavhengige kan oppleve selvstendighet og mestringsfølelse i bedringsprosessen.",
        "skills": "Ferdigheter Studenten Kan anvende faglig kunnskap og observasjon i sitt miljøarbeid ved å veilede den psykisk syke, rusavhengige eller deres pårørende Kan anvende ulike helsefremmende og forebyggende tiltak i samarbeid med pasient/bruker, pårørende og fagpersoner i behandlingsforløpet. Kan kartlegge situasjoner og identifisere, innen sitt kompetanseområde, pasienter/ brukere med psykiske lidelser og/ eller ruslidelser sitt behov for behandling og oppfølging.",
        "competence": "Generell kompetanse Studenten Kan finne, bruke og henvise til fagstoff som er relevant i psykisk helsearbeid og rusarbeid. Kan utvikle arbeidsmetoder og tjenester innen fagfeltet psykisk helsearbeid og rusarbeid gjennom oppdatering av kunnskap, erfarings- og kunnskapsdeling, miljøterapisamlinger og veiledningstimer."
      }
    },
    {
      "id": "00HH14J EIHOPSF-H25",
      "title": "Behandlingstiltak, oppfølging og koordinering",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14J-EIHOPSF-H25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten Har kunnskap om metoder/tiltak innenfor behandling/oppfølging i ulike pasientforløp og innsikt i ulike aktørers roller og ansvar Har kunnskap om tverrfaglig og flerfaglig samarbeid, og innsikt i saksbehandling og koordinering av helsetjenester Har kunnskap om familieomsorg, frivillig arbeid, selvhjelpsgrupper og lavterskel tilbud. Kan oppdatere sin kunnskap om tilbudene til mennesker med psykiske lidelser og ruslidelser, i kommunal helse‐ og omsorgstjeneste og spesialisthelsetjeneste. Har kunnskap om legemiddelassistert rehabilitering",
        "skills": "Ferdigheter Studenten Kan kartlegge en situasjon og identifisere behov, tilrettelegge og iverksette tiltak som skaper læring og mestring. Kan anvende ulike kommunikasjonsferdigheter og teknikker, motiverende intervju og endringsfokusert rådgivning Kan anvende faglig kunnskap til å utføre ulike miljøarbeid ut i fra den enkeltes behov for veiledning, tilrettelegging og behandling Kan kartlegge en situasjon og identifisere faglige problemstillinger ut fra observasjoner. Kan anvende IKT i dokumentasjon og rapportering i helse- og omsorgssektoren.",
        "competence": "Generell kompetanse Studenten Kan bygge relasjoner med kollegaer, på tvers av seksjoner og etater i samarbeid om tjenestetilbudet i psykisk helsearbeid og rusarbeid innen eget kompetanseområde. Kan utvikle arbeidsmetoder og tjenester innen fagfeltet psykisk helsearbeid og rusarbeid gjennom oppdatering av kunnskap, erfarings- og kunnskapsdeling, miljøterapisamlinger og veiledningstimer"
      }
    },
    {
      "id": "01HH00B EIHOPSF-H25",
      "title": "Fordypningsoppgave",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00B-EIHOPSF-H25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten Har kunnskap om prosjekt som arbeidsmetode for å løse utfordringer i yrkesfeltet psykisk helsearbeid og rusarbeid. Har kunnskap innenfor et selvvalgt fordypningstema innen fagfeltet psykisk helsearbeid og rusarbeid Forstår miljøarbeiderens betydning i yrkesfeltet og kan drøfte sammenhengen mellom teori og praksis innen fagfeltet psykisk helsearbeid og rusarbeid Har innsikt i relevante lover, forskrifter og planverk som gjelder fagfeltet psykisk helsearbeid og rusarbeid.",
        "skills": "Ferdigheter Studenten Kan kartlegge en situasjon innenfor fagfeltet psykisk helsearbeid og rusarbeid, identifisere en faglig problemstilling og behov for iverksetting av tiltak Kan finne informasjon og fagstoff som er relevant for fordypningsoppgavens problemstilling Kan anvende faglig kunnskap innen fagfeltet psykisk helsearbeid og rusarbeid på en teoretisk problemstilling",
        "competence": "Generell kompetanse Studenten Har utviklet en etisk grunnholdning og er bevisst sin profesjonelle kompetanse i utøvelsen av arbeidet innen fagfeltet psykisk helsearbeid og rusarbeid. Kan utføre arbeidet etter utvalgte målgrupper innen fagfeltet psykisk helsearbeid og rusarbeid Har forståelse for yrkesetiske prinsipper i sitt arbeid i innenfor fagfeltet psykisk helsearbeid og rusarbeid og etiske retningslinjer i forhold til skriftlige arbeider kan bygge relasjoner med medstudenter og samarbeide om hovedprosjektet i grupper"
      }
    },
    {
      "id": "01HH00A EIHOPSF-H25",
      "title": "Etikk, samhandling og kommunikasjon",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00A-EIHOPSF-H25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: Har kunnskap om menneskesyn, menneskerettigheter, yrkesetiske prinsipper og retningslinjer, og etisk refleksjon knyttet til arbeid i helse- og omsorgssektoren Har innsikt i lover og forskrifter som regulerer pasient- og brukerrettigheter, helsepersonells ansvar og plikter, og kvaliteten på tjenestetilbud på kommunalt, regionalt og statlig nivå Har kunnskap om kommunikasjonsteori, -teknikker og -former, samhandling og konflikthåndtering knyttet til arbeid i helse- og omsorgssektoren Har kunnskap om samfunnets og velferdsstatens utvikling, og om helse- og sosialpolitiske prioriteringer Har kunnskap om begreper innen sosiologi og psykologi knyttet til enkeltindividet, familien og sosialt nettverk",
        "skills": "Ferdigheter Studenten: Kan anvende kunnskap om menneskesyn, menneskerettigheter, yrkesetiske prinsipper og retningslinjer, til etisk refleksjon rundt praktiske og teoretiske problemstillinger i helse- og omsorgssektoren Kan anvende kunnskap om kommunikasjonsteori, -teknikker og -former, til å samhandle profesjonelt med brukere, pårørende, frivillige og kollegaer, og til å forebygge og håndtere konflikter Kan anvende kunnskap om kvalitetssikring og internkontroll til å delta i kvalitetsarbeid på arbeidsplassen Kan anvende kunnskap innen sosiologi og psykologi til å motivere brukeren slik at han eller hun tar i bruk egne ressurser og opplever mestring Kan finne fagstoff og anvende kunnskap om læring, studieteknikk og arbeidsformer til å løse oppgaver i studiet",
        "competence": "Generell kompetanse Studenten Har forståelse for yrkesetiske retningslinjer som regulerer yrkesutøvelsen innenfor helse- og omsorgstjenesten Har utviklet en etisk grunnholdning som kommer til uttrykk gjennom refleksjon over egen atferd og kommunikasjon i situasjoner med brukere, pårørende og kollegaer Kan utføre arbeidet med utgangspunkt i brukerens perspektiv, i tråd med prinsipper om brukermedvirkning og respekt for enkeltindividets verdi og verdighet Kan bygge relasjoner basert på likeverdighet og respekt, slik at brukere og pårørende opplever trygghet og har tillit til tjenestetilbudet Kan utføre arbeidet etter arbeidsplassens HMS- rutiner for kvalitetssikring og internkontroll"
      }
    },
    {
      "id": "00HH14H EIHOPSF-H25",
      "title": "Helsefremmende og forebyggende arbeid",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14H-EIHOPSF-H25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: Har kunnskap om hva som fremmer og hemmer god helse i ulike livsfaser for mennesker med psykiske lidelser og ruslidelser. Har kunnskap om forebyggende arbeid blant barn og unge Har kunnskap om psykiske lidelser og ruslidelser i et helhets og samfunnsperspektiv",
        "skills": "Ferdigheter Studenten: Kan anvende ulike kommunikasjonsformer for å oppnå tillit, og brukermedvirkning, Kan anvende ulike kommunikasjonsformer og teknikker for å unngå krenkelser som tvang og maktbruk Kan anvende sin kunnskap i samarbeidet med bruker/pasient, pårørende og fagpersoner, Kan identifisere ressurser og problemer hos pasienten/ brukeren og i dennes miljø, Kan kartlegge, vurdere behov og iverksette tiltak for å fremme helse, forebygge problemutvikling, sykdom og funksjonsnedsettelse og behovet for meningsfull aktivitet for bruker/pasient.",
        "competence": "Generell kompetanse Studenten: Kan utføre sitt arbeid i tråd med yrkesetiske retningslinjer og lovverket innen psykisk helsevern og rusomsorgen Har utviklet en etisk grunnholdning og reflekterer over egne holdninger i utøvelsen av helsefremmende og forebyggende arbeid innen psykisk helsevern og rusomsorg Kan bygge relasjoner med fagfeller og pasienter/brukere og ivareta brukermedvirkning"
      }
    },
    {
      "id": "00HH14L EIHOPSF-H25",
      "title": "Praksis",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14L-EIHOPSF-H25/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: Setter teoretisk kunnskap fra utdanningen i sammenheng med praktiske ferdigheter i yrkespraksis og synliggjør egen kompetanse i forhold til andre rundt brukeren/beboeren/pasient/innsatt/pårørende/kollegaer/samarbeidspartnere Har kunnskap om faglige verktøy i arbeid med kartlegging av ressurser, behov, funksjonsnivå hos brukeren/beboeren/pasient/innsatt/pårørende/kollegaer/samarbeidspartnere Har kunnskap om verdier, målrettet kommunikasjon, og etiske prinsipper for å bygge gode relasjoner til brukeren/beboeren/pasient/innsatt/pårørende/kollegaer/samarbeidspartnere Har kunnskap om organisering av helsevesenet rundt brukeren/beboeren/pasient/innsatt/pårørende og kjennskap til ansvar og oppgaver for kollegaer og samarbeidspartnere rundt brukeren/beboeren/pasient/innsatt/pårørende",
        "skills": "Ferdigheter Studenten Kan anvende kunnskap om brukeren/beboeren/pasient/innsatt/pårørende, for å delta i behandling og oppfølging ut ifra deres individuelle behov og iverksette tiltak i samarbeid med andre fagpersoner i det tverrfaglige arbeidet Kan anvende observasjon for å delta i behandling og pleie til brukeren/beboeren/pasient/innsatt Kan anvende veiledning, undervisning og rådgivning i behandling av brukeren/beboeren/pasient/innsatt Kan anvende ulike kommunikasjonsformer, teknikker for å skape god samhandling og tillit, for å utvikle den andre og sin egen relasjons kompetanse Kan anvende ulike kommunikasjonsformer, teknikker for å informere og veilede ut ifra brukeren/beboeren/pasient/innsatte sitt kognitive nivå",
        "competence": "Generell kompetanse Studenten Har utviklet en etisk grunnholdning som kommer til uttrykk ved at studenten ivaretar brukermedvirkning, brukeren/beboeren/pasient/innsatte sin integritet, og kan reflektere over egen praksis og begrunne sine vurderinger faglig, etisk og juridisk Kan utføre behandling og omsorg til brukeren/ beboeren/ pasient/ innsatt/ (omsorg-pårørende) ut ifra den enkeltes individuelle behov i samarbeid med annet helsepersonell Kan bygge relasjoner med kollegaer og andre faggrupper, for å kvalitetssikre og videreutvikle sin kompetanse i praksis"
      }
    },
    {
      "id": "00HH14I EIHOPSF-H25",
      "title": "Fagspesifikk kunnskap om brukergrupper",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14I-EIHOPSF-H25/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten Har kunnskap om psykiske lidelser og ruslidelser og hvordan disse kan forebygges og behandles. Har innsikt i nasjonale planer, retningslinjer og anbefalinger knyttet til psykisk helsearbeid og rusarbeid. Har kunnskap om faglige verktøy for kartlegging av lidelser, skade, rapportering, behandling og tiltaksplaner. Har innsikt i prosedyrer og retningslinjer som er knyttet opp mot arbeid med den psykisk syke, rusavhengige og deres pårørende. Kan oppdatere sin kunnskap om behandlingsmetoder, hjelpemidler og tilpasning av omgivelser slik at den psykisk syke og rusavhengige kan oppleve selvstendighet og mestringsfølelse i bedringsprosessen.",
        "skills": "Ferdigheter Studenten Kan anvende faglig kunnskap og observasjon i sitt miljøarbeid ved å veilede den psykisk syke, rusavhengige eller deres pårørende Kan anvende ulike helsefremmende og forebyggende tiltak i samarbeid med pasient/bruker, pårørende og fagpersoner i behandlingsforløpet. Kan kartlegge situasjoner og identifisere, innen sitt kompetanseområde, pasienter/ brukere med psykiske lidelser og/ eller ruslidelser sitt behov for behandling og oppfølging.",
        "competence": "Generell kompetanse Studenten Kan finne, bruke og henvise til fagstoff som er relevant i psykisk helsearbeid og rusarbeid. Kan utvikle arbeidsmetoder og tjenester innen fagfeltet psykisk helsearbeid og rusarbeid gjennom oppdatering av kunnskap, erfarings- og kunnskapsdeling, miljøterapisamlinger og veiledningstimer."
      }
    },
    {
      "id": "00HH14J EIHOPSF-H25",
      "title": "Behandlingstiltak, oppfølging og koordinering",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14J-EIHOPSF-H25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten Har kunnskap om metoder/tiltak innenfor behandling/oppfølging i ulike pasientforløp og innsikt i ulike aktørers roller og ansvar Har kunnskap om tverrfaglig og flerfaglig samarbeid, og innsikt i saksbehandling og koordinering av helsetjenester Har kunnskap om familieomsorg, frivillig arbeid, selvhjelpsgrupper og lavterskel tilbud. Kan oppdatere sin kunnskap om tilbudene til mennesker med psykiske lidelser og ruslidelser, i kommunal helse‐ og omsorgstjeneste og spesialisthelsetjeneste. Har kunnskap om legemiddelassistert rehabilitering",
        "skills": "Ferdigheter Studenten Kan kartlegge en situasjon og identifisere behov, tilrettelegge og iverksette tiltak som skaper læring og mestring. Kan anvende ulike kommunikasjonsferdigheter og teknikker, motiverende intervju og endringsfokusert rådgivning Kan anvende faglig kunnskap til å utføre ulike miljøarbeid ut i fra den enkeltes behov for veiledning, tilrettelegging og behandling Kan kartlegge en situasjon og identifisere faglige problemstillinger ut fra observasjoner. Kan anvende IKT i dokumentasjon og rapportering i helse- og omsorgssektoren.",
        "competence": "Generell kompetanse Studenten Kan bygge relasjoner med kollegaer, på tvers av seksjoner og etater i samarbeid om tjenestetilbudet i psykisk helsearbeid og rusarbeid innen eget kompetanseområde. Kan utvikle arbeidsmetoder og tjenester innen fagfeltet psykisk helsearbeid og rusarbeid gjennom oppdatering av kunnskap, erfarings- og kunnskapsdeling, miljøterapisamlinger og veiledningstimer"
      }
    },
    {
      "id": "01HH00B EIHOPSF-H25",
      "title": "Fordypningsoppgave",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00B-EIHOPSF-H25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten Har kunnskap om prosjekt som arbeidsmetode for å løse utfordringer i yrkesfeltet psykisk helsearbeid og rusarbeid. Har kunnskap innenfor et selvvalgt fordypningstema innen fagfeltet psykisk helsearbeid og rusarbeid Forstår miljøarbeiderens betydning i yrkesfeltet og kan drøfte sammenhengen mellom teori og praksis innen fagfeltet psykisk helsearbeid og rusarbeid Har innsikt i relevante lover, forskrifter og planverk som gjelder fagfeltet psykisk helsearbeid og rusarbeid.",
        "skills": "Ferdigheter Studenten Kan kartlegge en situasjon innenfor fagfeltet psykisk helsearbeid og rusarbeid, identifisere en faglig problemstilling og behov for iverksetting av tiltak Kan finne informasjon og fagstoff som er relevant for fordypningsoppgavens problemstilling Kan anvende faglig kunnskap innen fagfeltet psykisk helsearbeid og rusarbeid på en teoretisk problemstilling",
        "competence": "Generell kompetanse Studenten Har utviklet en etisk grunnholdning og er bevisst sin profesjonelle kompetanse i utøvelsen av arbeidet innen fagfeltet psykisk helsearbeid og rusarbeid. Kan utføre arbeidet etter utvalgte målgrupper innen fagfeltet psykisk helsearbeid og rusarbeid Har forståelse for yrkesetiske prinsipper i sitt arbeid i innenfor fagfeltet psykisk helsearbeid og rusarbeid og etiske retningslinjer i forhold til skriftlige arbeider kan bygge relasjoner med medstudenter og samarbeide om hovedprosjektet i grupper"
      }
    },
    {
      "id": "01HH00A EIHOPSF-H25",
      "title": "Etikk, samhandling og kommunikasjon",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00A-EIHOPSF-H25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: Har kunnskap om menneskesyn, menneskerettigheter, yrkesetiske prinsipper og retningslinjer, og etisk refleksjon knyttet til arbeid i helse- og omsorgssektoren Har innsikt i lover og forskrifter som regulerer pasient- og brukerrettigheter, helsepersonells ansvar og plikter, og kvaliteten på tjenestetilbud på kommunalt, regionalt og statlig nivå Har kunnskap om kommunikasjonsteori, -teknikker og -former, samhandling og konflikthåndtering knyttet til arbeid i helse- og omsorgssektoren Har kunnskap om samfunnets og velferdsstatens utvikling, og om helse- og sosialpolitiske prioriteringer Har kunnskap om begreper innen sosiologi og psykologi knyttet til enkeltindividet, familien og sosialt nettverk",
        "skills": "Ferdigheter Studenten: Kan anvende kunnskap om menneskesyn, menneskerettigheter, yrkesetiske prinsipper og retningslinjer, til etisk refleksjon rundt praktiske og teoretiske problemstillinger i helse- og omsorgssektoren Kan anvende kunnskap om kommunikasjonsteori, -teknikker og -former, til å samhandle profesjonelt med brukere, pårørende, frivillige og kollegaer, og til å forebygge og håndtere konflikter Kan anvende kunnskap om kvalitetssikring og internkontroll til å delta i kvalitetsarbeid på arbeidsplassen Kan anvende kunnskap innen sosiologi og psykologi til å motivere brukeren slik at han eller hun tar i bruk egne ressurser og opplever mestring Kan finne fagstoff og anvende kunnskap om læring, studieteknikk og arbeidsformer til å løse oppgaver i studiet",
        "competence": "Generell kompetanse Studenten Har forståelse for yrkesetiske retningslinjer som regulerer yrkesutøvelsen innenfor helse- og omsorgstjenesten Har utviklet en etisk grunnholdning som kommer til uttrykk gjennom refleksjon over egen atferd og kommunikasjon i situasjoner med brukere, pårørende og kollegaer Kan utføre arbeidet med utgangspunkt i brukerens perspektiv, i tråd med prinsipper om brukermedvirkning og respekt for enkeltindividets verdi og verdighet Kan bygge relasjoner basert på likeverdighet og respekt, slik at brukere og pårørende opplever trygghet og har tillit til tjenestetilbudet Kan utføre arbeidet etter arbeidsplassens HMS- rutiner for kvalitetssikring og internkontroll"
      }
    },
    {
      "id": "00HH14H EIHOPSF-H25",
      "title": "Helsefremmende og forebyggende arbeid",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14H-EIHOPSF-H25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: Har kunnskap om hva som fremmer og hemmer god helse i ulike livsfaser for mennesker med psykiske lidelser og ruslidelser. Har kunnskap om forebyggende arbeid blant barn og unge Har kunnskap om psykiske lidelser og ruslidelser i et helhets og samfunnsperspektiv",
        "skills": "Ferdigheter Studenten: Kan anvende ulike kommunikasjonsformer for å oppnå tillit, og brukermedvirkning, Kan anvende ulike kommunikasjonsformer og teknikker for å unngå krenkelser som tvang og maktbruk Kan anvende sin kunnskap i samarbeidet med bruker/pasient, pårørende og fagpersoner, Kan identifisere ressurser og problemer hos pasienten/ brukeren og i dennes miljø, Kan kartlegge, vurdere behov og iverksette tiltak for å fremme helse, forebygge problemutvikling, sykdom og funksjonsnedsettelse og behovet for meningsfull aktivitet for bruker/pasient.",
        "competence": "Generell kompetanse Studenten: Kan utføre sitt arbeid i tråd med yrkesetiske retningslinjer og lovverket innen psykisk helsevern og rusomsorgen Har utviklet en etisk grunnholdning og reflekterer over egne holdninger i utøvelsen av helsefremmende og forebyggende arbeid innen psykisk helsevern og rusomsorg Kan bygge relasjoner med fagfeller og pasienter/brukere og ivareta brukermedvirkning"
      }
    },
    {
      "id": "00HH14L EIHOPSF-H25",
      "title": "Praksis",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14L-EIHOPSF-H25/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten: Setter teoretisk kunnskap fra utdanningen i sammenheng med praktiske ferdigheter i yrkespraksis og synliggjør egen kompetanse i forhold til andre rundt brukeren/beboeren/pasient/innsatt/pårørende/kollegaer/samarbeidspartnere Har kunnskap om faglige verktøy i arbeid med kartlegging av ressurser, behov, funksjonsnivå hos brukeren/beboeren/pasient/innsatt/pårørende/kollegaer/samarbeidspartnere Har kunnskap om verdier, målrettet kommunikasjon, og etiske prinsipper for å bygge gode relasjoner til brukeren/beboeren/pasient/innsatt/pårørende/kollegaer/samarbeidspartnere Har kunnskap om organisering av helsevesenet rundt brukeren/beboeren/pasient/innsatt/pårørende og kjennskap til ansvar og oppgaver for kollegaer og samarbeidspartnere rundt brukeren/beboeren/pasient/innsatt/pårørende",
        "skills": "Ferdigheter Studenten Kan anvende kunnskap om brukeren/beboeren/pasient/innsatt/pårørende, for å delta i behandling og oppfølging ut ifra deres individuelle behov og iverksette tiltak i samarbeid med andre fagpersoner i det tverrfaglige arbeidet Kan anvende observasjon for å delta i behandling og pleie til brukeren/beboeren/pasient/innsatt Kan anvende veiledning, undervisning og rådgivning i behandling av brukeren/beboeren/pasient/innsatt Kan anvende ulike kommunikasjonsformer, teknikker for å skape god samhandling og tillit, for å utvikle den andre og sin egen relasjons kompetanse Kan anvende ulike kommunikasjonsformer, teknikker for å informere og veilede ut ifra brukeren/beboeren/pasient/innsatte sitt kognitive nivå",
        "competence": "Generell kompetanse Studenten Har utviklet en etisk grunnholdning som kommer til uttrykk ved at studenten ivaretar brukermedvirkning, brukeren/beboeren/pasient/innsatte sin integritet, og kan reflektere over egen praksis og begrunne sine vurderinger faglig, etisk og juridisk Kan utføre behandling og omsorg til brukeren/ beboeren/ pasient/ innsatt/ (omsorg-pårørende) ut ifra den enkeltes individuelle behov i samarbeid med annet helsepersonell Kan bygge relasjoner med kollegaer og andre faggrupper, for å kvalitetssikre og videreutvikle sin kompetanse i praksis"
      }
    },
    {
      "id": "00HH14I EIHOPSF-H25",
      "title": "Fagspesifikk kunnskap om brukergrupper",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14I-EIHOPSF-H25/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten Har kunnskap om psykiske lidelser og ruslidelser og hvordan disse kan forebygges og behandles. Har innsikt i nasjonale planer, retningslinjer og anbefalinger knyttet til psykisk helsearbeid og rusarbeid. Har kunnskap om faglige verktøy for kartlegging av lidelser, skade, rapportering, behandling og tiltaksplaner. Har innsikt i prosedyrer og retningslinjer som er knyttet opp mot arbeid med den psykisk syke, rusavhengige og deres pårørende. Kan oppdatere sin kunnskap om behandlingsmetoder, hjelpemidler og tilpasning av omgivelser slik at den psykisk syke og rusavhengige kan oppleve selvstendighet og mestringsfølelse i bedringsprosessen.",
        "skills": "Ferdigheter Studenten Kan anvende faglig kunnskap og observasjon i sitt miljøarbeid ved å veilede den psykisk syke, rusavhengige eller deres pårørende Kan anvende ulike helsefremmende og forebyggende tiltak i samarbeid med pasient/bruker, pårørende og fagpersoner i behandlingsforløpet. Kan kartlegge situasjoner og identifisere, innen sitt kompetanseområde, pasienter/ brukere med psykiske lidelser og/ eller ruslidelser sitt behov for behandling og oppfølging.",
        "competence": "Generell kompetanse Studenten Kan finne, bruke og henvise til fagstoff som er relevant i psykisk helsearbeid og rusarbeid. Kan utvikle arbeidsmetoder og tjenester innen fagfeltet psykisk helsearbeid og rusarbeid gjennom oppdatering av kunnskap, erfarings- og kunnskapsdeling, miljøterapisamlinger og veiledningstimer."
      }
    },
    {
      "id": "00HH14J EIHOPSF-H25",
      "title": "Behandlingstiltak, oppfølging og koordinering",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/00HH14J-EIHOPSF-H25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten Har kunnskap om metoder/tiltak innenfor behandling/oppfølging i ulike pasientforløp og innsikt i ulike aktørers roller og ansvar Har kunnskap om tverrfaglig og flerfaglig samarbeid, og innsikt i saksbehandling og koordinering av helsetjenester Har kunnskap om familieomsorg, frivillig arbeid, selvhjelpsgrupper og lavterskel tilbud. Kan oppdatere sin kunnskap om tilbudene til mennesker med psykiske lidelser og ruslidelser, i kommunal helse‐ og omsorgstjeneste og spesialisthelsetjeneste. Har kunnskap om legemiddelassistert rehabilitering",
        "skills": "Ferdigheter Studenten Kan kartlegge en situasjon og identifisere behov, tilrettelegge og iverksette tiltak som skaper læring og mestring. Kan anvende ulike kommunikasjonsferdigheter og teknikker, motiverende intervju og endringsfokusert rådgivning Kan anvende faglig kunnskap til å utføre ulike miljøarbeid ut i fra den enkeltes behov for veiledning, tilrettelegging og behandling Kan kartlegge en situasjon og identifisere faglige problemstillinger ut fra observasjoner. Kan anvende IKT i dokumentasjon og rapportering i helse- og omsorgssektoren.",
        "competence": "Generell kompetanse Studenten Kan bygge relasjoner med kollegaer, på tvers av seksjoner og etater i samarbeid om tjenestetilbudet i psykisk helsearbeid og rusarbeid innen eget kompetanseområde. Kan utvikle arbeidsmetoder og tjenester innen fagfeltet psykisk helsearbeid og rusarbeid gjennom oppdatering av kunnskap, erfarings- og kunnskapsdeling, miljøterapisamlinger og veiledningstimer"
      }
    },
    {
      "id": "01HH00B EIHOPSF-H25",
      "title": "Fordypningsoppgave",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00B-EIHOPSF-H25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap Studenten Har kunnskap om prosjekt som arbeidsmetode for å løse utfordringer i yrkesfeltet psykisk helsearbeid og rusarbeid. Har kunnskap innenfor et selvvalgt fordypningstema innen fagfeltet psykisk helsearbeid og rusarbeid Forstår miljøarbeiderens betydning i yrkesfeltet og kan drøfte sammenhengen mellom teori og praksis innen fagfeltet psykisk helsearbeid og rusarbeid Har innsikt i relevante lover, forskrifter og planverk som gjelder fagfeltet psykisk helsearbeid og rusarbeid.",
        "skills": "Ferdigheter Studenten Kan kartlegge en situasjon innenfor fagfeltet psykisk helsearbeid og rusarbeid, identifisere en faglig problemstilling og behov for iverksetting av tiltak Kan finne informasjon og fagstoff som er relevant for fordypningsoppgavens problemstilling Kan anvende faglig kunnskap innen fagfeltet psykisk helsearbeid og rusarbeid på en teoretisk problemstilling",
        "competence": "Generell kompetanse Studenten Har utviklet en etisk grunnholdning og er bevisst sin profesjonelle kompetanse i utøvelsen av arbeidet innen fagfeltet psykisk helsearbeid og rusarbeid. Kan utføre arbeidet etter utvalgte målgrupper innen fagfeltet psykisk helsearbeid og rusarbeid Har forståelse for yrkesetiske prinsipper i sitt arbeid i innenfor fagfeltet psykisk helsearbeid og rusarbeid og etiske retningslinjer i forhold til skriftlige arbeider kan bygge relasjoner med medstudenter og samarbeide om hovedprosjektet i grupper"
      }
    }
  ]
}