{
  "study_programs": [
    {
      "id": "Spesialisering i rehabilitering - 60",
      "title": "Spesialisering i rehabilitering",
      "description": "Spesialisering i rehabilitering er videreutdanningen for deg som ønsker trygghet og faglig fordypning i arbeidet med pasienter med funksjonsnedsettelse. Studiet gir deg kompetanse til å bidra aktivt i rehabiliteringsprosesser, styrke pasientens mestring og delta i tverrfaglig samarbeid i kommune- og spesialisthelsetjenesten.",
      "study_category": "Helse",
      "study_location": {
        "0": "Kongsberg"
      },
      "study_type": {
        "8": "Samlingsbasert 2 år"
      },
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Behovet for rehabilitering øker i takt med en aldrende befolkning, mer komplekse pasientforløp og tidligere utskriving fra sykehus. Samtidig forventes det at rehabilitering skjer nær der pasienten bor, og at flere yrkesgrupper tar et tydelig ansvar i oppfølgingen.\nDenne videreutdanningen er utviklet for deg som allerede jobber i helse- og omsorgstjenesten, og som ønsker å styrke din rolle i rehabiliteringsarbeidet. Studiet gir faglig fordypning i hvordan rehabilitering planlegges, gjennomføres og evalueres i praksis – i samarbeid med pasient, pårørende og andre faggrupper. Du får kompetanse som er direkte anvendbar i arbeidshverdagen, og som møter kravene i dagens helsetjenester.\nFor dette studiet er det krav om | politiattest | .",
      "what_learn": "Studiet gir deg en helhetlig forståelse av rehabilitering gjennom livsløpet, med vekt på funksjonsvurdering, kartlegging, målrettede tiltak og pasientens egen mestring. Du arbeider med sentrale temaer som sykdomslære, observasjon og tiltak, etikk, kommunikasjon og samhandling, samt bruk av velferdsteknologi i rehabiliteringsarbeidet.\nLæringen er praksisnær og knyttet til reelle situasjoner fra helse- og omsorgstjenesten. Du utvikler kompetanse i å delta aktivt i tverrfaglige team, bidra til riktig behandlingsnivå og følge opp pasienter i ulike rehabiliteringsforløp. Studiet avsluttes med en fordypningsoppgave der du arbeider med en problemstilling som er relevant for egen yrkesrolle og praksis.\nKlikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres som en nettbasert deltidsutdanning med samlinger over to år. Undervisningen kombinerer digitale læringsaktiviteter med samlinger som gir rom for praktisk arbeid, veiledning og faglig fordypning. Mellom samlingene arbeider du med oppgaver og læringsaktiviteter knyttet til egen arbeidshverdag. Endelig plan for samlinger og undervisning publiseres på studentsiden før oppstart. Obligatorisk oppmøte Studiet kan inneholde krav til obligatorisk deltakelse i undervisning, samlinger og læringsaktiviteter. For å få sluttvurdering i emnene må eventuelle oppmøtekrav være oppfylt. Nærmere informasjon om oppmøtekrav fremgår av emnebeskrivelsene og studieplanen. Praksis Studiet inneholder praksis. Praksis gjennomføres i tråd med studieplanen og har egne krav til oppmøte og gjennomføring. Nærmere informasjon om omfang, organisering og vurdering av praksis finner du i studieplanen. Politiattest Dette studiet krever gyldig politiattest for å kunne gjennomføre praksis. Du søker om politiattest når du har akseptert studieplassen. Les vår veiledning til hvordan du søker politiattest før du går videre til politiets nettsider for å sende søknaden.",
      "police_certificate": "Sjekk opptakskrav",
      "career_opportunities": "Med spesialisering i rehabilitering styrker du din faglige rolle i arbeidet med pasienter som har behov for målrettet oppfølging etter sykdom, skade eller funksjonsnedsettelse. Kompetansen brukes i rehabiliteringsavdelinger, sykehjem, helsehus, hjemmetjenester, frisklivssentraler og tverrfaglige rehabiliteringsteam . Videreutdanningen gir et faglig grunnlag for å ta større ansvar i rehabiliteringsprosesser, bidra til bedre samhandling mellom tjenester og delta aktivt i utviklingen av helhetlige og koordinerte pasientforløp.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/helse/spesialisering-i-rehabilitering"
    }
  ],
  "courses": []
}