{
  "study_programs": [
    {
      "id": "Språklig og kulturelt mangfold i oppvekstsektoren - 60",
      "title": "Språklig og kulturelt mangfold i oppvekstsektoren",
      "description": "Med full barnehagedekning går de aller fleste barn under skolealder i barnehage, og antallet minioritetspråkelige barn i barnehage er tredoblet siden 2005. Med dette deltidsstudiet får du kompetanse som er sterkt etterspurt i barnehagene og du blir en verdifull ressurs for barnehagens flerspråkelige barn.",
      "study_location": "Fredrikstad (Samlingsbasert 2 år) | Kjeller (Samlingsbasert 2 år) | Kongsberg (Samlingsbasert 2 år)",
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Studiet skal utdanne reflekterte yrkesutøvere med høy faglig og etisk kompetanse. De skal ha gode kunnskaper og ferdigheter om barn i alderen 0-6 år og deres situasjon og aktuelle utfordringer i dagens Norge. Barna og deres familier skal gis riktig hjelp og bistand til rett sted så tidlig som mulig. Det skal tilrettelegges slik at alle barn og unge hver dag har muligheten til å bli sett, satt krav til og oppleve gleden av å lykkes med noe. | For dette studiet er det krav om | politiattest | .",
      "what_learn": "Du får en helhetlig forståelse av språkutvikling 0–6 år, flerspråklighet og inkluderende pedagogikk, og lærer å omsette dette til god praksis i barnehagehverdagen. Studiet gir innsikt i etikk, kommunikasjon og samhandling, pedagogikk og didaktikk, planlegging, dokumentasjon og vurdering av språkstimulerende aktiviteter, samt hvordan mangfold, identitet og foreldresamarbeid styrker barnas språklige og sosiale utvikling. Du blir kjent med relevant lovverk, rammeplan og aktuelle samarbeidspartnere, og utvikler profesjonelle ferdigheter gjennom praksis og fordypningsoppgave. Utdanningen består av seks emner inkludert praksis. | Klikk på et emne for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger | Studiet gjennomføres som nettbasert deltidsutdanning med samlinger ved studiested Fredrikstad. Undervisningen kombinerer nettmøter på faste ukedager med fysiske samlinger flere ganger per semester. Mellom samlingene arbeider du med oppgaver, veiledning og refleksjon i læringsplattformen. Praksis inngår som en obligatorisk del av studiet og planlegges i samarbeid med skolen og praksisstedet. Tidspunkter, samlingsuker og detaljert fremdriftsplan publiseres på | studentsiden for Fredrikstad | før oppstart. | Obligatorisk oppmøte | Du må delta på minst | 75 % av de fysiske samlingene | for å få vurdert eksamen. Praksis har egne regler for oppmøte – se studieplanen for detaljer. Manglende oppmøte kan føre til at du ikke får fullført emnet. | Politiattest | Dette studiet krever | gyldig politiattest | før studiestart. Søk om politiattest når du har akseptert studieplassen. Les vår | veiledning til hvordan du søker politiattest | før du går videre til | politiets nettsider | for å sende søknaden.",
      "police_certificate": "Sjekk opptakskrav",
      "career_opportunities": "Studiet gir kompetanse som er nyttig og etterspurt innen mange typer helse- og oppveksttjenester, som f.eks barnehager, boliger og institusjoner for barn, skole, skolefritidsordning/aktivitetskole.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/barn-og-oppvekst/spraklig-og-kulturelt-mangfold-i-oppvekstsektoren"
    }
  ],
  "courses": [
    {
      "id": "01HH00A EIHOPSF-H25",
      "title": "Etikk, samhandling og kommunikasjon",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00A-EIHOPSF-H25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten: | Har kunnskap om menneskesyn, menneskerettigheter, yrkesetiske prinsipper og retningslinjer, og etisk refleksjon knyttet til arbeid i helse- og omsorgssektoren | Har innsikt i lover og forskrifter som regulerer pasient- og brukerrettigheter, helsepersonells ansvar og plikter, og kvaliteten på tjenestetilbud på kommunalt, regionalt og statlig nivå | Har kunnskap om kommunikasjonsteori, -teknikker og -former, samhandling og konflikthåndtering knyttet til arbeid i helse- og omsorgssektoren | Har kunnskap om samfunnets og velferdsstatens utvikling, og om helse- og sosialpolitiske prioriteringer | Har kunnskap om begreper innen sosiologi og psykologi knyttet til enkeltindividet, familien og sosialt nettverk",
        "skills": "Ferdigheter | Studenten: | Kan anvende kunnskap om menneskesyn, menneskerettigheter, yrkesetiske prinsipper og retningslinjer, til etisk refleksjon rundt praktiske og teoretiske problemstillinger i helse- og omsorgssektoren | Kan anvende kunnskap om kommunikasjonsteori, -teknikker og -former, til å samhandle profesjonelt med brukere, pårørende, frivillige og kollegaer, og til å forebygge og håndtere konflikter | Kan anvende kunnskap om kvalitetssikring og internkontroll til å delta i kvalitetsarbeid på arbeidsplassen | Kan anvende kunnskap innen sosiologi og psykologi til å motivere brukeren slik at han eller hun tar i bruk egne ressurser og opplever mestring | Kan finne fagstoff og anvende kunnskap om læring, studieteknikk og arbeidsformer til å løse oppgaver i studiet",
        "competence": "Generell kompetanse | Studenten | Har forståelse for yrkesetiske retningslinjer som regulerer yrkesutøvelsen innenfor helse- og omsorgstjenesten | Har utviklet en etisk grunnholdning som kommer til uttrykk gjennom refleksjon over egen atferd og kommunikasjon i situasjoner med brukere, pårørende og kollegaer | Kan utføre arbeidet med utgangspunkt i brukerens perspektiv, i tråd med prinsipper om brukermedvirkning og respekt for enkeltindividets verdi og verdighet | Kan bygge relasjoner basert på likeverdighet og respekt, slik at brukere og pårørende opplever trygghet og har tillit til tjenestetilbudet | Kan utføre arbeidet etter arbeidsplassens HMS- rutiner for kvalitetssikring og internkontroll"
      }
    },
    {
      "id": "01HO03B EIHOASF-25",
      "title": "Pedagogikk og didaktikk",
      "credits": 10,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO03B-EIHOASF-25/2025-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om pedagogiske læringsteorier og didaktiske metoder. | har kunnskap om ulike tilnærminger til mangfold og flerkulturelt arbeid i barnehagen | har kunnskap om utviklingsteorier med vekt på flerkulturell pedagogikk og flerkulturell didaktikk. | har innsikt i relevante lover og styringsdokumenter for barnehagens innhold og oppgaver. | har kunnskap om ulike verktøy for observasjon/kartlegging, planlegging, dokumentasjon og vurdering i barnehagen. | har kunnskap om betydningen av motivasjon, sosial kompetanse og danningsprosesser for barns trivsel og helhetlige utvikling | har kunnskap om ulike former for lek, aktivitet samspill og læring",
        "skills": "Ferdigheter | Studenten | kan anvende kunnskap om pedagogikk og didaktikk i praktisk, pedagogisk arbeid i en mangfoldig/ flerkulturell barnehage. | kan anvende verktøy for observasjon/kartlegging, planlegging, dokumentasjon og vurdering av lek, læring og trivsel | kan finne informasjon og fagstoff som er relevant innenfor pedagogikk og didaktikk for barn. | kan kartlegge og identifisere barnehagens miljø- og det enkelte barns behov for nødvendige tiltak.",
        "competence": "Generell kompetanse | Studenten | har forståelse for hva som kjennetegner barn på ulike alderstrinn og variasjon i utviklingsforløp. | kan utføre pedagogisk arbeid tilpasset det enkelte barns og barnegruppenes sett ut ifra et mangfolds- og flerkulturelt perspektiv. | forstår eget yrkes betydning for barns trivsel og helhetlige utvikling i et livsløpsperspektiv | forstår voksenrollens betydning i barns lek og aktivitet. | kan utvikle didaktiske arbeidsmetoder med vekt på enkeltbarns- og barnegruppenes behov."
      }
    },
    {
      "id": "01HO03C EIHOASF-25",
      "title": "Arbeid med språk og flerspråklighet i barnehagen",
      "credits": 14,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO03C-EIHOASF-25/2026-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om språkutvikling og utvikling av andrespråket for barn 0-6 år. | har kunnskap om ulike former for språkstimulering og systematisk språkarbeid i barnehagen. | har kunnskap om språklige forsinkelser og språkvansker. | har kunnskap om planlegging, dokumentasjon og vurdering knyttet til språkarbeid i barnehagen. | har innsikt i relevante lover og styringsdokumenter for arbeid med språk i barnehagesektoren",
        "skills": "Ferdigheter | Studenten | kan anvende språkstimulerende aktiviteter. | kan anvende kunnskap om morsmål, første- og andrespråkligutvikling knyttet til systematisk språkarbeid i barnehagen. | kan anvende relevante verktøy for planlegging, dokumentasjon og vurdering av språkarbeidet i barnehagen. | kan kartlegge språkmiljøet, identifisere områder for forbedring og iverksette tiltak. | kan finne informasjon og fagstoff/ barnebøker som er relevant for systematisk språkarbeid i barnehagen.",
        "competence": "Generell kompetanse | Studenten | har forståelse for hvordan barn tilegner seg ett eller flere språk i samspill med omgivelsene. | har utviklet en etisk grunnholdning i møte med barn og foreldre med ulik språklig og kulturell bakgrunn. | har forståelse for flerspråklighet som en ressurs. | kan bygge relasjoner og samarbeide med ressurspersoner i og utenfor barnehagen. | kan utføre ulike språkstimulerende tiltak i et flerkulturelt perspektiv. | kan oppdatere sin kunnskap om språkets betydning for barns trivsel og helhetlige utvikling. | kan oppdatere sin kunnskap om arbeid med språk og utvikling av andrespråket i barnehagen"
      }
    },
    {
      "id": "01HO03D EIHOASF-25",
      "title": "Flerkulturell kompetanse",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO03D-EIHOASF-25/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om relevante begreper innen temaet flerkulturell kompetanse i barnehagen. | har kunnskap om barns identitetsutvikling. | har kunnskap om betydningen av foreldresamarbeid har for barnets trivsel og helhetlige utvikling. | har innsikt i relevante lover og styringsdokumenter for arbeid med flerkulturell kompetanse i barnehagesektoren. | kan oppdatere sin kunnskap om arbeid med mangfold i barnehagen. | forstår egen betydning i arbeidet med å fremme mangfold i et ressursperspektiv.",
        "skills": "Ferdigheter | Studenten | kan anvende kunnskap om flerkulturelt arbeid knyttet til praktiske problemstillinger på egen arbeidsplass. | kan anvende kunnskap om mangfold som ressurs i møte med foreldre. | kan finne informasjon og fagstoff knyttet til temaet flerkulturelt arbeid i barnehagen. | kan kartlegge og identifisere flerkulturell praksis på egen arbeidsplass.",
        "competence": "Generell kompetanse | Studenten | har forståelse for språklig, religiøst og kulturelt mangfold som verdi og ressurs i dagens samfunn. | har utviklet en etisk grunnholdning i møte med barn, foreldre og kollegaer i en flerkulturell barnehage. | kan bygge relasjoner og samarbeide med ressurspersoner i og utenfor barnehagen. | kan utvikle arbeidsmetoder som støtter opp under arbeidet i den flerkulturelle barnehagen. | kan utføre arbeid som fremmer mangfold ut fra barnegruppens- og enkeltbarns behov."
      }
    },
    {
      "id": "01HO03F EIHOASF-25",
      "title": "Praksis",
      "credits": 12,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HO03F-EIHOASF-25/2026-host",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | har kunnskap om prosjekt- og utviklingsarbeid rettet mot språk, flerspråklighet og flerkulturell kompetanse i barnehagen. | har kunnskap om språk, flerspråklighet og flerkulturelt arbeid for barn i barnehagen. | har kunnskap om relevant verktøy for planlegging, dokumentasjon og vurdering i arbeid med språk, flerspråklighet og flerkulturell kompetanse. | har kunnskap om barnehagens rammer og forutsetninger når det gjelder arbeid med språk, flerspråklighet og flerkulturell kompetanse. | har innsikt i relevant lovverk og styringsdokumenter for barnehagen i arbeid med språk, flerspråklighet og flerkulturell kompetanse.",
        "skills": "Ferdigheter | Studenten | kan anvende krav til prosjektarbeid rettet mot arbeid med språk, flerspråklighet og flerkulturell kompetanse. | kan anvende kunnskap om språk- og flerspråklig arbeid i barnehagen. | kan anvende kunnskap om mangfold som ressurs i barnehagen. | kan kartlegge barnehagens miljø, knyttet til emner fra studieplanen når det gjelder språk, språklighet og flerkulturell kompetanse. | kan finne informasjon og fagstoff rettet mot arbeid med språk, språklighet og flerkulturell kompetanse i barnehagen | kan anvende relevante verktøy for observasjon, kartlegging, planlegging, dokumentasjon og vurdering av språk, flerspråklighet og flerkulturell kompetanse i barnehagen.",
        "competence": "Generell kompetanse | Studenten | har forståelse for yrkesetiske prinsipper i arbeidet med språk, flerspråklighet og flerkulturelt arbeid i barnehagen. | har utviklet en etisk grunnholdning til arbeid i barnehagen i møte med kollegaer, barn og foreldre. | kan bygge relasjoner, inkludere og samarbeide med foreldre, kollegaer og eventuelt andre ressurspersoner i barnehagen. | kan utvikle arbeidsmetoder gjennom kunnskapsdeling, veiledning og etisk refleksjon i barnehagen. | kan oppdatere sin kunnskap i praksisperioden knyttet til tema språk, flerspråklighet og flerkulturelt arbeid for barn 0-6 år."
      }
    },
    {
      "id": "01HH00B EIHOASF-25",
      "title": "Fordypningsoppgave",
      "credits": 8,
      "url": "https://studiekatalog.edutorium.no/viken/nb/emne/01HH00B-EIHOASF-25/2027-var",
      "study_level": "Fagskole nivå 5.1",
      "learning_outcomes": {
        "knowledge": "Kunnskap | Studenten | kan oppdatere sin kunnskap om språk, flerspråklighet og flerkulturelt arbeid som er relevant for arbeid i barnehagen. | har innsikt i relevante lover og styringsdokumenter som gjelder tema og problemstilling rettet mot arbeid i barnehagen.",
        "skills": "Ferdigheter | Studenten | kan kartlegge og identifisere en problemstilling knyttet til språk, flerspråklighet og flerkulturelt arbeid som danner grunnlag for arbeid i barnehage. | kan finne informasjon og fagstoff som er relevant for tema og problemstilling rettet mot arbeid i barnehagen. | kan anvende teoretisk kunnskap i praktiske problemstillinger rettet mot arbeid i barnehagen.",
        "competence": "Generell kompetanse | Studenten | har utviklet en etisk grunnholdning som gjenspeiler studiets ressursperspektiv på arbeid med språk, flerspråklighet og flerkulturell kompetanse i barnehagen | har forståelse for yrkesetiske prinsipper knyttet til dokumentasjon, personvern og anonymisering i oppgaveskriving og arbeid i barnehagen."
      }
    }
  ]
}