{
  "study_programs": [
    {
      "id": "Systemutvikling og programmering - 60",
      "title": "Systemutvikling og programmering",
      "description": "Systemutvikling og programmering er videreutdanningen for deg som ønsker praktisk og yrkesrettet kompetanse i utvikling av moderne programvareløsninger. Studiet gir deg et solid teknisk fundament for å planlegge, utvikle og sette i drift digitale systemer – i tråd med behovene i arbeidslivet.",
      "study_location": "Kongsberg (Samlingsbasert 2 år)",
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "Digitalisering preger alle deler av samfunnet, og behovet for utviklere med bred systemforståelse og praktisk kompetanse er stort. Virksomheter trenger fagpersoner som kan utvikle, videreutvikle og integrere digitale løsninger – fra programmering og databaser til systemarkitektur og samhandling i utviklingsteam.\nDenne videreutdanningen er utviklet i tett dialog med arbeidslivet og gir kompetanse som er direkte anvendbar i både privat og offentlig sektor. Studiet passer for | deg som ønsker å jobbe med utvikling av programvare og digitale løsninger | , og som vil styrke rollen din i utviklingsprosjekter – fra idé og krav til ferdig løsning i drift.",
      "what_learn": "Du bygger bred og praktisk kompetanse innen systemutvikling og programmering, med vekt på hele utviklingsløpet – fra idé og kravspesifikasjon til ferdig løsning i drift. Studiet dekker sentrale fagområder som programmering, databaser, IT-infrastruktur, systemarkitektur, prosjektarbeid og bruk av kunstig intelligens i programvareutvikling.\nLæringen er praksisnær og prosjektbasert, og tar utgangspunkt i reelle problemstillinger fra arbeidslivet. Du jobber både selvstendig og i team, og utvikler ferdigheter i samarbeid, dokumentasjon og faglig refleksjon. Studiet består av seks emner og avsluttes med et større prosjekt der du anvender kompetansen din i en helhetlig løsning.\nNedenfor kan du klikke på emnene for å lese mer om innholdet i hvert enkelt emne.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres som nettbasert deltidsutdanning med samlinger. Undervisningen kombinerer digitale læringsaktiviteter og samlinger, med vekt på praktisk anvendelse, problemløsning og prosjektarbeid. Samlingene holdes vanligvis flere ganger per semester og varer to til tre dager. Endelig plan for samlinger og undervisning publiseres på studentsiden før oppstart. Obligatorisk oppmøte Det kan være krav til oppmøte på samlinger og i enkelte læringsaktiviteter. For å få sluttvurdering i emnene må eventuelle oppmøtekrav være oppfylt. Nærmere informasjon finner du i studieplanen og emnebeskrivelsene.",
      "police_certificate": null,
      "career_opportunities": "Videreutdanningen gir kompetanse som kan brukes i en rekke roller innen IT- og teknologifeltet. Kompetansen er særlig relevant i arbeid med utvikling, drift og videreutvikling av digitale løsninger, der systemforståelse og praktiske ferdigheter er avgjørende. Utdanningen er relevant for arbeid som blant annet systemutvikler, programvareutvikler, applikasjonsutvikler, webutvikler, database- og integrasjonsressurs eller IT-konsulent. Kompetansen kan også brukes i prosjektroller der planlegging, samhandling og teknisk forståelse står sentralt, og gir et godt grunnlag for videre faglig utvikling i yrkesrollen.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/it-og-data/systemutvikling-og-programmering"
    }
  ],
  "courses": []
}