{
  "study_programs": [
    {
      "id": "Vedlikeholdsteknikk 4.0 - 10",
      "title": "Vedlikeholdsteknikk 4.0",
      "description": "Ny teknologi og nye måter å anvende teknologien på endrer produkter, forretningsmodeller, logistikk, produksjon og råvareutvinning. Med modulstudiet Vedlikeholdsteknikk 4.0 får du som har vedlikeholdsoppgaver innen tekniske industrielle vedlikeholdsfag, kompetanse som gjør deg bedre rustet til å møte arbeidslivets nye behov innen drift og vedlikehold.",
      "study_location": "Kjeller (Samlingsbasert ca. 12 uker)",
      "credits": 10,
      "language": "Norsk",
      "level": "Enkeltemne",
      "why_choose": "Arbeidslivet er i stor endringer, og kostnadsreduserende tiltak innen drift og vedlikehold vil ha stor betydning for en bedrifts suksess og overlevelsesevne. Vedlikeholdsteknikk 4.0 gir deg kompetanse for å møte endringene, og du får kunnskap om hvordan man må tenke nytt rundt samhandlingsformer på alle nivåer i organisasjonen.\nDette studiet er en del av | Industrifagskolen | .",
      "what_learn": "I dette enkeltemnet lærer du å analysere feil, planlegge tiltak og gjennomføre vedlikehold som øker driftssikkerhet og reduserer kostnader. Du jobber med feilsøking, tilstandsovervåkning, hydraulikk, automasjon, material- og reservedelsstyring, samt dokumentasjon og forbedringsarbeid. Du får også innsikt i vedlikeholdsstrategier, terminologi og standarder, og hvordan data og IKT brukes i Vedlikehold 4.0.\nEmnet består av tre hovedtemaer som tilsammen utgjør 10 studiepoeng, klikk på temaene her for å lese mer hva du lærer.",
      "teaching_format": null,
      "mandatory_attendance": "Undervisning og samlinger Emnet gjennomføres nettbasert med fysiske samlinger . Læringen kombinerer forelesninger, oppgaveløsning, veiledning og praksisnære case i grupper og individuelt. Samlingene brukes til laboratoriearbeid, øvelser og presentasjoner, mens nettundervisningen bygger progresjon mellom samlingene. Det er ikke planlagt oppstart av dette studiet studieåret 2025/2026. Om du synes dette studiet virker interessant og ønsker å bli oppdatert om det blir nye oppstart, kan du melde din interesse for dette studiet .",
      "police_certificate": null,
      "career_opportunities": null,
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Utdanningsleder: | Jøran Bergerud – e-post: | joranbe@afk.no | Du kan også | melde din interesse i dette skjemaet | for en uforpliktende prat om dine muligheter.",
      "study_url": "https://fagskolen-viken.no/studier/elektro/vedlikeholdsteknikk-40"
    }
  ],
  "courses": []
}