{
  "study_programs": [
    {
      "id": "Verdiskapende dataanalyse - 10",
      "title": "Verdiskapende dataanalyse",
      "description": "Verdiskapende dataanalyse er emnet for deg som vil bruke sensordata og produksjonsdata til smartere drift. Du lærer å omsette data til konkrete forbedringer i energi- og ressursbruk, driftssikkerhet og vedlikehold – slik at virksomheten får bedre kvalitet, mindre nedetid og lavere miljøavtrykk.",
      "study_location": "Kjeller (Samlingsbasert ca. 12 uker)",
      "credits": 10,
      "language": "Norsk",
      "level": "Enkeltemne",
      "why_choose": "Industrien digitaliseres raskt, og virksomheter forventer at teknikere og fagarbeidere kan bruke data i daglig forbedringsarbeid. Dette emnet gir deg en praktisk, metodisk tilnærming til hvordan du samler inn, strukturerer, analyserer og presenterer data fra produksjon og anlegg – og hvordan funnene forankres i drift, vedlikehold og ledelse. Du jobber med realistiske case fra industri 4.0 og lærer å prioritere tiltak som gir målbar effekt.\nDette studiet er en del av | Industrifagskolen | .",
      "what_learn": "Emnet kombinerer nettundervisning, veiledning og praksisnære oppgaver. Du får en helhetlig forståelse av sensorer og datakilder, hvordan data lagres og kvalitetssikres, og hvordan analyser brukes til beslutninger i drift og vedlikehold. Læringsprosessen er lagt opp rundt virksomhetsnære problemstillinger: du kartlegger behov, definerer indikatorer, analyserer mønstre og presenterer forslag til forbedring og gevinst. Underveis trener du på å vurdere personvern og informasjonssikkerhet, og på å begrunne valg i et bærekrafts- og verdiskapingsperspektiv.\nKlikk på et tema for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger | Emnet gjennomføres som nettbasert deltidsundervisning med samlinger. Samlingene holdes vanligvis flere ganger i emneperioden og varer to til tre dager. Her jobber du praktisk med innsamling, analyse og formidling av data. | Det er ikke planlagt oppstart av dette studiet studieåret 2025/2026. Om du synes dette studiet virker interessant og ønsker å bli oppdatert om det blir nye oppstart, kan du | melde din interesse for dette studiet | .",
      "police_certificate": null,
      "career_opportunities": "Kompetansen fra emnet gjør deg i stand til å redusere nedetid, heve kvalitet og kutte energibruk gjennom datadrevne forbedringer. Du blir tryggere i roller som | tekniker, drifts- eller vedlikeholdsressurs, forbedringsleder eller fagspesialist | – i produksjon, prosessindustri, energi, teknisk forvaltning og tilhørende leverandørindustri. Du styrker også samarbeidet med IT/OT, HMS og ledelse gjennom tydeligere analyser, visualiseringer og beslutningsgrunnlag.",
      "contact_info": "Har du noen spørsmål? | Synes du dette virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. | Utdanningsleder: | Jøran Bergerud – e-post: | joranbe@afk.no | Studiekoordinator: | Helene Eikefjord – e-post: | heleneeik@afk.no | Du kan også melde din interesse i | dette skjemaet | for en uforpliktende prat om dine muligheter.",
      "study_url": "https://fagskolen-viken.no/studier/it-og-data/verdiskapende-dataanalyse"
    }
  ],
  "courses": []
}