{
  "study_programs": [
    {
      "id": "​​IT-systemdrift med cybersikkerhet​ - 60",
      "title": "​​IT-systemdrift med cybersikkerhet​",
      "description": "IT-systemdrift med cybersikkerhet er videreutdanningen for deg som vil jobbe mer profesjonelt med drift, nettverk og sikkerhet i moderne IT-miljøer. Du bygger praktisk kompetanse i å sikre systemer, avdekke sårbarheter og håndtere hendelser – kompetanse som er etterspurt i både privat og offentlig sektor.",
      "study_category": "IT og data",
      "study_location": {
        "0": "Kongsberg"
      },
      "study_type": {
        "8": "Samlingsbasert 2 år"
      },
      "credits": 60,
      "language": "Norsk",
      "level": "Fagskolegrad",
      "why_choose": "IT-miljøer blir stadig mer komplekse. Flere tjenester flyttes til skybaserte løsninger, flere systemer kobles sammen, og kravene til stabil drift og informasjonssikkerhet øker. Samtidig forventes det at IT-systemer er tilgjengelige, sikre og godt dokumenterte – også når noe går galt.\nDenne utdanningen er utviklet for deg som jobber med, eller ønsker å jobbe med, | drift og sikring av IT-systemer i praksis | . Du bygger kompetanse i å planlegge, drifte og sikre IT-infrastruktur, og får innsikt i hvordan sårbarheter oppdages, vurderes og følges opp i reelle driftssituasjoner. Studiet gir deg et faglig grunnlag for å ta ansvar for stabile, sikre og velfungerende IT-løsninger – i samarbeid med utviklere, leverandører og andre fagroller i virksomheten.",
      "what_learn": "I IT-systemdrift med cybersikkerhet bygger du bred og praktisk kompetanse innen utvikling av digitale systemer. Studiet gir deg forståelse for hele utviklingsløpet – fra idé og kravspesifikasjon til ferdig løsning i drift – med vekt på sammenhengen mellom programmering, databaser, infrastruktur og systemarkitektur.\nLæringen er praksisnær og tar utgangspunkt i problemstillinger som er relevante for arbeidslivet. Du arbeider både selvstendig og i team, og utvikler ferdigheter i samarbeid, dokumentasjon og faglige vurderinger. Gjennom studiet får du erfaring med prosjektarbeid og moderne utviklingsmetoder, inkludert bruk av automatisering og kunstig intelligens der dette er relevant for utvikling og drift av programvare.\nStudiet består av seks emner og avsluttes med et større prosjekt, der du anvender kompetansen din i en helhetlig løsning som speiler arbeidssituasjoner du kan møte i yrkesrollen.\nNedenfor kan du klikke på emnene for å lese mer om hva du lærer.",
      "teaching_format": "Nettbasert deltid med fysiske samlinger",
      "mandatory_attendance": "Undervisning og samlinger Studiet gjennomføres som nettbasert deltidsutdanning med samlinger over to år. Undervisningen kombinerer digitale læringsaktiviteter med samlinger som gir rom for praktisk arbeid, veiledning og faglig fordypning innen IT-drift og cybersikkerhet. Mellom samlingene arbeider du med oppgaver og læringsaktiviteter som er tett knyttet til arbeidslivet. Samlingene holdes vanligvis flere ganger per semester, og endelig plan publiseres på studentsiden før oppstart. Obligatorisk oppmøte Det kan være krav til oppmøte på samlinger og i enkelte læringsaktiviteter. For å få sluttvurdering i emnene må eventuelle oppmøtekrav være oppfylt. Nærmere informasjon finner du i studieplanen og emnebeskrivelsene.",
      "police_certificate": null,
      "career_opportunities": "Kompetansen fra IT-systemdrift med cybersikkerhet brukes i drift, sikring og videreutvikling av digitale systemer i både private og offentlige virksomheter. Som fagperson bidrar du til stabile, sikre og tilgjengelige IT-løsninger – og til å forebygge, avdekke og håndtere sikkerhetshendelser i organisasjonen. Utdanningen er relevant for roller der du har ansvar for systemdrift, nettverk, servere, skybaserte løsninger og IT-sikkerhet. Kompetansen brukes også i samarbeid med ledelse, leverandører og andre fagmiljøer, der du bidrar med tekniske vurderinger, dokumentasjon og tiltak knyttet til drift og sikkerhet. Studiet gir et faglig grunnlag for økt ansvar, spesialisering og videre utvikling innen IT-drift og cybersikkerhet, og er relevant for arbeid i virksomheter med høye krav til stabilitet, tilgjengelighet og informasjonssikkerhet.",
      "contact_info": "Har du noen spørsmål? | Synes du dette studiet virker spennende, men er usikker på hvordan du kommer i gang? Vi hjelper deg gjerne med å finne den løsningen som passer best for deg. Kontakt oss på e-post: | vikenfs@afk.no",
      "study_url": "https://fagskolen-viken.no/studier/it-og-data/it-systemdrift-med-cybersikkerhet"
    }
  ],
  "courses": []
}